podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV45F16.h
#define ADC_GC2_GAIN13(x)                        (((uint16_t)(((uint16_t)(x))<<10U))&0xC00UL)        /*!< ADC0_GC2.GAIN13 Field                   */
#define ADC_GC2_GAIN14_MASK                      (0x3000U)                                           /*!< ADC0_GC2.GAIN14 Mask                    */
#define ADC_GC2_GAIN14_SHIFT                     (12U)                                               /*!< ADC0_GC2.GAIN14 Position                */
#define ADC_GC2_GAIN14(x)                        (((uint16_t)(((uint16_t)(x))<<12U))&0x3000UL)       /*!< ADC0_GC2.GAIN14 Field                   */
#define ADC_GC2_GAIN15_MASK                      (0xC000U)                                           /*!< ADC0_GC2.GAIN15 Mask                    */
#define ADC_GC2_GAIN15_SHIFT                     (14U)                                               /*!< ADC0_GC2.GAIN15 Position                */
#define ADC_GC2_GAIN15(x)                        (((uint16_t)(((uint16_t)(x))<<14U))&0xC000UL)       /*!< ADC0_GC2.GAIN15 Field                   */
/* ------- SCTRL Bit Fields                         ------ */
#define ADC_SCTRL_SC_MASK                        (0xFFFFU)                                           /*!< ADC0_SCTRL.SC Mask                      */
#define ADC_SCTRL_SC_SHIFT                       (0U)                                                /*!< ADC0_SCTRL.SC Position                  */
#define ADC_SCTRL_SC(x)                          (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< ADC0_SCTRL.SC Field                     */
/* ------- PWR2 Bit Fields                          ------ */
#define ADC_PWR2_SPEEDA_MASK                     (0x3U)                                              /*!< ADC0_PWR2.SPEEDA Mask                   */
#define ADC_PWR2_SPEEDA_SHIFT                    (0U)                                                /*!< ADC0_PWR2.SPEEDA Position               */
#define ADC_PWR2_SPEEDA(x)                       (((uint16_t)(((uint16_t)(x))<<0U))&0x3UL)           /*!< ADC0_PWR2.SPEEDA Field                  */
#define ADC_PWR2_SPEEDB_MASK                     (0xCU)                                              /*!< ADC0_PWR2.SPEEDB Mask                   */
#define ADC_PWR2_SPEEDB_SHIFT                    (2U)                                                /*!< ADC0_PWR2.SPEEDB Position               */
#define ADC_PWR2_SPEEDB(x)                       (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< ADC0_PWR2.SPEEDB Field                  */
#define ADC_PWR2_DIV1_MASK                       (0x3F00U)                                           /*!< ADC0_PWR2.DIV1 Mask                     */
#define ADC_PWR2_DIV1_SHIFT                      (8U)                                                /*!< ADC0_PWR2.DIV1 Position                 */
#define ADC_PWR2_DIV1(x)                         (((uint16_t)(((uint16_t)(x))<<8U))&0x3F00UL)        /*!< ADC0_PWR2.DIV1 Field                    */
/* ------- CTRL3 Bit Fields                         ------ */
#define ADC_CTRL3_SCNT0_MASK                     (0x7U)                                              /*!< ADC0_CTRL3.SCNT0 Mask                   */
#define ADC_CTRL3_SCNT0_SHIFT                    (0U)                                                /*!< ADC0_CTRL3.SCNT0 Position               */
#define ADC_CTRL3_SCNT0(x)                       (((uint16_t)(((uint16_t)(x))<<0U))&0x7UL)           /*!< ADC0_CTRL3.SCNT0 Field                  */
#define ADC_CTRL3_SCNT1_MASK                     (0x38U)                                             /*!< ADC0_CTRL3.SCNT1 Mask                   */
#define ADC_CTRL3_SCNT1_SHIFT                    (3U)                                                /*!< ADC0_CTRL3.SCNT1 Position               */
#define ADC_CTRL3_SCNT1(x)                       (((uint16_t)(((uint16_t)(x))<<3U))&0x38UL)          /*!< ADC0_CTRL3.SCNT1 Field                  */
#define ADC_CTRL3_DMASRC_MASK                    (0x40U)                                             /*!< ADC0_CTRL3.DMASRC Mask                  */
#define ADC_CTRL3_DMASRC_SHIFT                   (6U)                                                /*!< ADC0_CTRL3.DMASRC Position              */
#define ADC_CTRL3_DMASRC(x)                      (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< ADC0_CTRL3.DMASRC Field                 */
/* ------- SCHLTEN Bit Fields                       ------ */
#define ADC_SCHLTEN_SCHLTEN_MASK                 (0xFFFFU)                                           /*!< ADC0_SCHLTEN.SCHLTEN Mask               */
#define ADC_SCHLTEN_SCHLTEN_SHIFT                (0U)                                                /*!< ADC0_SCHLTEN.SCHLTEN Position           */
#define ADC_SCHLTEN_SCHLTEN(x)                   (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< ADC0_SCHLTEN.SCHLTEN Field              */
/**
 * @} */ /* End group ADC_Register_Masks_GROUP 
 */

/* ADC0 - Peripheral instance base addresses */
#define ADC0_BasePtr                   0x4005C000UL //!< Peripheral base address
#define ADC0                           ((ADC_Type *) ADC0_BasePtr) //!< Freescale base pointer
#define ADC0_BASE_PTR                  (ADC0) //!< Freescale style base pointer
/**
 * @} */ /* End group ADC_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup AIPS_Peripheral_access_layer_GROUP AIPS Peripheral Access Layer
* @brief C Struct for AIPS
* @{
*/

/* ================================================================================ */
/* ================           AIPS0 (file:AIPS0_Lite_8Mx16P)       ================ */
/* ================================================================================ */

/**
 * @brief AIPS-Lite Bridge
 */
/**
* @addtogroup AIPS_structs_GROUP AIPS struct
* @brief Struct for AIPS
* @{
*/
typedef struct AIPS_Type {
   __IO uint32_t  MPRA;                         /**< 0000: Master Privilege Register A                                  */
        uint8_t   RESERVED_0[28];               /**< 0004: 0x1C bytes                                                   */
   __IO uint32_t  PACR[16];                     /**< 0020: Peripheral Access Control Register                           */
} AIPS_Type;

/**
 * @} */ /* End group AIPS_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'AIPS0' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */

