podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV45F16.h
#define AOI_BFCRT013_PT0_DC_SHIFT                (8U)                                                /*!< AOI_BFCRT013.PT0_DC Position            */
#define AOI_BFCRT013_PT0_DC(x)                   (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< AOI_BFCRT013.PT0_DC Field               */
#define AOI_BFCRT013_PT0_CC_MASK                 (0xC00U)                                            /*!< AOI_BFCRT013.PT0_CC Mask                */
#define AOI_BFCRT013_PT0_CC_SHIFT                (10U)                                               /*!< AOI_BFCRT013.PT0_CC Position            */
#define AOI_BFCRT013_PT0_CC(x)                   (((uint16_t)(((uint16_t)(x))<<10U))&0xC00UL)        /*!< AOI_BFCRT013.PT0_CC Field               */
#define AOI_BFCRT013_PT0_BC_MASK                 (0x3000U)                                           /*!< AOI_BFCRT013.PT0_BC Mask                */
#define AOI_BFCRT013_PT0_BC_SHIFT                (12U)                                               /*!< AOI_BFCRT013.PT0_BC Position            */
#define AOI_BFCRT013_PT0_BC(x)                   (((uint16_t)(((uint16_t)(x))<<12U))&0x3000UL)       /*!< AOI_BFCRT013.PT0_BC Field               */
#define AOI_BFCRT013_PT0_AC_MASK                 (0xC000U)                                           /*!< AOI_BFCRT013.PT0_AC Mask                */
#define AOI_BFCRT013_PT0_AC_SHIFT                (14U)                                               /*!< AOI_BFCRT013.PT0_AC Position            */
#define AOI_BFCRT013_PT0_AC(x)                   (((uint16_t)(((uint16_t)(x))<<14U))&0xC000UL)       /*!< AOI_BFCRT013.PT0_AC Field               */
/* ------- BFCRT233 Bit Fields                      ------ */
#define AOI_BFCRT233_PT3_DC_MASK                 (0x3U)                                              /*!< AOI_BFCRT233.PT3_DC Mask                */
#define AOI_BFCRT233_PT3_DC_SHIFT                (0U)                                                /*!< AOI_BFCRT233.PT3_DC Position            */
#define AOI_BFCRT233_PT3_DC(x)                   (((uint16_t)(((uint16_t)(x))<<0U))&0x3UL)           /*!< AOI_BFCRT233.PT3_DC Field               */
#define AOI_BFCRT233_PT3_CC_MASK                 (0xCU)                                              /*!< AOI_BFCRT233.PT3_CC Mask                */
#define AOI_BFCRT233_PT3_CC_SHIFT                (2U)                                                /*!< AOI_BFCRT233.PT3_CC Position            */
#define AOI_BFCRT233_PT3_CC(x)                   (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< AOI_BFCRT233.PT3_CC Field               */
#define AOI_BFCRT233_PT3_BC_MASK                 (0x30U)                                             /*!< AOI_BFCRT233.PT3_BC Mask                */
#define AOI_BFCRT233_PT3_BC_SHIFT                (4U)                                                /*!< AOI_BFCRT233.PT3_BC Position            */
#define AOI_BFCRT233_PT3_BC(x)                   (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< AOI_BFCRT233.PT3_BC Field               */
#define AOI_BFCRT233_PT3_AC_MASK                 (0xC0U)                                             /*!< AOI_BFCRT233.PT3_AC Mask                */
#define AOI_BFCRT233_PT3_AC_SHIFT                (6U)                                                /*!< AOI_BFCRT233.PT3_AC Position            */
#define AOI_BFCRT233_PT3_AC(x)                   (((uint16_t)(((uint16_t)(x))<<6U))&0xC0UL)          /*!< AOI_BFCRT233.PT3_AC Field               */
#define AOI_BFCRT233_PT2_DC_MASK                 (0x300U)                                            /*!< AOI_BFCRT233.PT2_DC Mask                */
#define AOI_BFCRT233_PT2_DC_SHIFT                (8U)                                                /*!< AOI_BFCRT233.PT2_DC Position            */
#define AOI_BFCRT233_PT2_DC(x)                   (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< AOI_BFCRT233.PT2_DC Field               */
#define AOI_BFCRT233_PT2_CC_MASK                 (0xC00U)                                            /*!< AOI_BFCRT233.PT2_CC Mask                */
#define AOI_BFCRT233_PT2_CC_SHIFT                (10U)                                               /*!< AOI_BFCRT233.PT2_CC Position            */
#define AOI_BFCRT233_PT2_CC(x)                   (((uint16_t)(((uint16_t)(x))<<10U))&0xC00UL)        /*!< AOI_BFCRT233.PT2_CC Field               */
#define AOI_BFCRT233_PT2_BC_MASK                 (0x3000U)                                           /*!< AOI_BFCRT233.PT2_BC Mask                */
#define AOI_BFCRT233_PT2_BC_SHIFT                (12U)                                               /*!< AOI_BFCRT233.PT2_BC Position            */
#define AOI_BFCRT233_PT2_BC(x)                   (((uint16_t)(((uint16_t)(x))<<12U))&0x3000UL)       /*!< AOI_BFCRT233.PT2_BC Field               */
#define AOI_BFCRT233_PT2_AC_MASK                 (0xC000U)                                           /*!< AOI_BFCRT233.PT2_AC Mask                */
#define AOI_BFCRT233_PT2_AC_SHIFT                (14U)                                               /*!< AOI_BFCRT233.PT2_AC Position            */
#define AOI_BFCRT233_PT2_AC(x)                   (((uint16_t)(((uint16_t)(x))<<14U))&0xC000UL)       /*!< AOI_BFCRT233.PT2_AC Field               */
/**
 * @} */ /* End group AOI_Register_Masks_GROUP 
 */

/* AOI - Peripheral instance base addresses */
#define AOI_BasePtr                    0x4005B000UL //!< Peripheral base address
#define AOI                            ((AOI_Type *) AOI_BasePtr) //!< Freescale base pointer
#define AOI_BASE_PTR                   (AOI) //!< Freescale style base pointer
/**
 * @} */ /* End group AOI_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup CAN_Peripheral_access_layer_GROUP CAN Peripheral Access Layer
* @brief C Struct for CAN
* @{
*/

/* ================================================================================ */
/* ================           CAN0 (file:CAN0_FLEX_MKV)            ================ */
/* ================================================================================ */

/**
 * @brief Flex Controller Area Network module
 */
#define CAN_FIFO_FILTER_COUNT 128       /**< Number of Filter IDs                               */
#define CAN_MESSAGE_BUFFER_COUNT 64     /**< Number of message buffers                          */
/**
* @addtogroup CAN_structs_GROUP CAN struct
* @brief Struct for CAN
* @{
*/
typedef struct CAN_Type {
   __IO uint32_t  MCR;                          /**< 0000: Module Configuration Register                                */
   __IO uint32_t  CTRL1;                        /**< 0004: Control 1 Register                                           */
   __IO uint32_t  TIMER;                        /**< 0008: Free Running Timer                                           */
        uint8_t   RESERVED_0[4];                /**< 000C: 0x4 bytes                                                    */
   __IO uint32_t  RXMGMASK;                     /**< 0010: Rx Mailboxes Global Mask Register                            */
   __IO uint32_t  RX14MASK;                     /**< 0014: Rx 14 Mask register                                          */
   __IO uint32_t  RX15MASK;                     /**< 0018: Rx 15 Mask register                                          */
   __IO uint32_t  ECR;                          /**< 001C: Error Counter                                                */
   __IO uint32_t  ESR1;                         /**< 0020: Error and Status 1 register                                  */
   __IO uint32_t  IMASK2;                       /**< 0024: Interrupt Masks 2 Register                                   */
   __IO uint32_t  IMASK1;                       /**< 0028: Interrupt Masks 1 register                                   */
   __IO uint32_t  IFLAG2;                       /**< 002C: Interrupt Flags 2 Register                                   */
   __IO uint32_t  IFLAG1;                       /**< 0030: Interrupt Flags 1 register                                   */
   __IO uint32_t  CTRL2;                        /**< 0034: Control 2 Register                                           */
   __I  uint32_t  ESR2;                         /**< 0038: Error and Status 2 register                                  */
        uint8_t   RESERVED_1[8];                /**< 003C: 0x8 bytes                                                    */
   __I  uint32_t  CRCR;                         /**< 0044: CRC Register                                                 */
   union {                                      /**< 0048: (size=0004)                                                  */
      __IO uint32_t  RXFGMASK;                  /**< 0048: Rx FIFO Global Mask register                                 */
      __IO uint32_t  RXFGMASK_A;                /**< 0048: Rx FIFO Global Mask register (format A)                      */
      __IO uint32_t  RXFGMASK_B;                /**< 0048: Rx FIFO Global Mask register (format B)                      */
      __IO uint32_t  RXFGMASK_C;                /**< 0048: Rx FIFO Global Mask register (format C)                      */
   };
   __I  uint32_t  RXFIR;                        /**< 004C: Rx FIFO Information Register                                 */
   __IO uint32_t  CBT;                          /**< 0050: CAN Bit Timing Register                                      */
        uint8_t   RESERVED_2[44];               /**< 0054: 0x2C bytes                                                   */
   union {                                      /**< 0080: (size=0400)                                                  */
      struct {
         __IO uint32_t  CS;                     /**< 0080: Message Buffer 0 CS Register                                 */
         __IO uint32_t  ID;                     /**< 0084: Message Buffer 0 ID Register                                 */
         __IO uint32_t  WORD0;                  /**< 0088: Message Buffer 0 WORD0 Register                              */
         __IO uint32_t  WORD1;                  /**< 008C: Message Buffer 0 WORD1 Register                              */
      } MB[CAN_MESSAGE_BUFFER_COUNT];           /**< 0080: (cluster: size=0x0400, 1024)                                 */
      struct {
         __IO uint32_t  CS;                     /**< 0080: FIFO Message Buffer CS Register                              */
         __IO uint32_t  ID;                     /**< 0084: FIFO Message Buffer ID Register                              */
         __IO uint32_t  WORD0;                  /**< 0088: FIFO Message Buffer WORD0 Register                           */
         __IO uint32_t  WORD1;                  /**< 008C: FIFO Message Buffer WORD1 Register                           */
              uint8_t   RESERVED_4[80];         /**< 0090: 0x50 bytes                                                   */
         union {                                /**< 00E0: (size=0200)                                                  */
            __IO uint32_t  FILTER_ID[CAN_FIFO_FILTER_COUNT]; /**< 00E0: FIFO Message Filter ID                                       */
            __IO uint32_t  FILTER_ID_A[CAN_FIFO_FILTER_COUNT]; /**< 00E0: FIFO Message Filter ID (format A)                            */
            __IO uint32_t  FILTER_ID_B[CAN_FIFO_FILTER_COUNT]; /**< 00E0: FIFO Message Filter ID (format B)                            */
            __IO uint32_t  FILTER_ID_C[CAN_FIFO_FILTER_COUNT]; /**< 00E0: FIFO Message Filter ID (format C)                            */
         };
      } FIFO;                                   /**< 0080: (cluster: size=0x0260, 608)                                  */
   };
        uint8_t   RESERVED_5[1024];             /**< 0480: 0x400 bytes                                                  */
   __IO uint32_t  RXIMR[CAN_MESSAGE_BUFFER_COUNT]; /**< 0880: Rx Individual Mask                                           */
} CAN_Type;

/**
 * @} */ /* End group CAN_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'CAN0' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

