podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV45F16.h
/**
* @addtogroup ENC_Register_Masks_GROUP ENC Register Masks
* @brief Register Masks for ENC
* @{
*/
/* ------- CTRL Bit Fields                          ------ */
#define ENC_CTRL_CMPIE_MASK                      (0x1U)                                              /*!< ENC_CTRL.CMPIE Mask                     */
#define ENC_CTRL_CMPIE_SHIFT                     (0U)                                                /*!< ENC_CTRL.CMPIE Position                 */
#define ENC_CTRL_CMPIE(x)                        (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< ENC_CTRL.CMPIE Field                    */
#define ENC_CTRL_CMPIRQ_MASK                     (0x2U)                                              /*!< ENC_CTRL.CMPIRQ Mask                    */
#define ENC_CTRL_CMPIRQ_SHIFT                    (1U)                                                /*!< ENC_CTRL.CMPIRQ Position                */
#define ENC_CTRL_CMPIRQ(x)                       (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< ENC_CTRL.CMPIRQ Field                   */
#define ENC_CTRL_WDE_MASK                        (0x4U)                                              /*!< ENC_CTRL.WDE Mask                       */
#define ENC_CTRL_WDE_SHIFT                       (2U)                                                /*!< ENC_CTRL.WDE Position                   */
#define ENC_CTRL_WDE(x)                          (((uint16_t)(((uint16_t)(x))<<2U))&0x4UL)           /*!< ENC_CTRL.WDE Field                      */
#define ENC_CTRL_DIE_MASK                        (0x8U)                                              /*!< ENC_CTRL.DIE Mask                       */
#define ENC_CTRL_DIE_SHIFT                       (3U)                                                /*!< ENC_CTRL.DIE Position                   */
#define ENC_CTRL_DIE(x)                          (((uint16_t)(((uint16_t)(x))<<3U))&0x8UL)           /*!< ENC_CTRL.DIE Field                      */
#define ENC_CTRL_DIRQ_MASK                       (0x10U)                                             /*!< ENC_CTRL.DIRQ Mask                      */
#define ENC_CTRL_DIRQ_SHIFT                      (4U)                                                /*!< ENC_CTRL.DIRQ Position                  */
#define ENC_CTRL_DIRQ(x)                         (((uint16_t)(((uint16_t)(x))<<4U))&0x10UL)          /*!< ENC_CTRL.DIRQ Field                     */
#define ENC_CTRL_XNE_MASK                        (0x20U)                                             /*!< ENC_CTRL.XNE Mask                       */
#define ENC_CTRL_XNE_SHIFT                       (5U)                                                /*!< ENC_CTRL.XNE Position                   */
#define ENC_CTRL_XNE(x)                          (((uint16_t)(((uint16_t)(x))<<5U))&0x20UL)          /*!< ENC_CTRL.XNE Field                      */
#define ENC_CTRL_XIP_MASK                        (0x40U)                                             /*!< ENC_CTRL.XIP Mask                       */
#define ENC_CTRL_XIP_SHIFT                       (6U)                                                /*!< ENC_CTRL.XIP Position                   */
#define ENC_CTRL_XIP(x)                          (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< ENC_CTRL.XIP Field                      */
#define ENC_CTRL_XIE_MASK                        (0x80U)                                             /*!< ENC_CTRL.XIE Mask                       */
#define ENC_CTRL_XIE_SHIFT                       (7U)                                                /*!< ENC_CTRL.XIE Position                   */
#define ENC_CTRL_XIE(x)                          (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< ENC_CTRL.XIE Field                      */
#define ENC_CTRL_XIRQ_MASK                       (0x100U)                                            /*!< ENC_CTRL.XIRQ Mask                      */
#define ENC_CTRL_XIRQ_SHIFT                      (8U)                                                /*!< ENC_CTRL.XIRQ Position                  */
#define ENC_CTRL_XIRQ(x)                         (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< ENC_CTRL.XIRQ Field                     */
#define ENC_CTRL_PH1_MASK                        (0x200U)                                            /*!< ENC_CTRL.PH1 Mask                       */
#define ENC_CTRL_PH1_SHIFT                       (9U)                                                /*!< ENC_CTRL.PH1 Position                   */
#define ENC_CTRL_PH1(x)                          (((uint16_t)(((uint16_t)(x))<<9U))&0x200UL)         /*!< ENC_CTRL.PH1 Field                      */
#define ENC_CTRL_REV_MASK                        (0x400U)                                            /*!< ENC_CTRL.REV Mask                       */
#define ENC_CTRL_REV_SHIFT                       (10U)                                               /*!< ENC_CTRL.REV Position                   */
#define ENC_CTRL_REV(x)                          (((uint16_t)(((uint16_t)(x))<<10U))&0x400UL)        /*!< ENC_CTRL.REV Field                      */
#define ENC_CTRL_SWIP_MASK                       (0x800U)                                            /*!< ENC_CTRL.SWIP Mask                      */
#define ENC_CTRL_SWIP_SHIFT                      (11U)                                               /*!< ENC_CTRL.SWIP Position                  */
#define ENC_CTRL_SWIP(x)                         (((uint16_t)(((uint16_t)(x))<<11U))&0x800UL)        /*!< ENC_CTRL.SWIP Field                     */
#define ENC_CTRL_HNE_MASK                        (0x1000U)                                           /*!< ENC_CTRL.HNE Mask                       */
#define ENC_CTRL_HNE_SHIFT                       (12U)                                               /*!< ENC_CTRL.HNE Position                   */
#define ENC_CTRL_HNE(x)                          (((uint16_t)(((uint16_t)(x))<<12U))&0x1000UL)       /*!< ENC_CTRL.HNE Field                      */
#define ENC_CTRL_HIP_MASK                        (0x2000U)                                           /*!< ENC_CTRL.HIP Mask                       */
#define ENC_CTRL_HIP_SHIFT                       (13U)                                               /*!< ENC_CTRL.HIP Position                   */
#define ENC_CTRL_HIP(x)                          (((uint16_t)(((uint16_t)(x))<<13U))&0x2000UL)       /*!< ENC_CTRL.HIP Field                      */
#define ENC_CTRL_HIE_MASK                        (0x4000U)                                           /*!< ENC_CTRL.HIE Mask                       */
#define ENC_CTRL_HIE_SHIFT                       (14U)                                               /*!< ENC_CTRL.HIE Position                   */
#define ENC_CTRL_HIE(x)                          (((uint16_t)(((uint16_t)(x))<<14U))&0x4000UL)       /*!< ENC_CTRL.HIE Field                      */
#define ENC_CTRL_HIRQ_MASK                       (0x8000U)                                           /*!< ENC_CTRL.HIRQ Mask                      */
#define ENC_CTRL_HIRQ_SHIFT                      (15U)                                               /*!< ENC_CTRL.HIRQ Position                  */
#define ENC_CTRL_HIRQ(x)                         (((uint16_t)(((uint16_t)(x))<<15U))&0x8000UL)       /*!< ENC_CTRL.HIRQ Field                     */
/* ------- FILT Bit Fields                          ------ */
#define ENC_FILT_FILT_PER_MASK                   (0xFFU)                                             /*!< ENC_FILT.FILT_PER Mask                  */
#define ENC_FILT_FILT_PER_SHIFT                  (0U)                                                /*!< ENC_FILT.FILT_PER Position              */
#define ENC_FILT_FILT_PER(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFUL)          /*!< ENC_FILT.FILT_PER Field                 */
#define ENC_FILT_FILT_CNT_MASK                   (0x700U)                                            /*!< ENC_FILT.FILT_CNT Mask                  */
#define ENC_FILT_FILT_CNT_SHIFT                  (8U)                                                /*!< ENC_FILT.FILT_CNT Position              */
#define ENC_FILT_FILT_CNT(x)                     (((uint16_t)(((uint16_t)(x))<<8U))&0x700UL)         /*!< ENC_FILT.FILT_CNT Field                 */
/* ------- WTR Bit Fields                           ------ */
#define ENC_WTR_WDOG_MASK                        (0xFFFFU)                                           /*!< ENC_WTR.WDOG Mask                       */
#define ENC_WTR_WDOG_SHIFT                       (0U)                                                /*!< ENC_WTR.WDOG Position                   */
#define ENC_WTR_WDOG(x)                          (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< ENC_WTR.WDOG Field                      */
/* ------- POSD Bit Fields                          ------ */
#define ENC_POSD_POSD_MASK                       (0xFFFFU)                                           /*!< ENC_POSD.POSD Mask                      */
#define ENC_POSD_POSD_SHIFT                      (0U)                                                /*!< ENC_POSD.POSD Position                  */
#define ENC_POSD_POSD(x)                         (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< ENC_POSD.POSD Field                     */
/* ------- POSDH Bit Fields                         ------ */
#define ENC_POSDH_POSDH_MASK                     (0xFFFFU)                                           /*!< ENC_POSDH.POSDH Mask                    */
#define ENC_POSDH_POSDH_SHIFT                    (0U)                                                /*!< ENC_POSDH.POSDH Position                */
#define ENC_POSDH_POSDH(x)                       (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< ENC_POSDH.POSDH Field                   */
/* ------- REV Bit Fields                           ------ */
#define ENC_REV_REV_MASK                         (0xFFFFU)                                           /*!< ENC_REV.REV Mask                        */
#define ENC_REV_REV_SHIFT                        (0U)                                                /*!< ENC_REV.REV Position                    */
#define ENC_REV_REV(x)                           (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< ENC_REV.REV Field                       */
/* ------- REVH Bit Fields                          ------ */
#define ENC_REVH_REVH_MASK                       (0xFFFFU)                                           /*!< ENC_REVH.REVH Mask                      */
#define ENC_REVH_REVH_SHIFT                      (0U)                                                /*!< ENC_REVH.REVH Position                  */
#define ENC_REVH_REVH(x)                         (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< ENC_REVH.REVH Field                     */
/* ------- UPOS Bit Fields                          ------ */
#define ENC_UPOS_POS_MASK                        (0xFFFFU)                                           /*!< ENC_UPOS.POS Mask                       */
#define ENC_UPOS_POS_SHIFT                       (0U)                                                /*!< ENC_UPOS.POS Position                   */
#define ENC_UPOS_POS(x)                          (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< ENC_UPOS.POS Field                      */
/* ------- LPOS Bit Fields                          ------ */
#define ENC_LPOS_POS_MASK                        (0xFFFFU)                                           /*!< ENC_LPOS.POS Mask                       */
#define ENC_LPOS_POS_SHIFT                       (0U)                                                /*!< ENC_LPOS.POS Position                   */
#define ENC_LPOS_POS(x)                          (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< ENC_LPOS.POS Field                      */
/* ------- UPOSH Bit Fields                         ------ */
#define ENC_UPOSH_POSH_MASK                      (0xFFFFU)                                           /*!< ENC_UPOSH.POSH Mask                     */
#define ENC_UPOSH_POSH_SHIFT                     (0U)                                                /*!< ENC_UPOSH.POSH Position                 */
#define ENC_UPOSH_POSH(x)                        (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< ENC_UPOSH.POSH Field                    */
/* ------- LPOSH Bit Fields                         ------ */
#define ENC_LPOSH_POSH_MASK                      (0xFFFFU)                                           /*!< ENC_LPOSH.POSH Mask                     */
#define ENC_LPOSH_POSH_SHIFT                     (0U)                                                /*!< ENC_LPOSH.POSH Position                 */
#define ENC_LPOSH_POSH(x)                        (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< ENC_LPOSH.POSH Field                    */
/* ------- UINIT Bit Fields                         ------ */
#define ENC_UINIT_INIT_MASK                      (0xFFFFU)                                           /*!< ENC_UINIT.INIT Mask                     */
#define ENC_UINIT_INIT_SHIFT                     (0U)                                                /*!< ENC_UINIT.INIT Position                 */
#define ENC_UINIT_INIT(x)                        (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< ENC_UINIT.INIT Field                    */
/* ------- LINIT Bit Fields                         ------ */
#define ENC_LINIT_INIT_MASK                      (0xFFFFU)                                           /*!< ENC_LINIT.INIT Mask                     */
#define ENC_LINIT_INIT_SHIFT                     (0U)                                                /*!< ENC_LINIT.INIT Position                 */
#define ENC_LINIT_INIT(x)                        (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< ENC_LINIT.INIT Field                    */
/* ------- IMR Bit Fields                           ------ */
#define ENC_IMR_HOME_MASK                        (0x1U)                                              /*!< ENC_IMR.HOME Mask                       */
#define ENC_IMR_HOME_SHIFT                       (0U)                                                /*!< ENC_IMR.HOME Position                   */
#define ENC_IMR_HOME(x)                          (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< ENC_IMR.HOME Field                      */
#define ENC_IMR_INDEX_MASK                       (0x2U)                                              /*!< ENC_IMR.INDEX Mask                      */
#define ENC_IMR_INDEX_SHIFT                      (1U)                                                /*!< ENC_IMR.INDEX Position                  */
#define ENC_IMR_INDEX(x)                         (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< ENC_IMR.INDEX Field                     */
#define ENC_IMR_PHB_MASK                         (0x4U)                                              /*!< ENC_IMR.PHB Mask                        */
#define ENC_IMR_PHB_SHIFT                        (2U)                                                /*!< ENC_IMR.PHB Position                    */
#define ENC_IMR_PHB(x)                           (((uint16_t)(((uint16_t)(x))<<2U))&0x4UL)           /*!< ENC_IMR.PHB Field                       */
#define ENC_IMR_PHA_MASK                         (0x8U)                                              /*!< ENC_IMR.PHA Mask                        */
#define ENC_IMR_PHA_SHIFT                        (3U)                                                /*!< ENC_IMR.PHA Position                    */
#define ENC_IMR_PHA(x)                           (((uint16_t)(((uint16_t)(x))<<3U))&0x8UL)           /*!< ENC_IMR.PHA Field                       */
#define ENC_IMR_FHOM_MASK                        (0x10U)                                             /*!< ENC_IMR.FHOM Mask                       */
#define ENC_IMR_FHOM_SHIFT                       (4U)                                                /*!< ENC_IMR.FHOM Position                   */
#define ENC_IMR_FHOM(x)                          (((uint16_t)(((uint16_t)(x))<<4U))&0x10UL)          /*!< ENC_IMR.FHOM Field                      */
#define ENC_IMR_FIND_MASK                        (0x20U)                                             /*!< ENC_IMR.FIND Mask                       */
#define ENC_IMR_FIND_SHIFT                       (5U)                                                /*!< ENC_IMR.FIND Position                   */
#define ENC_IMR_FIND(x)                          (((uint16_t)(((uint16_t)(x))<<5U))&0x20UL)          /*!< ENC_IMR.FIND Field                      */
#define ENC_IMR_FPHB_MASK                        (0x40U)                                             /*!< ENC_IMR.FPHB Mask                       */
#define ENC_IMR_FPHB_SHIFT                       (6U)                                                /*!< ENC_IMR.FPHB Position                   */
#define ENC_IMR_FPHB(x)                          (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< ENC_IMR.FPHB Field                      */
#define ENC_IMR_FPHA_MASK                        (0x80U)                                             /*!< ENC_IMR.FPHA Mask                       */
#define ENC_IMR_FPHA_SHIFT                       (7U)                                                /*!< ENC_IMR.FPHA Position                   */
#define ENC_IMR_FPHA(x)                          (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< ENC_IMR.FPHA Field                      */
/* ------- TST Bit Fields                           ------ */
#define ENC_TST_TEST_COUNT_MASK                  (0xFFU)                                             /*!< ENC_TST.TEST_COUNT Mask                 */
#define ENC_TST_TEST_COUNT_SHIFT                 (0U)                                                /*!< ENC_TST.TEST_COUNT Position             */
#define ENC_TST_TEST_COUNT(x)                    (((uint16_t)(((uint16_t)(x))<<0U))&0xFFUL)          /*!< ENC_TST.TEST_COUNT Field                */
#define ENC_TST_TEST_PERIOD_MASK                 (0x1F00U)                                           /*!< ENC_TST.TEST_PERIOD Mask                */
#define ENC_TST_TEST_PERIOD_SHIFT                (8U)                                                /*!< ENC_TST.TEST_PERIOD Position            */
#define ENC_TST_TEST_PERIOD(x)                   (((uint16_t)(((uint16_t)(x))<<8U))&0x1F00UL)        /*!< ENC_TST.TEST_PERIOD Field               */
#define ENC_TST_QDN_MASK                         (0x2000U)                                           /*!< ENC_TST.QDN Mask                        */
#define ENC_TST_QDN_SHIFT                        (13U)                                               /*!< ENC_TST.QDN Position                    */
#define ENC_TST_QDN(x)                           (((uint16_t)(((uint16_t)(x))<<13U))&0x2000UL)       /*!< ENC_TST.QDN Field                       */
#define ENC_TST_TCE_MASK                         (0x4000U)                                           /*!< ENC_TST.TCE Mask                        */
#define ENC_TST_TCE_SHIFT                        (14U)                                               /*!< ENC_TST.TCE Position                    */
#define ENC_TST_TCE(x)                           (((uint16_t)(((uint16_t)(x))<<14U))&0x4000UL)       /*!< ENC_TST.TCE Field                       */
#define ENC_TST_TEN_MASK                         (0x8000U)                                           /*!< ENC_TST.TEN Mask                        */
#define ENC_TST_TEN_SHIFT                        (15U)                                               /*!< ENC_TST.TEN Position                    */
#define ENC_TST_TEN(x)                           (((uint16_t)(((uint16_t)(x))<<15U))&0x8000UL)       /*!< ENC_TST.TEN Field                       */
/* ------- CTRL2 Bit Fields                         ------ */
#define ENC_CTRL2_UPDHLD_MASK                    (0x1U)                                              /*!< ENC_CTRL2.UPDHLD Mask                   */
#define ENC_CTRL2_UPDHLD_SHIFT                   (0U)                                                /*!< ENC_CTRL2.UPDHLD Position               */
#define ENC_CTRL2_UPDHLD(x)                      (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< ENC_CTRL2.UPDHLD Field                  */
#define ENC_CTRL2_UPDPOS_MASK                    (0x2U)                                              /*!< ENC_CTRL2.UPDPOS Mask                   */
#define ENC_CTRL2_UPDPOS_SHIFT                   (1U)                                                /*!< ENC_CTRL2.UPDPOS Position               */
#define ENC_CTRL2_UPDPOS(x)                      (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< ENC_CTRL2.UPDPOS Field                  */
#define ENC_CTRL2_MOD_MASK                       (0x4U)                                              /*!< ENC_CTRL2.MOD Mask                      */
#define ENC_CTRL2_MOD_SHIFT                      (2U)                                                /*!< ENC_CTRL2.MOD Position                  */
#define ENC_CTRL2_MOD(x)                         (((uint16_t)(((uint16_t)(x))<<2U))&0x4UL)           /*!< ENC_CTRL2.MOD Field                     */
#define ENC_CTRL2_DIR_MASK                       (0x8U)                                              /*!< ENC_CTRL2.DIR Mask                      */
#define ENC_CTRL2_DIR_SHIFT                      (3U)                                                /*!< ENC_CTRL2.DIR Position                  */
#define ENC_CTRL2_DIR(x)                         (((uint16_t)(((uint16_t)(x))<<3U))&0x8UL)           /*!< ENC_CTRL2.DIR Field                     */
#define ENC_CTRL2_RUIE_MASK                      (0x10U)                                             /*!< ENC_CTRL2.RUIE Mask                     */
#define ENC_CTRL2_RUIE_SHIFT                     (4U)                                                /*!< ENC_CTRL2.RUIE Position                 */
#define ENC_CTRL2_RUIE(x)                        (((uint16_t)(((uint16_t)(x))<<4U))&0x10UL)          /*!< ENC_CTRL2.RUIE Field                    */
#define ENC_CTRL2_RUIRQ_MASK                     (0x20U)                                             /*!< ENC_CTRL2.RUIRQ Mask                    */
#define ENC_CTRL2_RUIRQ_SHIFT                    (5U)                                                /*!< ENC_CTRL2.RUIRQ Position                */
#define ENC_CTRL2_RUIRQ(x)                       (((uint16_t)(((uint16_t)(x))<<5U))&0x20UL)          /*!< ENC_CTRL2.RUIRQ Field                   */
#define ENC_CTRL2_ROIE_MASK                      (0x40U)                                             /*!< ENC_CTRL2.ROIE Mask                     */
#define ENC_CTRL2_ROIE_SHIFT                     (6U)                                                /*!< ENC_CTRL2.ROIE Position                 */
#define ENC_CTRL2_ROIE(x)                        (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< ENC_CTRL2.ROIE Field                    */
#define ENC_CTRL2_ROIRQ_MASK                     (0x80U)                                             /*!< ENC_CTRL2.ROIRQ Mask                    */
#define ENC_CTRL2_ROIRQ_SHIFT                    (7U)                                                /*!< ENC_CTRL2.ROIRQ Position                */
#define ENC_CTRL2_ROIRQ(x)                       (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< ENC_CTRL2.ROIRQ Field                   */
#define ENC_CTRL2_REVMOD_MASK                    (0x100U)                                            /*!< ENC_CTRL2.REVMOD Mask                   */
#define ENC_CTRL2_REVMOD_SHIFT                   (8U)                                                /*!< ENC_CTRL2.REVMOD Position               */
#define ENC_CTRL2_REVMOD(x)                      (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< ENC_CTRL2.REVMOD Field                  */
