podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV45F16.h
/**
* @addtogroup PWMA_Register_Masks_GROUP PWMA Register Masks
* @brief Register Masks for PWMA
* @{
*/
/* ------- SM0CNT Bit Fields                        ------ */
#define PWMA_SM0CNT_CNT_MASK                     (0xFFFFU)                                           /*!< PWMA_SM0CNT.CNT Mask                    */
#define PWMA_SM0CNT_CNT_SHIFT                    (0U)                                                /*!< PWMA_SM0CNT.CNT Position                */
#define PWMA_SM0CNT_CNT(x)                       (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM0CNT.CNT Field                   */
/* ------- SM0INIT Bit Fields                       ------ */
#define PWMA_SM0INIT_INIT_MASK                   (0xFFFFU)                                           /*!< PWMA_SM0INIT.INIT Mask                  */
#define PWMA_SM0INIT_INIT_SHIFT                  (0U)                                                /*!< PWMA_SM0INIT.INIT Position              */
#define PWMA_SM0INIT_INIT(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM0INIT.INIT Field                 */
/* ------- SM0CTRL2 Bit Fields                      ------ */
#define PWMA_SM0CTRL2_CLK_SEL_MASK               (0x3U)                                              /*!< PWMA_SM0CTRL2.CLK_SEL Mask              */
#define PWMA_SM0CTRL2_CLK_SEL_SHIFT              (0U)                                                /*!< PWMA_SM0CTRL2.CLK_SEL Position          */
#define PWMA_SM0CTRL2_CLK_SEL(x)                 (((uint16_t)(((uint16_t)(x))<<0U))&0x3UL)           /*!< PWMA_SM0CTRL2.CLK_SEL Field             */
#define PWMA_SM0CTRL2_RELOAD_SEL_MASK            (0x4U)                                              /*!< PWMA_SM0CTRL2.RELOAD_SEL Mask           */
#define PWMA_SM0CTRL2_RELOAD_SEL_SHIFT           (2U)                                                /*!< PWMA_SM0CTRL2.RELOAD_SEL Position       */
#define PWMA_SM0CTRL2_RELOAD_SEL(x)              (((uint16_t)(((uint16_t)(x))<<2U))&0x4UL)           /*!< PWMA_SM0CTRL2.RELOAD_SEL Field          */
#define PWMA_SM0CTRL2_FORCE_SEL_MASK             (0x38U)                                             /*!< PWMA_SM0CTRL2.FORCE_SEL Mask            */
#define PWMA_SM0CTRL2_FORCE_SEL_SHIFT            (3U)                                                /*!< PWMA_SM0CTRL2.FORCE_SEL Position        */
#define PWMA_SM0CTRL2_FORCE_SEL(x)               (((uint16_t)(((uint16_t)(x))<<3U))&0x38UL)          /*!< PWMA_SM0CTRL2.FORCE_SEL Field           */
#define PWMA_SM0CTRL2_FORCE_MASK                 (0x40U)                                             /*!< PWMA_SM0CTRL2.FORCE Mask                */
#define PWMA_SM0CTRL2_FORCE_SHIFT                (6U)                                                /*!< PWMA_SM0CTRL2.FORCE Position            */
#define PWMA_SM0CTRL2_FORCE(x)                   (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< PWMA_SM0CTRL2.FORCE Field               */
#define PWMA_SM0CTRL2_FRCEN_MASK                 (0x80U)                                             /*!< PWMA_SM0CTRL2.FRCEN Mask                */
#define PWMA_SM0CTRL2_FRCEN_SHIFT                (7U)                                                /*!< PWMA_SM0CTRL2.FRCEN Position            */
#define PWMA_SM0CTRL2_FRCEN(x)                   (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< PWMA_SM0CTRL2.FRCEN Field               */
#define PWMA_SM0CTRL2_INIT_SEL_MASK              (0x300U)                                            /*!< PWMA_SM0CTRL2.INIT_SEL Mask             */
#define PWMA_SM0CTRL2_INIT_SEL_SHIFT             (8U)                                                /*!< PWMA_SM0CTRL2.INIT_SEL Position         */
#define PWMA_SM0CTRL2_INIT_SEL(x)                (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< PWMA_SM0CTRL2.INIT_SEL Field            */
#define PWMA_SM0CTRL2_PWMX_INIT_MASK             (0x400U)                                            /*!< PWMA_SM0CTRL2.PWMX_INIT Mask            */
#define PWMA_SM0CTRL2_PWMX_INIT_SHIFT            (10U)                                               /*!< PWMA_SM0CTRL2.PWMX_INIT Position        */
#define PWMA_SM0CTRL2_PWMX_INIT(x)               (((uint16_t)(((uint16_t)(x))<<10U))&0x400UL)        /*!< PWMA_SM0CTRL2.PWMX_INIT Field           */
#define PWMA_SM0CTRL2_PWM45_INIT_MASK            (0x800U)                                            /*!< PWMA_SM0CTRL2.PWM45_INIT Mask           */
#define PWMA_SM0CTRL2_PWM45_INIT_SHIFT           (11U)                                               /*!< PWMA_SM0CTRL2.PWM45_INIT Position       */
#define PWMA_SM0CTRL2_PWM45_INIT(x)              (((uint16_t)(((uint16_t)(x))<<11U))&0x800UL)        /*!< PWMA_SM0CTRL2.PWM45_INIT Field          */
#define PWMA_SM0CTRL2_PWM23_INIT_MASK            (0x1000U)                                           /*!< PWMA_SM0CTRL2.PWM23_INIT Mask           */
#define PWMA_SM0CTRL2_PWM23_INIT_SHIFT           (12U)                                               /*!< PWMA_SM0CTRL2.PWM23_INIT Position       */
#define PWMA_SM0CTRL2_PWM23_INIT(x)              (((uint16_t)(((uint16_t)(x))<<12U))&0x1000UL)       /*!< PWMA_SM0CTRL2.PWM23_INIT Field          */
#define PWMA_SM0CTRL2_INDEP_MASK                 (0x2000U)                                           /*!< PWMA_SM0CTRL2.INDEP Mask                */
#define PWMA_SM0CTRL2_INDEP_SHIFT                (13U)                                               /*!< PWMA_SM0CTRL2.INDEP Position            */
#define PWMA_SM0CTRL2_INDEP(x)                   (((uint16_t)(((uint16_t)(x))<<13U))&0x2000UL)       /*!< PWMA_SM0CTRL2.INDEP Field               */
#define PWMA_SM0CTRL2_WAITEN_MASK                (0x4000U)                                           /*!< PWMA_SM0CTRL2.WAITEN Mask               */
#define PWMA_SM0CTRL2_WAITEN_SHIFT               (14U)                                               /*!< PWMA_SM0CTRL2.WAITEN Position           */
#define PWMA_SM0CTRL2_WAITEN(x)                  (((uint16_t)(((uint16_t)(x))<<14U))&0x4000UL)       /*!< PWMA_SM0CTRL2.WAITEN Field              */
#define PWMA_SM0CTRL2_DBGEN_MASK                 (0x8000U)                                           /*!< PWMA_SM0CTRL2.DBGEN Mask                */
#define PWMA_SM0CTRL2_DBGEN_SHIFT                (15U)                                               /*!< PWMA_SM0CTRL2.DBGEN Position            */
#define PWMA_SM0CTRL2_DBGEN(x)                   (((uint16_t)(((uint16_t)(x))<<15U))&0x8000UL)       /*!< PWMA_SM0CTRL2.DBGEN Field               */
/* ------- SM0CTRL Bit Fields                       ------ */
#define PWMA_SM0CTRL_DBLEN_MASK                  (0x1U)                                              /*!< PWMA_SM0CTRL.DBLEN Mask                 */
#define PWMA_SM0CTRL_DBLEN_SHIFT                 (0U)                                                /*!< PWMA_SM0CTRL.DBLEN Position             */
#define PWMA_SM0CTRL_DBLEN(x)                    (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< PWMA_SM0CTRL.DBLEN Field                */
#define PWMA_SM0CTRL_DBLX_MASK                   (0x2U)                                              /*!< PWMA_SM0CTRL.DBLX Mask                  */
#define PWMA_SM0CTRL_DBLX_SHIFT                  (1U)                                                /*!< PWMA_SM0CTRL.DBLX Position              */
#define PWMA_SM0CTRL_DBLX(x)                     (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< PWMA_SM0CTRL.DBLX Field                 */
#define PWMA_SM0CTRL_LDMOD_MASK                  (0x4U)                                              /*!< PWMA_SM0CTRL.LDMOD Mask                 */
#define PWMA_SM0CTRL_LDMOD_SHIFT                 (2U)                                                /*!< PWMA_SM0CTRL.LDMOD Position             */
#define PWMA_SM0CTRL_LDMOD(x)                    (((uint16_t)(((uint16_t)(x))<<2U))&0x4UL)           /*!< PWMA_SM0CTRL.LDMOD Field                */
#define PWMA_SM0CTRL_PRSC_MASK                   (0x70U)                                             /*!< PWMA_SM0CTRL.PRSC Mask                  */
#define PWMA_SM0CTRL_PRSC_SHIFT                  (4U)                                                /*!< PWMA_SM0CTRL.PRSC Position              */
#define PWMA_SM0CTRL_PRSC(x)                     (((uint16_t)(((uint16_t)(x))<<4U))&0x70UL)          /*!< PWMA_SM0CTRL.PRSC Field                 */
#define PWMA_SM0CTRL_DT_MASK                     (0x300U)                                            /*!< PWMA_SM0CTRL.DT Mask                    */
#define PWMA_SM0CTRL_DT_SHIFT                    (8U)                                                /*!< PWMA_SM0CTRL.DT Position                */
#define PWMA_SM0CTRL_DT(x)                       (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< PWMA_SM0CTRL.DT Field                   */
#define PWMA_SM0CTRL_FULL_MASK                   (0x400U)                                            /*!< PWMA_SM0CTRL.FULL Mask                  */
#define PWMA_SM0CTRL_FULL_SHIFT                  (10U)                                               /*!< PWMA_SM0CTRL.FULL Position              */
#define PWMA_SM0CTRL_FULL(x)                     (((uint16_t)(((uint16_t)(x))<<10U))&0x400UL)        /*!< PWMA_SM0CTRL.FULL Field                 */
#define PWMA_SM0CTRL_HALF_MASK                   (0x800U)                                            /*!< PWMA_SM0CTRL.HALF Mask                  */
#define PWMA_SM0CTRL_HALF_SHIFT                  (11U)                                               /*!< PWMA_SM0CTRL.HALF Position              */
#define PWMA_SM0CTRL_HALF(x)                     (((uint16_t)(((uint16_t)(x))<<11U))&0x800UL)        /*!< PWMA_SM0CTRL.HALF Field                 */
#define PWMA_SM0CTRL_LDFQ_MASK                   (0xF000U)                                           /*!< PWMA_SM0CTRL.LDFQ Mask                  */
#define PWMA_SM0CTRL_LDFQ_SHIFT                  (12U)                                               /*!< PWMA_SM0CTRL.LDFQ Position              */
#define PWMA_SM0CTRL_LDFQ(x)                     (((uint16_t)(((uint16_t)(x))<<12U))&0xF000UL)       /*!< PWMA_SM0CTRL.LDFQ Field                 */
/* ------- SM0VAL0 Bit Fields                       ------ */
#define PWMA_SM0VAL0_VAL0_MASK                   (0xFFFFU)                                           /*!< PWMA_SM0VAL0.VAL0 Mask                  */
#define PWMA_SM0VAL0_VAL0_SHIFT                  (0U)                                                /*!< PWMA_SM0VAL0.VAL0 Position              */
#define PWMA_SM0VAL0_VAL0(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM0VAL0.VAL0 Field                 */
/* ------- SM0FRACVAL1 Bit Fields                   ------ */
#define PWMA_SM0FRACVAL1_FRACVAL1_MASK           (0xF800U)                                           /*!< PWMA_SM0FRACVAL1.FRACVAL1 Mask          */
#define PWMA_SM0FRACVAL1_FRACVAL1_SHIFT          (11U)                                               /*!< PWMA_SM0FRACVAL1.FRACVAL1 Position      */
#define PWMA_SM0FRACVAL1_FRACVAL1(x)             (((uint16_t)(((uint16_t)(x))<<11U))&0xF800UL)       /*!< PWMA_SM0FRACVAL1.FRACVAL1 Field         */
/* ------- SM0VAL1 Bit Fields                       ------ */
#define PWMA_SM0VAL1_VAL1_MASK                   (0xFFFFU)                                           /*!< PWMA_SM0VAL1.VAL1 Mask                  */
#define PWMA_SM0VAL1_VAL1_SHIFT                  (0U)                                                /*!< PWMA_SM0VAL1.VAL1 Position              */
#define PWMA_SM0VAL1_VAL1(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM0VAL1.VAL1 Field                 */
/* ------- SM0FRACVAL2 Bit Fields                   ------ */
#define PWMA_SM0FRACVAL2_FRACVAL2_MASK           (0xF800U)                                           /*!< PWMA_SM0FRACVAL2.FRACVAL2 Mask          */
#define PWMA_SM0FRACVAL2_FRACVAL2_SHIFT          (11U)                                               /*!< PWMA_SM0FRACVAL2.FRACVAL2 Position      */
#define PWMA_SM0FRACVAL2_FRACVAL2(x)             (((uint16_t)(((uint16_t)(x))<<11U))&0xF800UL)       /*!< PWMA_SM0FRACVAL2.FRACVAL2 Field         */
/* ------- SM0VAL2 Bit Fields                       ------ */
#define PWMA_SM0VAL2_VAL2_MASK                   (0xFFFFU)                                           /*!< PWMA_SM0VAL2.VAL2 Mask                  */
#define PWMA_SM0VAL2_VAL2_SHIFT                  (0U)                                                /*!< PWMA_SM0VAL2.VAL2 Position              */
#define PWMA_SM0VAL2_VAL2(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM0VAL2.VAL2 Field                 */
/* ------- SM0FRACVAL3 Bit Fields                   ------ */
#define PWMA_SM0FRACVAL3_FRACVAL3_MASK           (0xF800U)                                           /*!< PWMA_SM0FRACVAL3.FRACVAL3 Mask          */
#define PWMA_SM0FRACVAL3_FRACVAL3_SHIFT          (11U)                                               /*!< PWMA_SM0FRACVAL3.FRACVAL3 Position      */
#define PWMA_SM0FRACVAL3_FRACVAL3(x)             (((uint16_t)(((uint16_t)(x))<<11U))&0xF800UL)       /*!< PWMA_SM0FRACVAL3.FRACVAL3 Field         */
/* ------- SM0VAL3 Bit Fields                       ------ */
#define PWMA_SM0VAL3_VAL3_MASK                   (0xFFFFU)                                           /*!< PWMA_SM0VAL3.VAL3 Mask                  */
#define PWMA_SM0VAL3_VAL3_SHIFT                  (0U)                                                /*!< PWMA_SM0VAL3.VAL3 Position              */
#define PWMA_SM0VAL3_VAL3(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM0VAL3.VAL3 Field                 */
/* ------- SM0FRACVAL4 Bit Fields                   ------ */
#define PWMA_SM0FRACVAL4_FRACVAL4_MASK           (0xF800U)                                           /*!< PWMA_SM0FRACVAL4.FRACVAL4 Mask          */
#define PWMA_SM0FRACVAL4_FRACVAL4_SHIFT          (11U)                                               /*!< PWMA_SM0FRACVAL4.FRACVAL4 Position      */
#define PWMA_SM0FRACVAL4_FRACVAL4(x)             (((uint16_t)(((uint16_t)(x))<<11U))&0xF800UL)       /*!< PWMA_SM0FRACVAL4.FRACVAL4 Field         */
/* ------- SM0VAL4 Bit Fields                       ------ */
#define PWMA_SM0VAL4_VAL4_MASK                   (0xFFFFU)                                           /*!< PWMA_SM0VAL4.VAL4 Mask                  */
#define PWMA_SM0VAL4_VAL4_SHIFT                  (0U)                                                /*!< PWMA_SM0VAL4.VAL4 Position              */
#define PWMA_SM0VAL4_VAL4(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM0VAL4.VAL4 Field                 */
/* ------- SM0FRACVAL5 Bit Fields                   ------ */
#define PWMA_SM0FRACVAL5_FRACVAL5_MASK           (0xF800U)                                           /*!< PWMA_SM0FRACVAL5.FRACVAL5 Mask          */
#define PWMA_SM0FRACVAL5_FRACVAL5_SHIFT          (11U)                                               /*!< PWMA_SM0FRACVAL5.FRACVAL5 Position      */
#define PWMA_SM0FRACVAL5_FRACVAL5(x)             (((uint16_t)(((uint16_t)(x))<<11U))&0xF800UL)       /*!< PWMA_SM0FRACVAL5.FRACVAL5 Field         */
/* ------- SM0VAL5 Bit Fields                       ------ */
#define PWMA_SM0VAL5_VAL5_MASK                   (0xFFFFU)                                           /*!< PWMA_SM0VAL5.VAL5 Mask                  */
#define PWMA_SM0VAL5_VAL5_SHIFT                  (0U)                                                /*!< PWMA_SM0VAL5.VAL5 Position              */
#define PWMA_SM0VAL5_VAL5(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM0VAL5.VAL5 Field                 */
/* ------- SM0FRCTRL Bit Fields                     ------ */
#define PWMA_SM0FRCTRL_FRAC1_EN_MASK             (0x2U)                                              /*!< PWMA_SM0FRCTRL.FRAC1_EN Mask            */
#define PWMA_SM0FRCTRL_FRAC1_EN_SHIFT            (1U)                                                /*!< PWMA_SM0FRCTRL.FRAC1_EN Position        */
#define PWMA_SM0FRCTRL_FRAC1_EN(x)               (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< PWMA_SM0FRCTRL.FRAC1_EN Field           */
#define PWMA_SM0FRCTRL_FRAC23_EN_MASK            (0x4U)                                              /*!< PWMA_SM0FRCTRL.FRAC23_EN Mask           */
#define PWMA_SM0FRCTRL_FRAC23_EN_SHIFT           (2U)                                                /*!< PWMA_SM0FRCTRL.FRAC23_EN Position       */
#define PWMA_SM0FRCTRL_FRAC23_EN(x)              (((uint16_t)(((uint16_t)(x))<<2U))&0x4UL)           /*!< PWMA_SM0FRCTRL.FRAC23_EN Field          */
#define PWMA_SM0FRCTRL_FRAC45_EN_MASK            (0x10U)                                             /*!< PWMA_SM0FRCTRL.FRAC45_EN Mask           */
#define PWMA_SM0FRCTRL_FRAC45_EN_SHIFT           (4U)                                                /*!< PWMA_SM0FRCTRL.FRAC45_EN Position       */
#define PWMA_SM0FRCTRL_FRAC45_EN(x)              (((uint16_t)(((uint16_t)(x))<<4U))&0x10UL)          /*!< PWMA_SM0FRCTRL.FRAC45_EN Field          */
#define PWMA_SM0FRCTRL_FRAC_PU_MASK              (0x100U)                                            /*!< PWMA_SM0FRCTRL.FRAC_PU Mask             */
#define PWMA_SM0FRCTRL_FRAC_PU_SHIFT             (8U)                                                /*!< PWMA_SM0FRCTRL.FRAC_PU Position         */
#define PWMA_SM0FRCTRL_FRAC_PU(x)                (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< PWMA_SM0FRCTRL.FRAC_PU Field            */
#define PWMA_SM0FRCTRL_TEST_MASK                 (0x8000U)                                           /*!< PWMA_SM0FRCTRL.TEST Mask                */
#define PWMA_SM0FRCTRL_TEST_SHIFT                (15U)                                               /*!< PWMA_SM0FRCTRL.TEST Position            */
#define PWMA_SM0FRCTRL_TEST(x)                   (((uint16_t)(((uint16_t)(x))<<15U))&0x8000UL)       /*!< PWMA_SM0FRCTRL.TEST Field               */
/* ------- SM0OCTRL Bit Fields                      ------ */
#define PWMA_SM0OCTRL_PWMXFS_MASK                (0x3U)                                              /*!< PWMA_SM0OCTRL.PWMXFS Mask               */
#define PWMA_SM0OCTRL_PWMXFS_SHIFT               (0U)                                                /*!< PWMA_SM0OCTRL.PWMXFS Position           */
#define PWMA_SM0OCTRL_PWMXFS(x)                  (((uint16_t)(((uint16_t)(x))<<0U))&0x3UL)           /*!< PWMA_SM0OCTRL.PWMXFS Field              */
#define PWMA_SM0OCTRL_PWMBFS_MASK                (0xCU)                                              /*!< PWMA_SM0OCTRL.PWMBFS Mask               */
#define PWMA_SM0OCTRL_PWMBFS_SHIFT               (2U)                                                /*!< PWMA_SM0OCTRL.PWMBFS Position           */
#define PWMA_SM0OCTRL_PWMBFS(x)                  (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< PWMA_SM0OCTRL.PWMBFS Field              */
#define PWMA_SM0OCTRL_PWMAFS_MASK                (0x30U)                                             /*!< PWMA_SM0OCTRL.PWMAFS Mask               */
#define PWMA_SM0OCTRL_PWMAFS_SHIFT               (4U)                                                /*!< PWMA_SM0OCTRL.PWMAFS Position           */
#define PWMA_SM0OCTRL_PWMAFS(x)                  (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< PWMA_SM0OCTRL.PWMAFS Field              */
#define PWMA_SM0OCTRL_POLX_MASK                  (0x100U)                                            /*!< PWMA_SM0OCTRL.POLX Mask                 */
#define PWMA_SM0OCTRL_POLX_SHIFT                 (8U)                                                /*!< PWMA_SM0OCTRL.POLX Position             */
#define PWMA_SM0OCTRL_POLX(x)                    (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< PWMA_SM0OCTRL.POLX Field                */
#define PWMA_SM0OCTRL_POLB_MASK                  (0x200U)                                            /*!< PWMA_SM0OCTRL.POLB Mask                 */
#define PWMA_SM0OCTRL_POLB_SHIFT                 (9U)                                                /*!< PWMA_SM0OCTRL.POLB Position             */
#define PWMA_SM0OCTRL_POLB(x)                    (((uint16_t)(((uint16_t)(x))<<9U))&0x200UL)         /*!< PWMA_SM0OCTRL.POLB Field                */
#define PWMA_SM0OCTRL_POLA_MASK                  (0x400U)                                            /*!< PWMA_SM0OCTRL.POLA Mask                 */
#define PWMA_SM0OCTRL_POLA_SHIFT                 (10U)                                               /*!< PWMA_SM0OCTRL.POLA Position             */
#define PWMA_SM0OCTRL_POLA(x)                    (((uint16_t)(((uint16_t)(x))<<10U))&0x400UL)        /*!< PWMA_SM0OCTRL.POLA Field                */
#define PWMA_SM0OCTRL_PWMX_IN_MASK               (0x2000U)                                           /*!< PWMA_SM0OCTRL.PWMX_IN Mask              */
#define PWMA_SM0OCTRL_PWMX_IN_SHIFT              (13U)                                               /*!< PWMA_SM0OCTRL.PWMX_IN Position          */
#define PWMA_SM0OCTRL_PWMX_IN(x)                 (((uint16_t)(((uint16_t)(x))<<13U))&0x2000UL)       /*!< PWMA_SM0OCTRL.PWMX_IN Field             */
#define PWMA_SM0OCTRL_PWMB_IN_MASK               (0x4000U)                                           /*!< PWMA_SM0OCTRL.PWMB_IN Mask              */
#define PWMA_SM0OCTRL_PWMB_IN_SHIFT              (14U)                                               /*!< PWMA_SM0OCTRL.PWMB_IN Position          */
#define PWMA_SM0OCTRL_PWMB_IN(x)                 (((uint16_t)(((uint16_t)(x))<<14U))&0x4000UL)       /*!< PWMA_SM0OCTRL.PWMB_IN Field             */
#define PWMA_SM0OCTRL_PWMA_IN_MASK               (0x8000U)                                           /*!< PWMA_SM0OCTRL.PWMA_IN Mask              */
#define PWMA_SM0OCTRL_PWMA_IN_SHIFT              (15U)                                               /*!< PWMA_SM0OCTRL.PWMA_IN Position          */
#define PWMA_SM0OCTRL_PWMA_IN(x)                 (((uint16_t)(((uint16_t)(x))<<15U))&0x8000UL)       /*!< PWMA_SM0OCTRL.PWMA_IN Field             */
/* ------- SM0STS Bit Fields                        ------ */
#define PWMA_SM0STS_CMPF_MASK                    (0x3FU)                                             /*!< PWMA_SM0STS.CMPF Mask                   */
#define PWMA_SM0STS_CMPF_SHIFT                   (0U)                                                /*!< PWMA_SM0STS.CMPF Position               */
#define PWMA_SM0STS_CMPF(x)                      (((uint16_t)(((uint16_t)(x))<<0U))&0x3FUL)          /*!< PWMA_SM0STS.CMPF Field                  */
#define PWMA_SM0STS_CFX0_MASK                    (0x40U)                                             /*!< PWMA_SM0STS.CFX0 Mask                   */
#define PWMA_SM0STS_CFX0_SHIFT                   (6U)                                                /*!< PWMA_SM0STS.CFX0 Position               */
#define PWMA_SM0STS_CFX0(x)                      (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< PWMA_SM0STS.CFX0 Field                  */
#define PWMA_SM0STS_CFX1_MASK                    (0x80U)                                             /*!< PWMA_SM0STS.CFX1 Mask                   */
#define PWMA_SM0STS_CFX1_SHIFT                   (7U)                                                /*!< PWMA_SM0STS.CFX1 Position               */
#define PWMA_SM0STS_CFX1(x)                      (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< PWMA_SM0STS.CFX1 Field                  */
#define PWMA_SM0STS_CFB0_MASK                    (0x100U)                                            /*!< PWMA_SM0STS.CFB0 Mask                   */
#define PWMA_SM0STS_CFB0_SHIFT                   (8U)                                                /*!< PWMA_SM0STS.CFB0 Position               */
