podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV45F16.h
#define PWMA_SM0STS_CFB0(x)                      (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< PWMA_SM0STS.CFB0 Field                  */
#define PWMA_SM0STS_CFB1_MASK                    (0x200U)                                            /*!< PWMA_SM0STS.CFB1 Mask                   */
#define PWMA_SM0STS_CFB1_SHIFT                   (9U)                                                /*!< PWMA_SM0STS.CFB1 Position               */
#define PWMA_SM0STS_CFB1(x)                      (((uint16_t)(((uint16_t)(x))<<9U))&0x200UL)         /*!< PWMA_SM0STS.CFB1 Field                  */
#define PWMA_SM0STS_CFA0_MASK                    (0x400U)                                            /*!< PWMA_SM0STS.CFA0 Mask                   */
#define PWMA_SM0STS_CFA0_SHIFT                   (10U)                                               /*!< PWMA_SM0STS.CFA0 Position               */
#define PWMA_SM0STS_CFA0(x)                      (((uint16_t)(((uint16_t)(x))<<10U))&0x400UL)        /*!< PWMA_SM0STS.CFA0 Field                  */
#define PWMA_SM0STS_CFA1_MASK                    (0x800U)                                            /*!< PWMA_SM0STS.CFA1 Mask                   */
#define PWMA_SM0STS_CFA1_SHIFT                   (11U)                                               /*!< PWMA_SM0STS.CFA1 Position               */
#define PWMA_SM0STS_CFA1(x)                      (((uint16_t)(((uint16_t)(x))<<11U))&0x800UL)        /*!< PWMA_SM0STS.CFA1 Field                  */
#define PWMA_SM0STS_RF_MASK                      (0x1000U)                                           /*!< PWMA_SM0STS.RF Mask                     */
#define PWMA_SM0STS_RF_SHIFT                     (12U)                                               /*!< PWMA_SM0STS.RF Position                 */
#define PWMA_SM0STS_RF(x)                        (((uint16_t)(((uint16_t)(x))<<12U))&0x1000UL)       /*!< PWMA_SM0STS.RF Field                    */
#define PWMA_SM0STS_REF_MASK                     (0x2000U)                                           /*!< PWMA_SM0STS.REF Mask                    */
#define PWMA_SM0STS_REF_SHIFT                    (13U)                                               /*!< PWMA_SM0STS.REF Position                */
#define PWMA_SM0STS_REF(x)                       (((uint16_t)(((uint16_t)(x))<<13U))&0x2000UL)       /*!< PWMA_SM0STS.REF Field                   */
#define PWMA_SM0STS_RUF_MASK                     (0x4000U)                                           /*!< PWMA_SM0STS.RUF Mask                    */
#define PWMA_SM0STS_RUF_SHIFT                    (14U)                                               /*!< PWMA_SM0STS.RUF Position                */
#define PWMA_SM0STS_RUF(x)                       (((uint16_t)(((uint16_t)(x))<<14U))&0x4000UL)       /*!< PWMA_SM0STS.RUF Field                   */
/* ------- SM0INTEN Bit Fields                      ------ */
#define PWMA_SM0INTEN_CMPIE_MASK                 (0x3FU)                                             /*!< PWMA_SM0INTEN.CMPIE Mask                */
#define PWMA_SM0INTEN_CMPIE_SHIFT                (0U)                                                /*!< PWMA_SM0INTEN.CMPIE Position            */
#define PWMA_SM0INTEN_CMPIE(x)                   (((uint16_t)(((uint16_t)(x))<<0U))&0x3FUL)          /*!< PWMA_SM0INTEN.CMPIE Field               */
#define PWMA_SM0INTEN_CX0IE_MASK                 (0x40U)                                             /*!< PWMA_SM0INTEN.CX0IE Mask                */
#define PWMA_SM0INTEN_CX0IE_SHIFT                (6U)                                                /*!< PWMA_SM0INTEN.CX0IE Position            */
#define PWMA_SM0INTEN_CX0IE(x)                   (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< PWMA_SM0INTEN.CX0IE Field               */
#define PWMA_SM0INTEN_CX1IE_MASK                 (0x80U)                                             /*!< PWMA_SM0INTEN.CX1IE Mask                */
#define PWMA_SM0INTEN_CX1IE_SHIFT                (7U)                                                /*!< PWMA_SM0INTEN.CX1IE Position            */
#define PWMA_SM0INTEN_CX1IE(x)                   (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< PWMA_SM0INTEN.CX1IE Field               */
#define PWMA_SM0INTEN_CB0IE_MASK                 (0x100U)                                            /*!< PWMA_SM0INTEN.CB0IE Mask                */
#define PWMA_SM0INTEN_CB0IE_SHIFT                (8U)                                                /*!< PWMA_SM0INTEN.CB0IE Position            */
#define PWMA_SM0INTEN_CB0IE(x)                   (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< PWMA_SM0INTEN.CB0IE Field               */
#define PWMA_SM0INTEN_CB1IE_MASK                 (0x200U)                                            /*!< PWMA_SM0INTEN.CB1IE Mask                */
#define PWMA_SM0INTEN_CB1IE_SHIFT                (9U)                                                /*!< PWMA_SM0INTEN.CB1IE Position            */
#define PWMA_SM0INTEN_CB1IE(x)                   (((uint16_t)(((uint16_t)(x))<<9U))&0x200UL)         /*!< PWMA_SM0INTEN.CB1IE Field               */
#define PWMA_SM0INTEN_CA0IE_MASK                 (0x400U)                                            /*!< PWMA_SM0INTEN.CA0IE Mask                */
#define PWMA_SM0INTEN_CA0IE_SHIFT                (10U)                                               /*!< PWMA_SM0INTEN.CA0IE Position            */
#define PWMA_SM0INTEN_CA0IE(x)                   (((uint16_t)(((uint16_t)(x))<<10U))&0x400UL)        /*!< PWMA_SM0INTEN.CA0IE Field               */
#define PWMA_SM0INTEN_CA1IE_MASK                 (0x800U)                                            /*!< PWMA_SM0INTEN.CA1IE Mask                */
#define PWMA_SM0INTEN_CA1IE_SHIFT                (11U)                                               /*!< PWMA_SM0INTEN.CA1IE Position            */
#define PWMA_SM0INTEN_CA1IE(x)                   (((uint16_t)(((uint16_t)(x))<<11U))&0x800UL)        /*!< PWMA_SM0INTEN.CA1IE Field               */
#define PWMA_SM0INTEN_RIE_MASK                   (0x1000U)                                           /*!< PWMA_SM0INTEN.RIE Mask                  */
#define PWMA_SM0INTEN_RIE_SHIFT                  (12U)                                               /*!< PWMA_SM0INTEN.RIE Position              */
#define PWMA_SM0INTEN_RIE(x)                     (((uint16_t)(((uint16_t)(x))<<12U))&0x1000UL)       /*!< PWMA_SM0INTEN.RIE Field                 */
#define PWMA_SM0INTEN_REIE_MASK                  (0x2000U)                                           /*!< PWMA_SM0INTEN.REIE Mask                 */
#define PWMA_SM0INTEN_REIE_SHIFT                 (13U)                                               /*!< PWMA_SM0INTEN.REIE Position             */
#define PWMA_SM0INTEN_REIE(x)                    (((uint16_t)(((uint16_t)(x))<<13U))&0x2000UL)       /*!< PWMA_SM0INTEN.REIE Field                */
/* ------- SM0DMAEN Bit Fields                      ------ */
#define PWMA_SM0DMAEN_CX0DE_MASK                 (0x1U)                                              /*!< PWMA_SM0DMAEN.CX0DE Mask                */
#define PWMA_SM0DMAEN_CX0DE_SHIFT                (0U)                                                /*!< PWMA_SM0DMAEN.CX0DE Position            */
#define PWMA_SM0DMAEN_CX0DE(x)                   (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< PWMA_SM0DMAEN.CX0DE Field               */
#define PWMA_SM0DMAEN_CX1DE_MASK                 (0x2U)                                              /*!< PWMA_SM0DMAEN.CX1DE Mask                */
#define PWMA_SM0DMAEN_CX1DE_SHIFT                (1U)                                                /*!< PWMA_SM0DMAEN.CX1DE Position            */
#define PWMA_SM0DMAEN_CX1DE(x)                   (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< PWMA_SM0DMAEN.CX1DE Field               */
#define PWMA_SM0DMAEN_CB0DE_MASK                 (0x4U)                                              /*!< PWMA_SM0DMAEN.CB0DE Mask                */
#define PWMA_SM0DMAEN_CB0DE_SHIFT                (2U)                                                /*!< PWMA_SM0DMAEN.CB0DE Position            */
#define PWMA_SM0DMAEN_CB0DE(x)                   (((uint16_t)(((uint16_t)(x))<<2U))&0x4UL)           /*!< PWMA_SM0DMAEN.CB0DE Field               */
#define PWMA_SM0DMAEN_CB1DE_MASK                 (0x8U)                                              /*!< PWMA_SM0DMAEN.CB1DE Mask                */
#define PWMA_SM0DMAEN_CB1DE_SHIFT                (3U)                                                /*!< PWMA_SM0DMAEN.CB1DE Position            */
#define PWMA_SM0DMAEN_CB1DE(x)                   (((uint16_t)(((uint16_t)(x))<<3U))&0x8UL)           /*!< PWMA_SM0DMAEN.CB1DE Field               */
#define PWMA_SM0DMAEN_CA0DE_MASK                 (0x10U)                                             /*!< PWMA_SM0DMAEN.CA0DE Mask                */
#define PWMA_SM0DMAEN_CA0DE_SHIFT                (4U)                                                /*!< PWMA_SM0DMAEN.CA0DE Position            */
#define PWMA_SM0DMAEN_CA0DE(x)                   (((uint16_t)(((uint16_t)(x))<<4U))&0x10UL)          /*!< PWMA_SM0DMAEN.CA0DE Field               */
#define PWMA_SM0DMAEN_CA1DE_MASK                 (0x20U)                                             /*!< PWMA_SM0DMAEN.CA1DE Mask                */
#define PWMA_SM0DMAEN_CA1DE_SHIFT                (5U)                                                /*!< PWMA_SM0DMAEN.CA1DE Position            */
#define PWMA_SM0DMAEN_CA1DE(x)                   (((uint16_t)(((uint16_t)(x))<<5U))&0x20UL)          /*!< PWMA_SM0DMAEN.CA1DE Field               */
#define PWMA_SM0DMAEN_CAPTDE_MASK                (0xC0U)                                             /*!< PWMA_SM0DMAEN.CAPTDE Mask               */
#define PWMA_SM0DMAEN_CAPTDE_SHIFT               (6U)                                                /*!< PWMA_SM0DMAEN.CAPTDE Position           */
#define PWMA_SM0DMAEN_CAPTDE(x)                  (((uint16_t)(((uint16_t)(x))<<6U))&0xC0UL)          /*!< PWMA_SM0DMAEN.CAPTDE Field              */
#define PWMA_SM0DMAEN_FAND_MASK                  (0x100U)                                            /*!< PWMA_SM0DMAEN.FAND Mask                 */
#define PWMA_SM0DMAEN_FAND_SHIFT                 (8U)                                                /*!< PWMA_SM0DMAEN.FAND Position             */
#define PWMA_SM0DMAEN_FAND(x)                    (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< PWMA_SM0DMAEN.FAND Field                */
#define PWMA_SM0DMAEN_VALDE_MASK                 (0x200U)                                            /*!< PWMA_SM0DMAEN.VALDE Mask                */
#define PWMA_SM0DMAEN_VALDE_SHIFT                (9U)                                                /*!< PWMA_SM0DMAEN.VALDE Position            */
#define PWMA_SM0DMAEN_VALDE(x)                   (((uint16_t)(((uint16_t)(x))<<9U))&0x200UL)         /*!< PWMA_SM0DMAEN.VALDE Field               */
/* ------- SM0TCTRL Bit Fields                      ------ */
#define PWMA_SM0TCTRL_OUT_TRIG_EN_MASK           (0x3FU)                                             /*!< PWMA_SM0TCTRL.OUT_TRIG_EN Mask          */
#define PWMA_SM0TCTRL_OUT_TRIG_EN_SHIFT          (0U)                                                /*!< PWMA_SM0TCTRL.OUT_TRIG_EN Position      */
#define PWMA_SM0TCTRL_OUT_TRIG_EN(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0x3FUL)          /*!< PWMA_SM0TCTRL.OUT_TRIG_EN Field         */
#define PWMA_SM0TCTRL_PWBOT1_MASK                (0x4000U)                                           /*!< PWMA_SM0TCTRL.PWBOT1 Mask               */
#define PWMA_SM0TCTRL_PWBOT1_SHIFT               (14U)                                               /*!< PWMA_SM0TCTRL.PWBOT1 Position           */
#define PWMA_SM0TCTRL_PWBOT1(x)                  (((uint16_t)(((uint16_t)(x))<<14U))&0x4000UL)       /*!< PWMA_SM0TCTRL.PWBOT1 Field              */
#define PWMA_SM0TCTRL_PWAOT0_MASK                (0x8000U)                                           /*!< PWMA_SM0TCTRL.PWAOT0 Mask               */
#define PWMA_SM0TCTRL_PWAOT0_SHIFT               (15U)                                               /*!< PWMA_SM0TCTRL.PWAOT0 Position           */
#define PWMA_SM0TCTRL_PWAOT0(x)                  (((uint16_t)(((uint16_t)(x))<<15U))&0x8000UL)       /*!< PWMA_SM0TCTRL.PWAOT0 Field              */
/* ------- SM0DISMAP0 Bit Fields                    ------ */
#define PWMA_SM0DISMAP0_DIS0A_MASK               (0xFU)                                              /*!< PWMA_SM0DISMAP0.DIS0A Mask              */
#define PWMA_SM0DISMAP0_DIS0A_SHIFT              (0U)                                                /*!< PWMA_SM0DISMAP0.DIS0A Position          */
#define PWMA_SM0DISMAP0_DIS0A(x)                 (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM0DISMAP0.DIS0A Field             */
#define PWMA_SM0DISMAP0_DIS0B_MASK               (0xF0U)                                             /*!< PWMA_SM0DISMAP0.DIS0B Mask              */
#define PWMA_SM0DISMAP0_DIS0B_SHIFT              (4U)                                                /*!< PWMA_SM0DISMAP0.DIS0B Position          */
#define PWMA_SM0DISMAP0_DIS0B(x)                 (((uint16_t)(((uint16_t)(x))<<4U))&0xF0UL)          /*!< PWMA_SM0DISMAP0.DIS0B Field             */
#define PWMA_SM0DISMAP0_DIS0X_MASK               (0xF00U)                                            /*!< PWMA_SM0DISMAP0.DIS0X Mask              */
#define PWMA_SM0DISMAP0_DIS0X_SHIFT              (8U)                                                /*!< PWMA_SM0DISMAP0.DIS0X Position          */
#define PWMA_SM0DISMAP0_DIS0X(x)                 (((uint16_t)(((uint16_t)(x))<<8U))&0xF00UL)         /*!< PWMA_SM0DISMAP0.DIS0X Field             */
/* ------- SM0DTCNT Bit Fields                      ------ */
#define PWMA_SM0DTCNT_DTCNT0_MASK                (0x7FFU)                                            /*!< PWMA_SM0DTCNT.DTCNT0 Mask               */
#define PWMA_SM0DTCNT_DTCNT0_SHIFT               (0U)                                                /*!< PWMA_SM0DTCNT.DTCNT0 Position           */
#define PWMA_SM0DTCNT_DTCNT0(x)                  (((uint16_t)(((uint16_t)(x))<<0U))&0x7FFUL)         /*!< PWMA_SM0DTCNT.DTCNT0 Field              */
/* ------- SM0CAPTCTRLA Bit Fields                  ------ */
#define PWMA_SM0CAPTCTRLA_ARMA_MASK              (0x1U)                                              /*!< PWMA_SM0CAPTCTRLA.ARMA Mask             */
#define PWMA_SM0CAPTCTRLA_ARMA_SHIFT             (0U)                                                /*!< PWMA_SM0CAPTCTRLA.ARMA Position         */
#define PWMA_SM0CAPTCTRLA_ARMA(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< PWMA_SM0CAPTCTRLA.ARMA Field            */
#define PWMA_SM0CAPTCTRLA_ONESHOTA_MASK          (0x2U)                                              /*!< PWMA_SM0CAPTCTRLA.ONESHOTA Mask         */
#define PWMA_SM0CAPTCTRLA_ONESHOTA_SHIFT         (1U)                                                /*!< PWMA_SM0CAPTCTRLA.ONESHOTA Position     */
#define PWMA_SM0CAPTCTRLA_ONESHOTA(x)            (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< PWMA_SM0CAPTCTRLA.ONESHOTA Field        */
#define PWMA_SM0CAPTCTRLA_EDGA0_MASK             (0xCU)                                              /*!< PWMA_SM0CAPTCTRLA.EDGA0 Mask            */
#define PWMA_SM0CAPTCTRLA_EDGA0_SHIFT            (2U)                                                /*!< PWMA_SM0CAPTCTRLA.EDGA0 Position        */
#define PWMA_SM0CAPTCTRLA_EDGA0(x)               (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< PWMA_SM0CAPTCTRLA.EDGA0 Field           */
#define PWMA_SM0CAPTCTRLA_EDGA1_MASK             (0x30U)                                             /*!< PWMA_SM0CAPTCTRLA.EDGA1 Mask            */
#define PWMA_SM0CAPTCTRLA_EDGA1_SHIFT            (4U)                                                /*!< PWMA_SM0CAPTCTRLA.EDGA1 Position        */
#define PWMA_SM0CAPTCTRLA_EDGA1(x)               (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< PWMA_SM0CAPTCTRLA.EDGA1 Field           */
#define PWMA_SM0CAPTCTRLA_INP_SELA_MASK          (0x40U)                                             /*!< PWMA_SM0CAPTCTRLA.INP_SELA Mask         */
#define PWMA_SM0CAPTCTRLA_INP_SELA_SHIFT         (6U)                                                /*!< PWMA_SM0CAPTCTRLA.INP_SELA Position     */
#define PWMA_SM0CAPTCTRLA_INP_SELA(x)            (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< PWMA_SM0CAPTCTRLA.INP_SELA Field        */
#define PWMA_SM0CAPTCTRLA_EDGCNTA_EN_MASK        (0x80U)                                             /*!< PWMA_SM0CAPTCTRLA.EDGCNTA_EN Mask       */
#define PWMA_SM0CAPTCTRLA_EDGCNTA_EN_SHIFT       (7U)                                                /*!< PWMA_SM0CAPTCTRLA.EDGCNTA_EN Position   */
#define PWMA_SM0CAPTCTRLA_EDGCNTA_EN(x)          (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< PWMA_SM0CAPTCTRLA.EDGCNTA_EN Field      */
#define PWMA_SM0CAPTCTRLA_CFAWM_MASK             (0x300U)                                            /*!< PWMA_SM0CAPTCTRLA.CFAWM Mask            */
#define PWMA_SM0CAPTCTRLA_CFAWM_SHIFT            (8U)                                                /*!< PWMA_SM0CAPTCTRLA.CFAWM Position        */
#define PWMA_SM0CAPTCTRLA_CFAWM(x)               (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< PWMA_SM0CAPTCTRLA.CFAWM Field           */
#define PWMA_SM0CAPTCTRLA_CA0CNT_MASK            (0x1C00U)                                           /*!< PWMA_SM0CAPTCTRLA.CA0CNT Mask           */
#define PWMA_SM0CAPTCTRLA_CA0CNT_SHIFT           (10U)                                               /*!< PWMA_SM0CAPTCTRLA.CA0CNT Position       */
#define PWMA_SM0CAPTCTRLA_CA0CNT(x)              (((uint16_t)(((uint16_t)(x))<<10U))&0x1C00UL)       /*!< PWMA_SM0CAPTCTRLA.CA0CNT Field          */
#define PWMA_SM0CAPTCTRLA_CA1CNT_MASK            (0xE000U)                                           /*!< PWMA_SM0CAPTCTRLA.CA1CNT Mask           */
#define PWMA_SM0CAPTCTRLA_CA1CNT_SHIFT           (13U)                                               /*!< PWMA_SM0CAPTCTRLA.CA1CNT Position       */
#define PWMA_SM0CAPTCTRLA_CA1CNT(x)              (((uint16_t)(((uint16_t)(x))<<13U))&0xE000UL)       /*!< PWMA_SM0CAPTCTRLA.CA1CNT Field          */
/* ------- SM0CAPTCOMPA Bit Fields                  ------ */
#define PWMA_SM0CAPTCOMPA_EDGCMPA_MASK           (0xFFU)                                             /*!< PWMA_SM0CAPTCOMPA.EDGCMPA Mask          */
#define PWMA_SM0CAPTCOMPA_EDGCMPA_SHIFT          (0U)                                                /*!< PWMA_SM0CAPTCOMPA.EDGCMPA Position      */
#define PWMA_SM0CAPTCOMPA_EDGCMPA(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFFUL)          /*!< PWMA_SM0CAPTCOMPA.EDGCMPA Field         */
#define PWMA_SM0CAPTCOMPA_EDGCNTA_MASK           (0xFF00U)                                           /*!< PWMA_SM0CAPTCOMPA.EDGCNTA Mask          */
#define PWMA_SM0CAPTCOMPA_EDGCNTA_SHIFT          (8U)                                                /*!< PWMA_SM0CAPTCOMPA.EDGCNTA Position      */
#define PWMA_SM0CAPTCOMPA_EDGCNTA(x)             (((uint16_t)(((uint16_t)(x))<<8U))&0xFF00UL)        /*!< PWMA_SM0CAPTCOMPA.EDGCNTA Field         */
/* ------- SM0CAPTCTRLB Bit Fields                  ------ */
#define PWMA_SM0CAPTCTRLB_ARMB_MASK              (0x1U)                                              /*!< PWMA_SM0CAPTCTRLB.ARMB Mask             */
#define PWMA_SM0CAPTCTRLB_ARMB_SHIFT             (0U)                                                /*!< PWMA_SM0CAPTCTRLB.ARMB Position         */
#define PWMA_SM0CAPTCTRLB_ARMB(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< PWMA_SM0CAPTCTRLB.ARMB Field            */
#define PWMA_SM0CAPTCTRLB_ONESHOTB_MASK          (0x2U)                                              /*!< PWMA_SM0CAPTCTRLB.ONESHOTB Mask         */
#define PWMA_SM0CAPTCTRLB_ONESHOTB_SHIFT         (1U)                                                /*!< PWMA_SM0CAPTCTRLB.ONESHOTB Position     */
#define PWMA_SM0CAPTCTRLB_ONESHOTB(x)            (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< PWMA_SM0CAPTCTRLB.ONESHOTB Field        */
#define PWMA_SM0CAPTCTRLB_EDGB0_MASK             (0xCU)                                              /*!< PWMA_SM0CAPTCTRLB.EDGB0 Mask            */
#define PWMA_SM0CAPTCTRLB_EDGB0_SHIFT            (2U)                                                /*!< PWMA_SM0CAPTCTRLB.EDGB0 Position        */
#define PWMA_SM0CAPTCTRLB_EDGB0(x)               (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< PWMA_SM0CAPTCTRLB.EDGB0 Field           */
#define PWMA_SM0CAPTCTRLB_EDGB1_MASK             (0x30U)                                             /*!< PWMA_SM0CAPTCTRLB.EDGB1 Mask            */
#define PWMA_SM0CAPTCTRLB_EDGB1_SHIFT            (4U)                                                /*!< PWMA_SM0CAPTCTRLB.EDGB1 Position        */
#define PWMA_SM0CAPTCTRLB_EDGB1(x)               (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< PWMA_SM0CAPTCTRLB.EDGB1 Field           */
#define PWMA_SM0CAPTCTRLB_INP_SELB_MASK          (0x40U)                                             /*!< PWMA_SM0CAPTCTRLB.INP_SELB Mask         */
#define PWMA_SM0CAPTCTRLB_INP_SELB_SHIFT         (6U)                                                /*!< PWMA_SM0CAPTCTRLB.INP_SELB Position     */
#define PWMA_SM0CAPTCTRLB_INP_SELB(x)            (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< PWMA_SM0CAPTCTRLB.INP_SELB Field        */
#define PWMA_SM0CAPTCTRLB_EDGCNTB_EN_MASK        (0x80U)                                             /*!< PWMA_SM0CAPTCTRLB.EDGCNTB_EN Mask       */
#define PWMA_SM0CAPTCTRLB_EDGCNTB_EN_SHIFT       (7U)                                                /*!< PWMA_SM0CAPTCTRLB.EDGCNTB_EN Position   */
#define PWMA_SM0CAPTCTRLB_EDGCNTB_EN(x)          (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< PWMA_SM0CAPTCTRLB.EDGCNTB_EN Field      */
#define PWMA_SM0CAPTCTRLB_CFBWM_MASK             (0x300U)                                            /*!< PWMA_SM0CAPTCTRLB.CFBWM Mask            */
#define PWMA_SM0CAPTCTRLB_CFBWM_SHIFT            (8U)                                                /*!< PWMA_SM0CAPTCTRLB.CFBWM Position        */
#define PWMA_SM0CAPTCTRLB_CFBWM(x)               (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< PWMA_SM0CAPTCTRLB.CFBWM Field           */
#define PWMA_SM0CAPTCTRLB_CB0CNT_MASK            (0x1C00U)                                           /*!< PWMA_SM0CAPTCTRLB.CB0CNT Mask           */
#define PWMA_SM0CAPTCTRLB_CB0CNT_SHIFT           (10U)                                               /*!< PWMA_SM0CAPTCTRLB.CB0CNT Position       */
#define PWMA_SM0CAPTCTRLB_CB0CNT(x)              (((uint16_t)(((uint16_t)(x))<<10U))&0x1C00UL)       /*!< PWMA_SM0CAPTCTRLB.CB0CNT Field          */
#define PWMA_SM0CAPTCTRLB_CB1CNT_MASK            (0xE000U)                                           /*!< PWMA_SM0CAPTCTRLB.CB1CNT Mask           */
#define PWMA_SM0CAPTCTRLB_CB1CNT_SHIFT           (13U)                                               /*!< PWMA_SM0CAPTCTRLB.CB1CNT Position       */
#define PWMA_SM0CAPTCTRLB_CB1CNT(x)              (((uint16_t)(((uint16_t)(x))<<13U))&0xE000UL)       /*!< PWMA_SM0CAPTCTRLB.CB1CNT Field          */
/* ------- SM0CAPTCOMPB Bit Fields                  ------ */
#define PWMA_SM0CAPTCOMPB_EDGCMPB_MASK           (0xFFU)                                             /*!< PWMA_SM0CAPTCOMPB.EDGCMPB Mask          */
#define PWMA_SM0CAPTCOMPB_EDGCMPB_SHIFT          (0U)                                                /*!< PWMA_SM0CAPTCOMPB.EDGCMPB Position      */
#define PWMA_SM0CAPTCOMPB_EDGCMPB(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFFUL)          /*!< PWMA_SM0CAPTCOMPB.EDGCMPB Field         */
