podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV45F16.h
#define PWMA_SM1VAL2_VAL2_SHIFT                  (0U)                                                /*!< PWMA_SM1VAL2.VAL2 Position              */
#define PWMA_SM1VAL2_VAL2(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM1VAL2.VAL2 Field                 */
/* ------- SM1FRACVAL3 Bit Fields                   ------ */
#define PWMA_SM1FRACVAL3_FRACVAL3_MASK           (0xF800U)                                           /*!< PWMA_SM1FRACVAL3.FRACVAL3 Mask          */
#define PWMA_SM1FRACVAL3_FRACVAL3_SHIFT          (11U)                                               /*!< PWMA_SM1FRACVAL3.FRACVAL3 Position      */
#define PWMA_SM1FRACVAL3_FRACVAL3(x)             (((uint16_t)(((uint16_t)(x))<<11U))&0xF800UL)       /*!< PWMA_SM1FRACVAL3.FRACVAL3 Field         */
/* ------- SM1VAL3 Bit Fields                       ------ */
#define PWMA_SM1VAL3_VAL3_MASK                   (0xFFFFU)                                           /*!< PWMA_SM1VAL3.VAL3 Mask                  */
#define PWMA_SM1VAL3_VAL3_SHIFT                  (0U)                                                /*!< PWMA_SM1VAL3.VAL3 Position              */
#define PWMA_SM1VAL3_VAL3(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM1VAL3.VAL3 Field                 */
/* ------- SM1FRACVAL4 Bit Fields                   ------ */
#define PWMA_SM1FRACVAL4_FRACVAL4_MASK           (0xF800U)                                           /*!< PWMA_SM1FRACVAL4.FRACVAL4 Mask          */
#define PWMA_SM1FRACVAL4_FRACVAL4_SHIFT          (11U)                                               /*!< PWMA_SM1FRACVAL4.FRACVAL4 Position      */
#define PWMA_SM1FRACVAL4_FRACVAL4(x)             (((uint16_t)(((uint16_t)(x))<<11U))&0xF800UL)       /*!< PWMA_SM1FRACVAL4.FRACVAL4 Field         */
/* ------- SM1VAL4 Bit Fields                       ------ */
#define PWMA_SM1VAL4_VAL4_MASK                   (0xFFFFU)                                           /*!< PWMA_SM1VAL4.VAL4 Mask                  */
#define PWMA_SM1VAL4_VAL4_SHIFT                  (0U)                                                /*!< PWMA_SM1VAL4.VAL4 Position              */
#define PWMA_SM1VAL4_VAL4(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM1VAL4.VAL4 Field                 */
/* ------- SM1FRACVAL5 Bit Fields                   ------ */
#define PWMA_SM1FRACVAL5_FRACVAL5_MASK           (0xF800U)                                           /*!< PWMA_SM1FRACVAL5.FRACVAL5 Mask          */
#define PWMA_SM1FRACVAL5_FRACVAL5_SHIFT          (11U)                                               /*!< PWMA_SM1FRACVAL5.FRACVAL5 Position      */
#define PWMA_SM1FRACVAL5_FRACVAL5(x)             (((uint16_t)(((uint16_t)(x))<<11U))&0xF800UL)       /*!< PWMA_SM1FRACVAL5.FRACVAL5 Field         */
/* ------- SM1VAL5 Bit Fields                       ------ */
#define PWMA_SM1VAL5_VAL5_MASK                   (0xFFFFU)                                           /*!< PWMA_SM1VAL5.VAL5 Mask                  */
#define PWMA_SM1VAL5_VAL5_SHIFT                  (0U)                                                /*!< PWMA_SM1VAL5.VAL5 Position              */
#define PWMA_SM1VAL5_VAL5(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM1VAL5.VAL5 Field                 */
/* ------- SM1FRCTRL Bit Fields                     ------ */
#define PWMA_SM1FRCTRL_FRAC1_EN_MASK             (0x2U)                                              /*!< PWMA_SM1FRCTRL.FRAC1_EN Mask            */
#define PWMA_SM1FRCTRL_FRAC1_EN_SHIFT            (1U)                                                /*!< PWMA_SM1FRCTRL.FRAC1_EN Position        */
#define PWMA_SM1FRCTRL_FRAC1_EN(x)               (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< PWMA_SM1FRCTRL.FRAC1_EN Field           */
#define PWMA_SM1FRCTRL_FRAC23_EN_MASK            (0x4U)                                              /*!< PWMA_SM1FRCTRL.FRAC23_EN Mask           */
#define PWMA_SM1FRCTRL_FRAC23_EN_SHIFT           (2U)                                                /*!< PWMA_SM1FRCTRL.FRAC23_EN Position       */
#define PWMA_SM1FRCTRL_FRAC23_EN(x)              (((uint16_t)(((uint16_t)(x))<<2U))&0x4UL)           /*!< PWMA_SM1FRCTRL.FRAC23_EN Field          */
#define PWMA_SM1FRCTRL_FRAC45_EN_MASK            (0x10U)                                             /*!< PWMA_SM1FRCTRL.FRAC45_EN Mask           */
#define PWMA_SM1FRCTRL_FRAC45_EN_SHIFT           (4U)                                                /*!< PWMA_SM1FRCTRL.FRAC45_EN Position       */
#define PWMA_SM1FRCTRL_FRAC45_EN(x)              (((uint16_t)(((uint16_t)(x))<<4U))&0x10UL)          /*!< PWMA_SM1FRCTRL.FRAC45_EN Field          */
#define PWMA_SM1FRCTRL_FRAC_PU_MASK              (0x100U)                                            /*!< PWMA_SM1FRCTRL.FRAC_PU Mask             */
#define PWMA_SM1FRCTRL_FRAC_PU_SHIFT             (8U)                                                /*!< PWMA_SM1FRCTRL.FRAC_PU Position         */
#define PWMA_SM1FRCTRL_FRAC_PU(x)                (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< PWMA_SM1FRCTRL.FRAC_PU Field            */
#define PWMA_SM1FRCTRL_TEST_MASK                 (0x8000U)                                           /*!< PWMA_SM1FRCTRL.TEST Mask                */
#define PWMA_SM1FRCTRL_TEST_SHIFT                (15U)                                               /*!< PWMA_SM1FRCTRL.TEST Position            */
#define PWMA_SM1FRCTRL_TEST(x)                   (((uint16_t)(((uint16_t)(x))<<15U))&0x8000UL)       /*!< PWMA_SM1FRCTRL.TEST Field               */
/* ------- SM1OCTRL Bit Fields                      ------ */
#define PWMA_SM1OCTRL_PWMXFS_MASK                (0x3U)                                              /*!< PWMA_SM1OCTRL.PWMXFS Mask               */
#define PWMA_SM1OCTRL_PWMXFS_SHIFT               (0U)                                                /*!< PWMA_SM1OCTRL.PWMXFS Position           */
#define PWMA_SM1OCTRL_PWMXFS(x)                  (((uint16_t)(((uint16_t)(x))<<0U))&0x3UL)           /*!< PWMA_SM1OCTRL.PWMXFS Field              */
#define PWMA_SM1OCTRL_PWMBFS_MASK                (0xCU)                                              /*!< PWMA_SM1OCTRL.PWMBFS Mask               */
#define PWMA_SM1OCTRL_PWMBFS_SHIFT               (2U)                                                /*!< PWMA_SM1OCTRL.PWMBFS Position           */
#define PWMA_SM1OCTRL_PWMBFS(x)                  (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< PWMA_SM1OCTRL.PWMBFS Field              */
#define PWMA_SM1OCTRL_PWMAFS_MASK                (0x30U)                                             /*!< PWMA_SM1OCTRL.PWMAFS Mask               */
#define PWMA_SM1OCTRL_PWMAFS_SHIFT               (4U)                                                /*!< PWMA_SM1OCTRL.PWMAFS Position           */
#define PWMA_SM1OCTRL_PWMAFS(x)                  (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< PWMA_SM1OCTRL.PWMAFS Field              */
#define PWMA_SM1OCTRL_POLX_MASK                  (0x100U)                                            /*!< PWMA_SM1OCTRL.POLX Mask                 */
#define PWMA_SM1OCTRL_POLX_SHIFT                 (8U)                                                /*!< PWMA_SM1OCTRL.POLX Position             */
#define PWMA_SM1OCTRL_POLX(x)                    (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< PWMA_SM1OCTRL.POLX Field                */
#define PWMA_SM1OCTRL_POLB_MASK                  (0x200U)                                            /*!< PWMA_SM1OCTRL.POLB Mask                 */
#define PWMA_SM1OCTRL_POLB_SHIFT                 (9U)                                                /*!< PWMA_SM1OCTRL.POLB Position             */
#define PWMA_SM1OCTRL_POLB(x)                    (((uint16_t)(((uint16_t)(x))<<9U))&0x200UL)         /*!< PWMA_SM1OCTRL.POLB Field                */
#define PWMA_SM1OCTRL_POLA_MASK                  (0x400U)                                            /*!< PWMA_SM1OCTRL.POLA Mask                 */
#define PWMA_SM1OCTRL_POLA_SHIFT                 (10U)                                               /*!< PWMA_SM1OCTRL.POLA Position             */
#define PWMA_SM1OCTRL_POLA(x)                    (((uint16_t)(((uint16_t)(x))<<10U))&0x400UL)        /*!< PWMA_SM1OCTRL.POLA Field                */
#define PWMA_SM1OCTRL_PWMX_IN_MASK               (0x2000U)                                           /*!< PWMA_SM1OCTRL.PWMX_IN Mask              */
#define PWMA_SM1OCTRL_PWMX_IN_SHIFT              (13U)                                               /*!< PWMA_SM1OCTRL.PWMX_IN Position          */
#define PWMA_SM1OCTRL_PWMX_IN(x)                 (((uint16_t)(((uint16_t)(x))<<13U))&0x2000UL)       /*!< PWMA_SM1OCTRL.PWMX_IN Field             */
#define PWMA_SM1OCTRL_PWMB_IN_MASK               (0x4000U)                                           /*!< PWMA_SM1OCTRL.PWMB_IN Mask              */
#define PWMA_SM1OCTRL_PWMB_IN_SHIFT              (14U)                                               /*!< PWMA_SM1OCTRL.PWMB_IN Position          */
#define PWMA_SM1OCTRL_PWMB_IN(x)                 (((uint16_t)(((uint16_t)(x))<<14U))&0x4000UL)       /*!< PWMA_SM1OCTRL.PWMB_IN Field             */
#define PWMA_SM1OCTRL_PWMA_IN_MASK               (0x8000U)                                           /*!< PWMA_SM1OCTRL.PWMA_IN Mask              */
#define PWMA_SM1OCTRL_PWMA_IN_SHIFT              (15U)                                               /*!< PWMA_SM1OCTRL.PWMA_IN Position          */
#define PWMA_SM1OCTRL_PWMA_IN(x)                 (((uint16_t)(((uint16_t)(x))<<15U))&0x8000UL)       /*!< PWMA_SM1OCTRL.PWMA_IN Field             */
/* ------- SM1STS Bit Fields                        ------ */
#define PWMA_SM1STS_CMPF_MASK                    (0x3FU)                                             /*!< PWMA_SM1STS.CMPF Mask                   */
#define PWMA_SM1STS_CMPF_SHIFT                   (0U)                                                /*!< PWMA_SM1STS.CMPF Position               */
#define PWMA_SM1STS_CMPF(x)                      (((uint16_t)(((uint16_t)(x))<<0U))&0x3FUL)          /*!< PWMA_SM1STS.CMPF Field                  */
#define PWMA_SM1STS_CFX0_MASK                    (0x40U)                                             /*!< PWMA_SM1STS.CFX0 Mask                   */
#define PWMA_SM1STS_CFX0_SHIFT                   (6U)                                                /*!< PWMA_SM1STS.CFX0 Position               */
#define PWMA_SM1STS_CFX0(x)                      (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< PWMA_SM1STS.CFX0 Field                  */
#define PWMA_SM1STS_CFX1_MASK                    (0x80U)                                             /*!< PWMA_SM1STS.CFX1 Mask                   */
#define PWMA_SM1STS_CFX1_SHIFT                   (7U)                                                /*!< PWMA_SM1STS.CFX1 Position               */
#define PWMA_SM1STS_CFX1(x)                      (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< PWMA_SM1STS.CFX1 Field                  */
#define PWMA_SM1STS_CFB0_MASK                    (0x100U)                                            /*!< PWMA_SM1STS.CFB0 Mask                   */
#define PWMA_SM1STS_CFB0_SHIFT                   (8U)                                                /*!< PWMA_SM1STS.CFB0 Position               */
#define PWMA_SM1STS_CFB0(x)                      (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< PWMA_SM1STS.CFB0 Field                  */
#define PWMA_SM1STS_CFB1_MASK                    (0x200U)                                            /*!< PWMA_SM1STS.CFB1 Mask                   */
#define PWMA_SM1STS_CFB1_SHIFT                   (9U)                                                /*!< PWMA_SM1STS.CFB1 Position               */
#define PWMA_SM1STS_CFB1(x)                      (((uint16_t)(((uint16_t)(x))<<9U))&0x200UL)         /*!< PWMA_SM1STS.CFB1 Field                  */
#define PWMA_SM1STS_CFA0_MASK                    (0x400U)                                            /*!< PWMA_SM1STS.CFA0 Mask                   */
#define PWMA_SM1STS_CFA0_SHIFT                   (10U)                                               /*!< PWMA_SM1STS.CFA0 Position               */
#define PWMA_SM1STS_CFA0(x)                      (((uint16_t)(((uint16_t)(x))<<10U))&0x400UL)        /*!< PWMA_SM1STS.CFA0 Field                  */
#define PWMA_SM1STS_CFA1_MASK                    (0x800U)                                            /*!< PWMA_SM1STS.CFA1 Mask                   */
#define PWMA_SM1STS_CFA1_SHIFT                   (11U)                                               /*!< PWMA_SM1STS.CFA1 Position               */
#define PWMA_SM1STS_CFA1(x)                      (((uint16_t)(((uint16_t)(x))<<11U))&0x800UL)        /*!< PWMA_SM1STS.CFA1 Field                  */
#define PWMA_SM1STS_RF_MASK                      (0x1000U)                                           /*!< PWMA_SM1STS.RF Mask                     */
#define PWMA_SM1STS_RF_SHIFT                     (12U)                                               /*!< PWMA_SM1STS.RF Position                 */
#define PWMA_SM1STS_RF(x)                        (((uint16_t)(((uint16_t)(x))<<12U))&0x1000UL)       /*!< PWMA_SM1STS.RF Field                    */
#define PWMA_SM1STS_REF_MASK                     (0x2000U)                                           /*!< PWMA_SM1STS.REF Mask                    */
#define PWMA_SM1STS_REF_SHIFT                    (13U)                                               /*!< PWMA_SM1STS.REF Position                */
#define PWMA_SM1STS_REF(x)                       (((uint16_t)(((uint16_t)(x))<<13U))&0x2000UL)       /*!< PWMA_SM1STS.REF Field                   */
#define PWMA_SM1STS_RUF_MASK                     (0x4000U)                                           /*!< PWMA_SM1STS.RUF Mask                    */
#define PWMA_SM1STS_RUF_SHIFT                    (14U)                                               /*!< PWMA_SM1STS.RUF Position                */
#define PWMA_SM1STS_RUF(x)                       (((uint16_t)(((uint16_t)(x))<<14U))&0x4000UL)       /*!< PWMA_SM1STS.RUF Field                   */
/* ------- SM1INTEN Bit Fields                      ------ */
#define PWMA_SM1INTEN_CMPIE_MASK                 (0x3FU)                                             /*!< PWMA_SM1INTEN.CMPIE Mask                */
#define PWMA_SM1INTEN_CMPIE_SHIFT                (0U)                                                /*!< PWMA_SM1INTEN.CMPIE Position            */
#define PWMA_SM1INTEN_CMPIE(x)                   (((uint16_t)(((uint16_t)(x))<<0U))&0x3FUL)          /*!< PWMA_SM1INTEN.CMPIE Field               */
#define PWMA_SM1INTEN_CX0IE_MASK                 (0x40U)                                             /*!< PWMA_SM1INTEN.CX0IE Mask                */
#define PWMA_SM1INTEN_CX0IE_SHIFT                (6U)                                                /*!< PWMA_SM1INTEN.CX0IE Position            */
#define PWMA_SM1INTEN_CX0IE(x)                   (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< PWMA_SM1INTEN.CX0IE Field               */
#define PWMA_SM1INTEN_CX1IE_MASK                 (0x80U)                                             /*!< PWMA_SM1INTEN.CX1IE Mask                */
#define PWMA_SM1INTEN_CX1IE_SHIFT                (7U)                                                /*!< PWMA_SM1INTEN.CX1IE Position            */
#define PWMA_SM1INTEN_CX1IE(x)                   (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< PWMA_SM1INTEN.CX1IE Field               */
#define PWMA_SM1INTEN_CB0IE_MASK                 (0x100U)                                            /*!< PWMA_SM1INTEN.CB0IE Mask                */
#define PWMA_SM1INTEN_CB0IE_SHIFT                (8U)                                                /*!< PWMA_SM1INTEN.CB0IE Position            */
#define PWMA_SM1INTEN_CB0IE(x)                   (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< PWMA_SM1INTEN.CB0IE Field               */
#define PWMA_SM1INTEN_CB1IE_MASK                 (0x200U)                                            /*!< PWMA_SM1INTEN.CB1IE Mask                */
#define PWMA_SM1INTEN_CB1IE_SHIFT                (9U)                                                /*!< PWMA_SM1INTEN.CB1IE Position            */
#define PWMA_SM1INTEN_CB1IE(x)                   (((uint16_t)(((uint16_t)(x))<<9U))&0x200UL)         /*!< PWMA_SM1INTEN.CB1IE Field               */
#define PWMA_SM1INTEN_CA0IE_MASK                 (0x400U)                                            /*!< PWMA_SM1INTEN.CA0IE Mask                */
#define PWMA_SM1INTEN_CA0IE_SHIFT                (10U)                                               /*!< PWMA_SM1INTEN.CA0IE Position            */
#define PWMA_SM1INTEN_CA0IE(x)                   (((uint16_t)(((uint16_t)(x))<<10U))&0x400UL)        /*!< PWMA_SM1INTEN.CA0IE Field               */
#define PWMA_SM1INTEN_CA1IE_MASK                 (0x800U)                                            /*!< PWMA_SM1INTEN.CA1IE Mask                */
#define PWMA_SM1INTEN_CA1IE_SHIFT                (11U)                                               /*!< PWMA_SM1INTEN.CA1IE Position            */
#define PWMA_SM1INTEN_CA1IE(x)                   (((uint16_t)(((uint16_t)(x))<<11U))&0x800UL)        /*!< PWMA_SM1INTEN.CA1IE Field               */
#define PWMA_SM1INTEN_RIE_MASK                   (0x1000U)                                           /*!< PWMA_SM1INTEN.RIE Mask                  */
#define PWMA_SM1INTEN_RIE_SHIFT                  (12U)                                               /*!< PWMA_SM1INTEN.RIE Position              */
#define PWMA_SM1INTEN_RIE(x)                     (((uint16_t)(((uint16_t)(x))<<12U))&0x1000UL)       /*!< PWMA_SM1INTEN.RIE Field                 */
#define PWMA_SM1INTEN_REIE_MASK                  (0x2000U)                                           /*!< PWMA_SM1INTEN.REIE Mask                 */
#define PWMA_SM1INTEN_REIE_SHIFT                 (13U)                                               /*!< PWMA_SM1INTEN.REIE Position             */
#define PWMA_SM1INTEN_REIE(x)                    (((uint16_t)(((uint16_t)(x))<<13U))&0x2000UL)       /*!< PWMA_SM1INTEN.REIE Field                */
/* ------- SM1DMAEN Bit Fields                      ------ */
#define PWMA_SM1DMAEN_CX0DE_MASK                 (0x1U)                                              /*!< PWMA_SM1DMAEN.CX0DE Mask                */
#define PWMA_SM1DMAEN_CX0DE_SHIFT                (0U)                                                /*!< PWMA_SM1DMAEN.CX0DE Position            */
#define PWMA_SM1DMAEN_CX0DE(x)                   (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< PWMA_SM1DMAEN.CX0DE Field               */
#define PWMA_SM1DMAEN_CX1DE_MASK                 (0x2U)                                              /*!< PWMA_SM1DMAEN.CX1DE Mask                */
#define PWMA_SM1DMAEN_CX1DE_SHIFT                (1U)                                                /*!< PWMA_SM1DMAEN.CX1DE Position            */
#define PWMA_SM1DMAEN_CX1DE(x)                   (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< PWMA_SM1DMAEN.CX1DE Field               */
#define PWMA_SM1DMAEN_CB0DE_MASK                 (0x4U)                                              /*!< PWMA_SM1DMAEN.CB0DE Mask                */
#define PWMA_SM1DMAEN_CB0DE_SHIFT                (2U)                                                /*!< PWMA_SM1DMAEN.CB0DE Position            */
#define PWMA_SM1DMAEN_CB0DE(x)                   (((uint16_t)(((uint16_t)(x))<<2U))&0x4UL)           /*!< PWMA_SM1DMAEN.CB0DE Field               */
#define PWMA_SM1DMAEN_CB1DE_MASK                 (0x8U)                                              /*!< PWMA_SM1DMAEN.CB1DE Mask                */
#define PWMA_SM1DMAEN_CB1DE_SHIFT                (3U)                                                /*!< PWMA_SM1DMAEN.CB1DE Position            */
#define PWMA_SM1DMAEN_CB1DE(x)                   (((uint16_t)(((uint16_t)(x))<<3U))&0x8UL)           /*!< PWMA_SM1DMAEN.CB1DE Field               */
#define PWMA_SM1DMAEN_CA0DE_MASK                 (0x10U)                                             /*!< PWMA_SM1DMAEN.CA0DE Mask                */
#define PWMA_SM1DMAEN_CA0DE_SHIFT                (4U)                                                /*!< PWMA_SM1DMAEN.CA0DE Position            */
#define PWMA_SM1DMAEN_CA0DE(x)                   (((uint16_t)(((uint16_t)(x))<<4U))&0x10UL)          /*!< PWMA_SM1DMAEN.CA0DE Field               */
#define PWMA_SM1DMAEN_CA1DE_MASK                 (0x20U)                                             /*!< PWMA_SM1DMAEN.CA1DE Mask                */
#define PWMA_SM1DMAEN_CA1DE_SHIFT                (5U)                                                /*!< PWMA_SM1DMAEN.CA1DE Position            */
#define PWMA_SM1DMAEN_CA1DE(x)                   (((uint16_t)(((uint16_t)(x))<<5U))&0x20UL)          /*!< PWMA_SM1DMAEN.CA1DE Field               */
#define PWMA_SM1DMAEN_CAPTDE_MASK                (0xC0U)                                             /*!< PWMA_SM1DMAEN.CAPTDE Mask               */
#define PWMA_SM1DMAEN_CAPTDE_SHIFT               (6U)                                                /*!< PWMA_SM1DMAEN.CAPTDE Position           */
#define PWMA_SM1DMAEN_CAPTDE(x)                  (((uint16_t)(((uint16_t)(x))<<6U))&0xC0UL)          /*!< PWMA_SM1DMAEN.CAPTDE Field              */
#define PWMA_SM1DMAEN_FAND_MASK                  (0x100U)                                            /*!< PWMA_SM1DMAEN.FAND Mask                 */
#define PWMA_SM1DMAEN_FAND_SHIFT                 (8U)                                                /*!< PWMA_SM1DMAEN.FAND Position             */
#define PWMA_SM1DMAEN_FAND(x)                    (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< PWMA_SM1DMAEN.FAND Field                */
#define PWMA_SM1DMAEN_VALDE_MASK                 (0x200U)                                            /*!< PWMA_SM1DMAEN.VALDE Mask                */
#define PWMA_SM1DMAEN_VALDE_SHIFT                (9U)                                                /*!< PWMA_SM1DMAEN.VALDE Position            */
#define PWMA_SM1DMAEN_VALDE(x)                   (((uint16_t)(((uint16_t)(x))<<9U))&0x200UL)         /*!< PWMA_SM1DMAEN.VALDE Field               */
/* ------- SM1TCTRL Bit Fields                      ------ */
#define PWMA_SM1TCTRL_OUT_TRIG_EN_MASK           (0x3FU)                                             /*!< PWMA_SM1TCTRL.OUT_TRIG_EN Mask          */
#define PWMA_SM1TCTRL_OUT_TRIG_EN_SHIFT          (0U)                                                /*!< PWMA_SM1TCTRL.OUT_TRIG_EN Position      */
#define PWMA_SM1TCTRL_OUT_TRIG_EN(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0x3FUL)          /*!< PWMA_SM1TCTRL.OUT_TRIG_EN Field         */
#define PWMA_SM1TCTRL_PWBOT1_MASK                (0x4000U)                                           /*!< PWMA_SM1TCTRL.PWBOT1 Mask               */
#define PWMA_SM1TCTRL_PWBOT1_SHIFT               (14U)                                               /*!< PWMA_SM1TCTRL.PWBOT1 Position           */
#define PWMA_SM1TCTRL_PWBOT1(x)                  (((uint16_t)(((uint16_t)(x))<<14U))&0x4000UL)       /*!< PWMA_SM1TCTRL.PWBOT1 Field              */
#define PWMA_SM1TCTRL_PWAOT0_MASK                (0x8000U)                                           /*!< PWMA_SM1TCTRL.PWAOT0 Mask               */
#define PWMA_SM1TCTRL_PWAOT0_SHIFT               (15U)                                               /*!< PWMA_SM1TCTRL.PWAOT0 Position           */
#define PWMA_SM1TCTRL_PWAOT0(x)                  (((uint16_t)(((uint16_t)(x))<<15U))&0x8000UL)       /*!< PWMA_SM1TCTRL.PWAOT0 Field              */
/* ------- SM1DISMAP0 Bit Fields                    ------ */
