podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV45F16.h
#define PWMA_SM1DISMAP0_DIS0A_MASK               (0xFU)                                              /*!< PWMA_SM1DISMAP0.DIS0A Mask              */
#define PWMA_SM1DISMAP0_DIS0A_SHIFT              (0U)                                                /*!< PWMA_SM1DISMAP0.DIS0A Position          */
#define PWMA_SM1DISMAP0_DIS0A(x)                 (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM1DISMAP0.DIS0A Field             */
#define PWMA_SM1DISMAP0_DIS0B_MASK               (0xF0U)                                             /*!< PWMA_SM1DISMAP0.DIS0B Mask              */
#define PWMA_SM1DISMAP0_DIS0B_SHIFT              (4U)                                                /*!< PWMA_SM1DISMAP0.DIS0B Position          */
#define PWMA_SM1DISMAP0_DIS0B(x)                 (((uint16_t)(((uint16_t)(x))<<4U))&0xF0UL)          /*!< PWMA_SM1DISMAP0.DIS0B Field             */
#define PWMA_SM1DISMAP0_DIS0X_MASK               (0xF00U)                                            /*!< PWMA_SM1DISMAP0.DIS0X Mask              */
#define PWMA_SM1DISMAP0_DIS0X_SHIFT              (8U)                                                /*!< PWMA_SM1DISMAP0.DIS0X Position          */
#define PWMA_SM1DISMAP0_DIS0X(x)                 (((uint16_t)(((uint16_t)(x))<<8U))&0xF00UL)         /*!< PWMA_SM1DISMAP0.DIS0X Field             */
/* ------- SM1DTCNT Bit Fields                      ------ */
#define PWMA_SM1DTCNT_DTCNT0_MASK                (0x7FFU)                                            /*!< PWMA_SM1DTCNT.DTCNT0 Mask               */
#define PWMA_SM1DTCNT_DTCNT0_SHIFT               (0U)                                                /*!< PWMA_SM1DTCNT.DTCNT0 Position           */
#define PWMA_SM1DTCNT_DTCNT0(x)                  (((uint16_t)(((uint16_t)(x))<<0U))&0x7FFUL)         /*!< PWMA_SM1DTCNT.DTCNT0 Field              */
/* ------- SM1CAPTCTRLA Bit Fields                  ------ */
#define PWMA_SM1CAPTCTRLA_ARMA_MASK              (0x1U)                                              /*!< PWMA_SM1CAPTCTRLA.ARMA Mask             */
#define PWMA_SM1CAPTCTRLA_ARMA_SHIFT             (0U)                                                /*!< PWMA_SM1CAPTCTRLA.ARMA Position         */
#define PWMA_SM1CAPTCTRLA_ARMA(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< PWMA_SM1CAPTCTRLA.ARMA Field            */
#define PWMA_SM1CAPTCTRLA_ONESHOTA_MASK          (0x2U)                                              /*!< PWMA_SM1CAPTCTRLA.ONESHOTA Mask         */
#define PWMA_SM1CAPTCTRLA_ONESHOTA_SHIFT         (1U)                                                /*!< PWMA_SM1CAPTCTRLA.ONESHOTA Position     */
#define PWMA_SM1CAPTCTRLA_ONESHOTA(x)            (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< PWMA_SM1CAPTCTRLA.ONESHOTA Field        */
#define PWMA_SM1CAPTCTRLA_EDGA0_MASK             (0xCU)                                              /*!< PWMA_SM1CAPTCTRLA.EDGA0 Mask            */
#define PWMA_SM1CAPTCTRLA_EDGA0_SHIFT            (2U)                                                /*!< PWMA_SM1CAPTCTRLA.EDGA0 Position        */
#define PWMA_SM1CAPTCTRLA_EDGA0(x)               (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< PWMA_SM1CAPTCTRLA.EDGA0 Field           */
#define PWMA_SM1CAPTCTRLA_EDGA1_MASK             (0x30U)                                             /*!< PWMA_SM1CAPTCTRLA.EDGA1 Mask            */
#define PWMA_SM1CAPTCTRLA_EDGA1_SHIFT            (4U)                                                /*!< PWMA_SM1CAPTCTRLA.EDGA1 Position        */
#define PWMA_SM1CAPTCTRLA_EDGA1(x)               (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< PWMA_SM1CAPTCTRLA.EDGA1 Field           */
#define PWMA_SM1CAPTCTRLA_INP_SELA_MASK          (0x40U)                                             /*!< PWMA_SM1CAPTCTRLA.INP_SELA Mask         */
#define PWMA_SM1CAPTCTRLA_INP_SELA_SHIFT         (6U)                                                /*!< PWMA_SM1CAPTCTRLA.INP_SELA Position     */
#define PWMA_SM1CAPTCTRLA_INP_SELA(x)            (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< PWMA_SM1CAPTCTRLA.INP_SELA Field        */
#define PWMA_SM1CAPTCTRLA_EDGCNTA_EN_MASK        (0x80U)                                             /*!< PWMA_SM1CAPTCTRLA.EDGCNTA_EN Mask       */
#define PWMA_SM1CAPTCTRLA_EDGCNTA_EN_SHIFT       (7U)                                                /*!< PWMA_SM1CAPTCTRLA.EDGCNTA_EN Position   */
#define PWMA_SM1CAPTCTRLA_EDGCNTA_EN(x)          (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< PWMA_SM1CAPTCTRLA.EDGCNTA_EN Field      */
#define PWMA_SM1CAPTCTRLA_CFAWM_MASK             (0x300U)                                            /*!< PWMA_SM1CAPTCTRLA.CFAWM Mask            */
#define PWMA_SM1CAPTCTRLA_CFAWM_SHIFT            (8U)                                                /*!< PWMA_SM1CAPTCTRLA.CFAWM Position        */
#define PWMA_SM1CAPTCTRLA_CFAWM(x)               (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< PWMA_SM1CAPTCTRLA.CFAWM Field           */
#define PWMA_SM1CAPTCTRLA_CA0CNT_MASK            (0x1C00U)                                           /*!< PWMA_SM1CAPTCTRLA.CA0CNT Mask           */
#define PWMA_SM1CAPTCTRLA_CA0CNT_SHIFT           (10U)                                               /*!< PWMA_SM1CAPTCTRLA.CA0CNT Position       */
#define PWMA_SM1CAPTCTRLA_CA0CNT(x)              (((uint16_t)(((uint16_t)(x))<<10U))&0x1C00UL)       /*!< PWMA_SM1CAPTCTRLA.CA0CNT Field          */
#define PWMA_SM1CAPTCTRLA_CA1CNT_MASK            (0xE000U)                                           /*!< PWMA_SM1CAPTCTRLA.CA1CNT Mask           */
#define PWMA_SM1CAPTCTRLA_CA1CNT_SHIFT           (13U)                                               /*!< PWMA_SM1CAPTCTRLA.CA1CNT Position       */
#define PWMA_SM1CAPTCTRLA_CA1CNT(x)              (((uint16_t)(((uint16_t)(x))<<13U))&0xE000UL)       /*!< PWMA_SM1CAPTCTRLA.CA1CNT Field          */
/* ------- SM1CAPTCOMPA Bit Fields                  ------ */
#define PWMA_SM1CAPTCOMPA_EDGCMPA_MASK           (0xFFU)                                             /*!< PWMA_SM1CAPTCOMPA.EDGCMPA Mask          */
#define PWMA_SM1CAPTCOMPA_EDGCMPA_SHIFT          (0U)                                                /*!< PWMA_SM1CAPTCOMPA.EDGCMPA Position      */
#define PWMA_SM1CAPTCOMPA_EDGCMPA(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFFUL)          /*!< PWMA_SM1CAPTCOMPA.EDGCMPA Field         */
#define PWMA_SM1CAPTCOMPA_EDGCNTA_MASK           (0xFF00U)                                           /*!< PWMA_SM1CAPTCOMPA.EDGCNTA Mask          */
#define PWMA_SM1CAPTCOMPA_EDGCNTA_SHIFT          (8U)                                                /*!< PWMA_SM1CAPTCOMPA.EDGCNTA Position      */
#define PWMA_SM1CAPTCOMPA_EDGCNTA(x)             (((uint16_t)(((uint16_t)(x))<<8U))&0xFF00UL)        /*!< PWMA_SM1CAPTCOMPA.EDGCNTA Field         */
/* ------- SM1CAPTCTRLB Bit Fields                  ------ */
#define PWMA_SM1CAPTCTRLB_ARMB_MASK              (0x1U)                                              /*!< PWMA_SM1CAPTCTRLB.ARMB Mask             */
#define PWMA_SM1CAPTCTRLB_ARMB_SHIFT             (0U)                                                /*!< PWMA_SM1CAPTCTRLB.ARMB Position         */
#define PWMA_SM1CAPTCTRLB_ARMB(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< PWMA_SM1CAPTCTRLB.ARMB Field            */
#define PWMA_SM1CAPTCTRLB_ONESHOTB_MASK          (0x2U)                                              /*!< PWMA_SM1CAPTCTRLB.ONESHOTB Mask         */
#define PWMA_SM1CAPTCTRLB_ONESHOTB_SHIFT         (1U)                                                /*!< PWMA_SM1CAPTCTRLB.ONESHOTB Position     */
#define PWMA_SM1CAPTCTRLB_ONESHOTB(x)            (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< PWMA_SM1CAPTCTRLB.ONESHOTB Field        */
#define PWMA_SM1CAPTCTRLB_EDGB0_MASK             (0xCU)                                              /*!< PWMA_SM1CAPTCTRLB.EDGB0 Mask            */
#define PWMA_SM1CAPTCTRLB_EDGB0_SHIFT            (2U)                                                /*!< PWMA_SM1CAPTCTRLB.EDGB0 Position        */
#define PWMA_SM1CAPTCTRLB_EDGB0(x)               (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< PWMA_SM1CAPTCTRLB.EDGB0 Field           */
#define PWMA_SM1CAPTCTRLB_EDGB1_MASK             (0x30U)                                             /*!< PWMA_SM1CAPTCTRLB.EDGB1 Mask            */
#define PWMA_SM1CAPTCTRLB_EDGB1_SHIFT            (4U)                                                /*!< PWMA_SM1CAPTCTRLB.EDGB1 Position        */
#define PWMA_SM1CAPTCTRLB_EDGB1(x)               (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< PWMA_SM1CAPTCTRLB.EDGB1 Field           */
#define PWMA_SM1CAPTCTRLB_INP_SELB_MASK          (0x40U)                                             /*!< PWMA_SM1CAPTCTRLB.INP_SELB Mask         */
#define PWMA_SM1CAPTCTRLB_INP_SELB_SHIFT         (6U)                                                /*!< PWMA_SM1CAPTCTRLB.INP_SELB Position     */
#define PWMA_SM1CAPTCTRLB_INP_SELB(x)            (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< PWMA_SM1CAPTCTRLB.INP_SELB Field        */
#define PWMA_SM1CAPTCTRLB_EDGCNTB_EN_MASK        (0x80U)                                             /*!< PWMA_SM1CAPTCTRLB.EDGCNTB_EN Mask       */
#define PWMA_SM1CAPTCTRLB_EDGCNTB_EN_SHIFT       (7U)                                                /*!< PWMA_SM1CAPTCTRLB.EDGCNTB_EN Position   */
#define PWMA_SM1CAPTCTRLB_EDGCNTB_EN(x)          (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< PWMA_SM1CAPTCTRLB.EDGCNTB_EN Field      */
#define PWMA_SM1CAPTCTRLB_CFBWM_MASK             (0x300U)                                            /*!< PWMA_SM1CAPTCTRLB.CFBWM Mask            */
#define PWMA_SM1CAPTCTRLB_CFBWM_SHIFT            (8U)                                                /*!< PWMA_SM1CAPTCTRLB.CFBWM Position        */
#define PWMA_SM1CAPTCTRLB_CFBWM(x)               (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< PWMA_SM1CAPTCTRLB.CFBWM Field           */
#define PWMA_SM1CAPTCTRLB_CB0CNT_MASK            (0x1C00U)                                           /*!< PWMA_SM1CAPTCTRLB.CB0CNT Mask           */
#define PWMA_SM1CAPTCTRLB_CB0CNT_SHIFT           (10U)                                               /*!< PWMA_SM1CAPTCTRLB.CB0CNT Position       */
#define PWMA_SM1CAPTCTRLB_CB0CNT(x)              (((uint16_t)(((uint16_t)(x))<<10U))&0x1C00UL)       /*!< PWMA_SM1CAPTCTRLB.CB0CNT Field          */
#define PWMA_SM1CAPTCTRLB_CB1CNT_MASK            (0xE000U)                                           /*!< PWMA_SM1CAPTCTRLB.CB1CNT Mask           */
#define PWMA_SM1CAPTCTRLB_CB1CNT_SHIFT           (13U)                                               /*!< PWMA_SM1CAPTCTRLB.CB1CNT Position       */
#define PWMA_SM1CAPTCTRLB_CB1CNT(x)              (((uint16_t)(((uint16_t)(x))<<13U))&0xE000UL)       /*!< PWMA_SM1CAPTCTRLB.CB1CNT Field          */
/* ------- SM1CAPTCOMPB Bit Fields                  ------ */
#define PWMA_SM1CAPTCOMPB_EDGCMPB_MASK           (0xFFU)                                             /*!< PWMA_SM1CAPTCOMPB.EDGCMPB Mask          */
#define PWMA_SM1CAPTCOMPB_EDGCMPB_SHIFT          (0U)                                                /*!< PWMA_SM1CAPTCOMPB.EDGCMPB Position      */
#define PWMA_SM1CAPTCOMPB_EDGCMPB(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFFUL)          /*!< PWMA_SM1CAPTCOMPB.EDGCMPB Field         */
#define PWMA_SM1CAPTCOMPB_EDGCNTB_MASK           (0xFF00U)                                           /*!< PWMA_SM1CAPTCOMPB.EDGCNTB Mask          */
#define PWMA_SM1CAPTCOMPB_EDGCNTB_SHIFT          (8U)                                                /*!< PWMA_SM1CAPTCOMPB.EDGCNTB Position      */
#define PWMA_SM1CAPTCOMPB_EDGCNTB(x)             (((uint16_t)(((uint16_t)(x))<<8U))&0xFF00UL)        /*!< PWMA_SM1CAPTCOMPB.EDGCNTB Field         */
/* ------- SM1CAPTCTRLX Bit Fields                  ------ */
#define PWMA_SM1CAPTCTRLX_ARMX_MASK              (0x1U)                                              /*!< PWMA_SM1CAPTCTRLX.ARMX Mask             */
#define PWMA_SM1CAPTCTRLX_ARMX_SHIFT             (0U)                                                /*!< PWMA_SM1CAPTCTRLX.ARMX Position         */
#define PWMA_SM1CAPTCTRLX_ARMX(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< PWMA_SM1CAPTCTRLX.ARMX Field            */
#define PWMA_SM1CAPTCTRLX_ONESHOTX_MASK          (0x2U)                                              /*!< PWMA_SM1CAPTCTRLX.ONESHOTX Mask         */
#define PWMA_SM1CAPTCTRLX_ONESHOTX_SHIFT         (1U)                                                /*!< PWMA_SM1CAPTCTRLX.ONESHOTX Position     */
#define PWMA_SM1CAPTCTRLX_ONESHOTX(x)            (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< PWMA_SM1CAPTCTRLX.ONESHOTX Field        */
#define PWMA_SM1CAPTCTRLX_EDGX0_MASK             (0xCU)                                              /*!< PWMA_SM1CAPTCTRLX.EDGX0 Mask            */
#define PWMA_SM1CAPTCTRLX_EDGX0_SHIFT            (2U)                                                /*!< PWMA_SM1CAPTCTRLX.EDGX0 Position        */
#define PWMA_SM1CAPTCTRLX_EDGX0(x)               (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< PWMA_SM1CAPTCTRLX.EDGX0 Field           */
#define PWMA_SM1CAPTCTRLX_EDGX1_MASK             (0x30U)                                             /*!< PWMA_SM1CAPTCTRLX.EDGX1 Mask            */
#define PWMA_SM1CAPTCTRLX_EDGX1_SHIFT            (4U)                                                /*!< PWMA_SM1CAPTCTRLX.EDGX1 Position        */
#define PWMA_SM1CAPTCTRLX_EDGX1(x)               (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< PWMA_SM1CAPTCTRLX.EDGX1 Field           */
#define PWMA_SM1CAPTCTRLX_INP_SELX_MASK          (0x40U)                                             /*!< PWMA_SM1CAPTCTRLX.INP_SELX Mask         */
#define PWMA_SM1CAPTCTRLX_INP_SELX_SHIFT         (6U)                                                /*!< PWMA_SM1CAPTCTRLX.INP_SELX Position     */
#define PWMA_SM1CAPTCTRLX_INP_SELX(x)            (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< PWMA_SM1CAPTCTRLX.INP_SELX Field        */
#define PWMA_SM1CAPTCTRLX_EDGCNTX_EN_MASK        (0x80U)                                             /*!< PWMA_SM1CAPTCTRLX.EDGCNTX_EN Mask       */
#define PWMA_SM1CAPTCTRLX_EDGCNTX_EN_SHIFT       (7U)                                                /*!< PWMA_SM1CAPTCTRLX.EDGCNTX_EN Position   */
#define PWMA_SM1CAPTCTRLX_EDGCNTX_EN(x)          (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< PWMA_SM1CAPTCTRLX.EDGCNTX_EN Field      */
#define PWMA_SM1CAPTCTRLX_CFXWM_MASK             (0x300U)                                            /*!< PWMA_SM1CAPTCTRLX.CFXWM Mask            */
#define PWMA_SM1CAPTCTRLX_CFXWM_SHIFT            (8U)                                                /*!< PWMA_SM1CAPTCTRLX.CFXWM Position        */
#define PWMA_SM1CAPTCTRLX_CFXWM(x)               (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< PWMA_SM1CAPTCTRLX.CFXWM Field           */
#define PWMA_SM1CAPTCTRLX_CX0CNT_MASK            (0x1C00U)                                           /*!< PWMA_SM1CAPTCTRLX.CX0CNT Mask           */
#define PWMA_SM1CAPTCTRLX_CX0CNT_SHIFT           (10U)                                               /*!< PWMA_SM1CAPTCTRLX.CX0CNT Position       */
#define PWMA_SM1CAPTCTRLX_CX0CNT(x)              (((uint16_t)(((uint16_t)(x))<<10U))&0x1C00UL)       /*!< PWMA_SM1CAPTCTRLX.CX0CNT Field          */
#define PWMA_SM1CAPTCTRLX_CX1CNT_MASK            (0xE000U)                                           /*!< PWMA_SM1CAPTCTRLX.CX1CNT Mask           */
#define PWMA_SM1CAPTCTRLX_CX1CNT_SHIFT           (13U)                                               /*!< PWMA_SM1CAPTCTRLX.CX1CNT Position       */
#define PWMA_SM1CAPTCTRLX_CX1CNT(x)              (((uint16_t)(((uint16_t)(x))<<13U))&0xE000UL)       /*!< PWMA_SM1CAPTCTRLX.CX1CNT Field          */
/* ------- SM1CAPTCOMPX Bit Fields                  ------ */
#define PWMA_SM1CAPTCOMPX_EDGCMPX_MASK           (0xFFU)                                             /*!< PWMA_SM1CAPTCOMPX.EDGCMPX Mask          */
#define PWMA_SM1CAPTCOMPX_EDGCMPX_SHIFT          (0U)                                                /*!< PWMA_SM1CAPTCOMPX.EDGCMPX Position      */
#define PWMA_SM1CAPTCOMPX_EDGCMPX(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFFUL)          /*!< PWMA_SM1CAPTCOMPX.EDGCMPX Field         */
#define PWMA_SM1CAPTCOMPX_EDGCNTX_MASK           (0xFF00U)                                           /*!< PWMA_SM1CAPTCOMPX.EDGCNTX Mask          */
#define PWMA_SM1CAPTCOMPX_EDGCNTX_SHIFT          (8U)                                                /*!< PWMA_SM1CAPTCOMPX.EDGCNTX Position      */
#define PWMA_SM1CAPTCOMPX_EDGCNTX(x)             (((uint16_t)(((uint16_t)(x))<<8U))&0xFF00UL)        /*!< PWMA_SM1CAPTCOMPX.EDGCNTX Field         */
/* ------- SM1CVAL0 Bit Fields                      ------ */
#define PWMA_SM1CVAL0_CAPTVAL0_MASK              (0xFFFFU)                                           /*!< PWMA_SM1CVAL0.CAPTVAL0 Mask             */
#define PWMA_SM1CVAL0_CAPTVAL0_SHIFT             (0U)                                                /*!< PWMA_SM1CVAL0.CAPTVAL0 Position         */
#define PWMA_SM1CVAL0_CAPTVAL0(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM1CVAL0.CAPTVAL0 Field            */
/* ------- SM1CVAL0CYC Bit Fields                   ------ */
#define PWMA_SM1CVAL0CYC_CVAL0CYC_MASK           (0xFU)                                              /*!< PWMA_SM1CVAL0CYC.CVAL0CYC Mask          */
#define PWMA_SM1CVAL0CYC_CVAL0CYC_SHIFT          (0U)                                                /*!< PWMA_SM1CVAL0CYC.CVAL0CYC Position      */
#define PWMA_SM1CVAL0CYC_CVAL0CYC(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM1CVAL0CYC.CVAL0CYC Field         */
/* ------- SM1CVAL1 Bit Fields                      ------ */
#define PWMA_SM1CVAL1_CAPTVAL1_MASK              (0xFFFFU)                                           /*!< PWMA_SM1CVAL1.CAPTVAL1 Mask             */
#define PWMA_SM1CVAL1_CAPTVAL1_SHIFT             (0U)                                                /*!< PWMA_SM1CVAL1.CAPTVAL1 Position         */
#define PWMA_SM1CVAL1_CAPTVAL1(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM1CVAL1.CAPTVAL1 Field            */
/* ------- SM1CVAL1CYC Bit Fields                   ------ */
#define PWMA_SM1CVAL1CYC_CVAL1CYC_MASK           (0xFU)                                              /*!< PWMA_SM1CVAL1CYC.CVAL1CYC Mask          */
#define PWMA_SM1CVAL1CYC_CVAL1CYC_SHIFT          (0U)                                                /*!< PWMA_SM1CVAL1CYC.CVAL1CYC Position      */
#define PWMA_SM1CVAL1CYC_CVAL1CYC(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM1CVAL1CYC.CVAL1CYC Field         */
/* ------- SM1CVAL2 Bit Fields                      ------ */
#define PWMA_SM1CVAL2_CAPTVAL2_MASK              (0xFFFFU)                                           /*!< PWMA_SM1CVAL2.CAPTVAL2 Mask             */
#define PWMA_SM1CVAL2_CAPTVAL2_SHIFT             (0U)                                                /*!< PWMA_SM1CVAL2.CAPTVAL2 Position         */
#define PWMA_SM1CVAL2_CAPTVAL2(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM1CVAL2.CAPTVAL2 Field            */
/* ------- SM1CVAL2CYC Bit Fields                   ------ */
#define PWMA_SM1CVAL2CYC_CVAL2CYC_MASK           (0xFU)                                              /*!< PWMA_SM1CVAL2CYC.CVAL2CYC Mask          */
#define PWMA_SM1CVAL2CYC_CVAL2CYC_SHIFT          (0U)                                                /*!< PWMA_SM1CVAL2CYC.CVAL2CYC Position      */
#define PWMA_SM1CVAL2CYC_CVAL2CYC(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM1CVAL2CYC.CVAL2CYC Field         */
/* ------- SM1CVAL3 Bit Fields                      ------ */
#define PWMA_SM1CVAL3_CAPTVAL3_MASK              (0xFFFFU)                                           /*!< PWMA_SM1CVAL3.CAPTVAL3 Mask             */
#define PWMA_SM1CVAL3_CAPTVAL3_SHIFT             (0U)                                                /*!< PWMA_SM1CVAL3.CAPTVAL3 Position         */
#define PWMA_SM1CVAL3_CAPTVAL3(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM1CVAL3.CAPTVAL3 Field            */
/* ------- SM1CVAL3CYC Bit Fields                   ------ */
#define PWMA_SM1CVAL3CYC_CVAL3CYC_MASK           (0xFU)                                              /*!< PWMA_SM1CVAL3CYC.CVAL3CYC Mask          */
#define PWMA_SM1CVAL3CYC_CVAL3CYC_SHIFT          (0U)                                                /*!< PWMA_SM1CVAL3CYC.CVAL3CYC Position      */
#define PWMA_SM1CVAL3CYC_CVAL3CYC(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM1CVAL3CYC.CVAL3CYC Field         */
/* ------- SM1CVAL4 Bit Fields                      ------ */
#define PWMA_SM1CVAL4_CAPTVAL4_MASK              (0xFFFFU)                                           /*!< PWMA_SM1CVAL4.CAPTVAL4 Mask             */
#define PWMA_SM1CVAL4_CAPTVAL4_SHIFT             (0U)                                                /*!< PWMA_SM1CVAL4.CAPTVAL4 Position         */
#define PWMA_SM1CVAL4_CAPTVAL4(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM1CVAL4.CAPTVAL4 Field            */
/* ------- SM1CVAL4CYC Bit Fields                   ------ */
#define PWMA_SM1CVAL4CYC_CVAL4CYC_MASK           (0xFU)                                              /*!< PWMA_SM1CVAL4CYC.CVAL4CYC Mask          */
#define PWMA_SM1CVAL4CYC_CVAL4CYC_SHIFT          (0U)                                                /*!< PWMA_SM1CVAL4CYC.CVAL4CYC Position      */
#define PWMA_SM1CVAL4CYC_CVAL4CYC(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM1CVAL4CYC.CVAL4CYC Field         */
/* ------- SM1CVAL5 Bit Fields                      ------ */
#define PWMA_SM1CVAL5_CAPTVAL5_MASK              (0xFFFFU)                                           /*!< PWMA_SM1CVAL5.CAPTVAL5 Mask             */
#define PWMA_SM1CVAL5_CAPTVAL5_SHIFT             (0U)                                                /*!< PWMA_SM1CVAL5.CAPTVAL5 Position         */
#define PWMA_SM1CVAL5_CAPTVAL5(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM1CVAL5.CAPTVAL5 Field            */
/* ------- SM1CVAL5CYC Bit Fields                   ------ */
#define PWMA_SM1CVAL5CYC_CVAL5CYC_MASK           (0xFU)                                              /*!< PWMA_SM1CVAL5CYC.CVAL5CYC Mask          */
#define PWMA_SM1CVAL5CYC_CVAL5CYC_SHIFT          (0U)                                                /*!< PWMA_SM1CVAL5CYC.CVAL5CYC Position      */
#define PWMA_SM1CVAL5CYC_CVAL5CYC(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM1CVAL5CYC.CVAL5CYC Field         */
/* ------- SM2CNT Bit Fields                        ------ */
#define PWMA_SM2CNT_CNT_MASK                     (0xFFFFU)                                           /*!< PWMA_SM2CNT.CNT Mask                    */
#define PWMA_SM2CNT_CNT_SHIFT                    (0U)                                                /*!< PWMA_SM2CNT.CNT Position                */
#define PWMA_SM2CNT_CNT(x)                       (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM2CNT.CNT Field                   */
/* ------- SM2INIT Bit Fields                       ------ */
#define PWMA_SM2INIT_INIT_MASK                   (0xFFFFU)                                           /*!< PWMA_SM2INIT.INIT Mask                  */
#define PWMA_SM2INIT_INIT_SHIFT                  (0U)                                                /*!< PWMA_SM2INIT.INIT Position              */
