podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV45F16.h
#define PWMA_SM2CAPTCTRLX_ONESHOTX_MASK          (0x2U)                                              /*!< PWMA_SM2CAPTCTRLX.ONESHOTX Mask         */
#define PWMA_SM2CAPTCTRLX_ONESHOTX_SHIFT         (1U)                                                /*!< PWMA_SM2CAPTCTRLX.ONESHOTX Position     */
#define PWMA_SM2CAPTCTRLX_ONESHOTX(x)            (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< PWMA_SM2CAPTCTRLX.ONESHOTX Field        */
#define PWMA_SM2CAPTCTRLX_EDGX0_MASK             (0xCU)                                              /*!< PWMA_SM2CAPTCTRLX.EDGX0 Mask            */
#define PWMA_SM2CAPTCTRLX_EDGX0_SHIFT            (2U)                                                /*!< PWMA_SM2CAPTCTRLX.EDGX0 Position        */
#define PWMA_SM2CAPTCTRLX_EDGX0(x)               (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< PWMA_SM2CAPTCTRLX.EDGX0 Field           */
#define PWMA_SM2CAPTCTRLX_EDGX1_MASK             (0x30U)                                             /*!< PWMA_SM2CAPTCTRLX.EDGX1 Mask            */
#define PWMA_SM2CAPTCTRLX_EDGX1_SHIFT            (4U)                                                /*!< PWMA_SM2CAPTCTRLX.EDGX1 Position        */
#define PWMA_SM2CAPTCTRLX_EDGX1(x)               (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< PWMA_SM2CAPTCTRLX.EDGX1 Field           */
#define PWMA_SM2CAPTCTRLX_INP_SELX_MASK          (0x40U)                                             /*!< PWMA_SM2CAPTCTRLX.INP_SELX Mask         */
#define PWMA_SM2CAPTCTRLX_INP_SELX_SHIFT         (6U)                                                /*!< PWMA_SM2CAPTCTRLX.INP_SELX Position     */
#define PWMA_SM2CAPTCTRLX_INP_SELX(x)            (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< PWMA_SM2CAPTCTRLX.INP_SELX Field        */
#define PWMA_SM2CAPTCTRLX_EDGCNTX_EN_MASK        (0x80U)                                             /*!< PWMA_SM2CAPTCTRLX.EDGCNTX_EN Mask       */
#define PWMA_SM2CAPTCTRLX_EDGCNTX_EN_SHIFT       (7U)                                                /*!< PWMA_SM2CAPTCTRLX.EDGCNTX_EN Position   */
#define PWMA_SM2CAPTCTRLX_EDGCNTX_EN(x)          (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< PWMA_SM2CAPTCTRLX.EDGCNTX_EN Field      */
#define PWMA_SM2CAPTCTRLX_CFXWM_MASK             (0x300U)                                            /*!< PWMA_SM2CAPTCTRLX.CFXWM Mask            */
#define PWMA_SM2CAPTCTRLX_CFXWM_SHIFT            (8U)                                                /*!< PWMA_SM2CAPTCTRLX.CFXWM Position        */
#define PWMA_SM2CAPTCTRLX_CFXWM(x)               (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< PWMA_SM2CAPTCTRLX.CFXWM Field           */
#define PWMA_SM2CAPTCTRLX_CX0CNT_MASK            (0x1C00U)                                           /*!< PWMA_SM2CAPTCTRLX.CX0CNT Mask           */
#define PWMA_SM2CAPTCTRLX_CX0CNT_SHIFT           (10U)                                               /*!< PWMA_SM2CAPTCTRLX.CX0CNT Position       */
#define PWMA_SM2CAPTCTRLX_CX0CNT(x)              (((uint16_t)(((uint16_t)(x))<<10U))&0x1C00UL)       /*!< PWMA_SM2CAPTCTRLX.CX0CNT Field          */
#define PWMA_SM2CAPTCTRLX_CX1CNT_MASK            (0xE000U)                                           /*!< PWMA_SM2CAPTCTRLX.CX1CNT Mask           */
#define PWMA_SM2CAPTCTRLX_CX1CNT_SHIFT           (13U)                                               /*!< PWMA_SM2CAPTCTRLX.CX1CNT Position       */
#define PWMA_SM2CAPTCTRLX_CX1CNT(x)              (((uint16_t)(((uint16_t)(x))<<13U))&0xE000UL)       /*!< PWMA_SM2CAPTCTRLX.CX1CNT Field          */
/* ------- SM2CAPTCOMPX Bit Fields                  ------ */
#define PWMA_SM2CAPTCOMPX_EDGCMPX_MASK           (0xFFU)                                             /*!< PWMA_SM2CAPTCOMPX.EDGCMPX Mask          */
#define PWMA_SM2CAPTCOMPX_EDGCMPX_SHIFT          (0U)                                                /*!< PWMA_SM2CAPTCOMPX.EDGCMPX Position      */
#define PWMA_SM2CAPTCOMPX_EDGCMPX(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFFUL)          /*!< PWMA_SM2CAPTCOMPX.EDGCMPX Field         */
#define PWMA_SM2CAPTCOMPX_EDGCNTX_MASK           (0xFF00U)                                           /*!< PWMA_SM2CAPTCOMPX.EDGCNTX Mask          */
#define PWMA_SM2CAPTCOMPX_EDGCNTX_SHIFT          (8U)                                                /*!< PWMA_SM2CAPTCOMPX.EDGCNTX Position      */
#define PWMA_SM2CAPTCOMPX_EDGCNTX(x)             (((uint16_t)(((uint16_t)(x))<<8U))&0xFF00UL)        /*!< PWMA_SM2CAPTCOMPX.EDGCNTX Field         */
/* ------- SM2CVAL0 Bit Fields                      ------ */
#define PWMA_SM2CVAL0_CAPTVAL0_MASK              (0xFFFFU)                                           /*!< PWMA_SM2CVAL0.CAPTVAL0 Mask             */
#define PWMA_SM2CVAL0_CAPTVAL0_SHIFT             (0U)                                                /*!< PWMA_SM2CVAL0.CAPTVAL0 Position         */
#define PWMA_SM2CVAL0_CAPTVAL0(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM2CVAL0.CAPTVAL0 Field            */
/* ------- SM2CVAL0CYC Bit Fields                   ------ */
#define PWMA_SM2CVAL0CYC_CVAL0CYC_MASK           (0xFU)                                              /*!< PWMA_SM2CVAL0CYC.CVAL0CYC Mask          */
#define PWMA_SM2CVAL0CYC_CVAL0CYC_SHIFT          (0U)                                                /*!< PWMA_SM2CVAL0CYC.CVAL0CYC Position      */
#define PWMA_SM2CVAL0CYC_CVAL0CYC(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM2CVAL0CYC.CVAL0CYC Field         */
/* ------- SM2CVAL1 Bit Fields                      ------ */
#define PWMA_SM2CVAL1_CAPTVAL1_MASK              (0xFFFFU)                                           /*!< PWMA_SM2CVAL1.CAPTVAL1 Mask             */
#define PWMA_SM2CVAL1_CAPTVAL1_SHIFT             (0U)                                                /*!< PWMA_SM2CVAL1.CAPTVAL1 Position         */
#define PWMA_SM2CVAL1_CAPTVAL1(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM2CVAL1.CAPTVAL1 Field            */
/* ------- SM2CVAL1CYC Bit Fields                   ------ */
#define PWMA_SM2CVAL1CYC_CVAL1CYC_MASK           (0xFU)                                              /*!< PWMA_SM2CVAL1CYC.CVAL1CYC Mask          */
#define PWMA_SM2CVAL1CYC_CVAL1CYC_SHIFT          (0U)                                                /*!< PWMA_SM2CVAL1CYC.CVAL1CYC Position      */
#define PWMA_SM2CVAL1CYC_CVAL1CYC(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM2CVAL1CYC.CVAL1CYC Field         */
/* ------- SM2CVAL2 Bit Fields                      ------ */
#define PWMA_SM2CVAL2_CAPTVAL2_MASK              (0xFFFFU)                                           /*!< PWMA_SM2CVAL2.CAPTVAL2 Mask             */
#define PWMA_SM2CVAL2_CAPTVAL2_SHIFT             (0U)                                                /*!< PWMA_SM2CVAL2.CAPTVAL2 Position         */
#define PWMA_SM2CVAL2_CAPTVAL2(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM2CVAL2.CAPTVAL2 Field            */
/* ------- SM2CVAL2CYC Bit Fields                   ------ */
#define PWMA_SM2CVAL2CYC_CVAL2CYC_MASK           (0xFU)                                              /*!< PWMA_SM2CVAL2CYC.CVAL2CYC Mask          */
#define PWMA_SM2CVAL2CYC_CVAL2CYC_SHIFT          (0U)                                                /*!< PWMA_SM2CVAL2CYC.CVAL2CYC Position      */
#define PWMA_SM2CVAL2CYC_CVAL2CYC(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM2CVAL2CYC.CVAL2CYC Field         */
/* ------- SM2CVAL3 Bit Fields                      ------ */
#define PWMA_SM2CVAL3_CAPTVAL3_MASK              (0xFFFFU)                                           /*!< PWMA_SM2CVAL3.CAPTVAL3 Mask             */
#define PWMA_SM2CVAL3_CAPTVAL3_SHIFT             (0U)                                                /*!< PWMA_SM2CVAL3.CAPTVAL3 Position         */
#define PWMA_SM2CVAL3_CAPTVAL3(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM2CVAL3.CAPTVAL3 Field            */
/* ------- SM2CVAL3CYC Bit Fields                   ------ */
#define PWMA_SM2CVAL3CYC_CVAL3CYC_MASK           (0xFU)                                              /*!< PWMA_SM2CVAL3CYC.CVAL3CYC Mask          */
#define PWMA_SM2CVAL3CYC_CVAL3CYC_SHIFT          (0U)                                                /*!< PWMA_SM2CVAL3CYC.CVAL3CYC Position      */
#define PWMA_SM2CVAL3CYC_CVAL3CYC(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM2CVAL3CYC.CVAL3CYC Field         */
/* ------- SM2CVAL4 Bit Fields                      ------ */
#define PWMA_SM2CVAL4_CAPTVAL4_MASK              (0xFFFFU)                                           /*!< PWMA_SM2CVAL4.CAPTVAL4 Mask             */
#define PWMA_SM2CVAL4_CAPTVAL4_SHIFT             (0U)                                                /*!< PWMA_SM2CVAL4.CAPTVAL4 Position         */
#define PWMA_SM2CVAL4_CAPTVAL4(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM2CVAL4.CAPTVAL4 Field            */
/* ------- SM2CVAL4CYC Bit Fields                   ------ */
#define PWMA_SM2CVAL4CYC_CVAL4CYC_MASK           (0xFU)                                              /*!< PWMA_SM2CVAL4CYC.CVAL4CYC Mask          */
#define PWMA_SM2CVAL4CYC_CVAL4CYC_SHIFT          (0U)                                                /*!< PWMA_SM2CVAL4CYC.CVAL4CYC Position      */
#define PWMA_SM2CVAL4CYC_CVAL4CYC(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM2CVAL4CYC.CVAL4CYC Field         */
/* ------- SM2CVAL5 Bit Fields                      ------ */
#define PWMA_SM2CVAL5_CAPTVAL5_MASK              (0xFFFFU)                                           /*!< PWMA_SM2CVAL5.CAPTVAL5 Mask             */
#define PWMA_SM2CVAL5_CAPTVAL5_SHIFT             (0U)                                                /*!< PWMA_SM2CVAL5.CAPTVAL5 Position         */
#define PWMA_SM2CVAL5_CAPTVAL5(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM2CVAL5.CAPTVAL5 Field            */
/* ------- SM2CVAL5CYC Bit Fields                   ------ */
#define PWMA_SM2CVAL5CYC_CVAL5CYC_MASK           (0xFU)                                              /*!< PWMA_SM2CVAL5CYC.CVAL5CYC Mask          */
#define PWMA_SM2CVAL5CYC_CVAL5CYC_SHIFT          (0U)                                                /*!< PWMA_SM2CVAL5CYC.CVAL5CYC Position      */
#define PWMA_SM2CVAL5CYC_CVAL5CYC(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM2CVAL5CYC.CVAL5CYC Field         */
/* ------- SM3CNT Bit Fields                        ------ */
#define PWMA_SM3CNT_CNT_MASK                     (0xFFFFU)                                           /*!< PWMA_SM3CNT.CNT Mask                    */
#define PWMA_SM3CNT_CNT_SHIFT                    (0U)                                                /*!< PWMA_SM3CNT.CNT Position                */
#define PWMA_SM3CNT_CNT(x)                       (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM3CNT.CNT Field                   */
/* ------- SM3INIT Bit Fields                       ------ */
#define PWMA_SM3INIT_INIT_MASK                   (0xFFFFU)                                           /*!< PWMA_SM3INIT.INIT Mask                  */
#define PWMA_SM3INIT_INIT_SHIFT                  (0U)                                                /*!< PWMA_SM3INIT.INIT Position              */
#define PWMA_SM3INIT_INIT(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM3INIT.INIT Field                 */
/* ------- SM3CTRL2 Bit Fields                      ------ */
#define PWMA_SM3CTRL2_CLK_SEL_MASK               (0x3U)                                              /*!< PWMA_SM3CTRL2.CLK_SEL Mask              */
#define PWMA_SM3CTRL2_CLK_SEL_SHIFT              (0U)                                                /*!< PWMA_SM3CTRL2.CLK_SEL Position          */
#define PWMA_SM3CTRL2_CLK_SEL(x)                 (((uint16_t)(((uint16_t)(x))<<0U))&0x3UL)           /*!< PWMA_SM3CTRL2.CLK_SEL Field             */
#define PWMA_SM3CTRL2_RELOAD_SEL_MASK            (0x4U)                                              /*!< PWMA_SM3CTRL2.RELOAD_SEL Mask           */
#define PWMA_SM3CTRL2_RELOAD_SEL_SHIFT           (2U)                                                /*!< PWMA_SM3CTRL2.RELOAD_SEL Position       */
#define PWMA_SM3CTRL2_RELOAD_SEL(x)              (((uint16_t)(((uint16_t)(x))<<2U))&0x4UL)           /*!< PWMA_SM3CTRL2.RELOAD_SEL Field          */
#define PWMA_SM3CTRL2_FORCE_SEL_MASK             (0x38U)                                             /*!< PWMA_SM3CTRL2.FORCE_SEL Mask            */
#define PWMA_SM3CTRL2_FORCE_SEL_SHIFT            (3U)                                                /*!< PWMA_SM3CTRL2.FORCE_SEL Position        */
#define PWMA_SM3CTRL2_FORCE_SEL(x)               (((uint16_t)(((uint16_t)(x))<<3U))&0x38UL)          /*!< PWMA_SM3CTRL2.FORCE_SEL Field           */
#define PWMA_SM3CTRL2_FORCE_MASK                 (0x40U)                                             /*!< PWMA_SM3CTRL2.FORCE Mask                */
#define PWMA_SM3CTRL2_FORCE_SHIFT                (6U)                                                /*!< PWMA_SM3CTRL2.FORCE Position            */
#define PWMA_SM3CTRL2_FORCE(x)                   (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< PWMA_SM3CTRL2.FORCE Field               */
#define PWMA_SM3CTRL2_FRCEN_MASK                 (0x80U)                                             /*!< PWMA_SM3CTRL2.FRCEN Mask                */
#define PWMA_SM3CTRL2_FRCEN_SHIFT                (7U)                                                /*!< PWMA_SM3CTRL2.FRCEN Position            */
#define PWMA_SM3CTRL2_FRCEN(x)                   (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< PWMA_SM3CTRL2.FRCEN Field               */
#define PWMA_SM3CTRL2_INIT_SEL_MASK              (0x300U)                                            /*!< PWMA_SM3CTRL2.INIT_SEL Mask             */
#define PWMA_SM3CTRL2_INIT_SEL_SHIFT             (8U)                                                /*!< PWMA_SM3CTRL2.INIT_SEL Position         */
#define PWMA_SM3CTRL2_INIT_SEL(x)                (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< PWMA_SM3CTRL2.INIT_SEL Field            */
#define PWMA_SM3CTRL2_PWMX_INIT_MASK             (0x400U)                                            /*!< PWMA_SM3CTRL2.PWMX_INIT Mask            */
#define PWMA_SM3CTRL2_PWMX_INIT_SHIFT            (10U)                                               /*!< PWMA_SM3CTRL2.PWMX_INIT Position        */
#define PWMA_SM3CTRL2_PWMX_INIT(x)               (((uint16_t)(((uint16_t)(x))<<10U))&0x400UL)        /*!< PWMA_SM3CTRL2.PWMX_INIT Field           */
#define PWMA_SM3CTRL2_PWM45_INIT_MASK            (0x800U)                                            /*!< PWMA_SM3CTRL2.PWM45_INIT Mask           */
#define PWMA_SM3CTRL2_PWM45_INIT_SHIFT           (11U)                                               /*!< PWMA_SM3CTRL2.PWM45_INIT Position       */
#define PWMA_SM3CTRL2_PWM45_INIT(x)              (((uint16_t)(((uint16_t)(x))<<11U))&0x800UL)        /*!< PWMA_SM3CTRL2.PWM45_INIT Field          */
#define PWMA_SM3CTRL2_PWM23_INIT_MASK            (0x1000U)                                           /*!< PWMA_SM3CTRL2.PWM23_INIT Mask           */
#define PWMA_SM3CTRL2_PWM23_INIT_SHIFT           (12U)                                               /*!< PWMA_SM3CTRL2.PWM23_INIT Position       */
#define PWMA_SM3CTRL2_PWM23_INIT(x)              (((uint16_t)(((uint16_t)(x))<<12U))&0x1000UL)       /*!< PWMA_SM3CTRL2.PWM23_INIT Field          */
#define PWMA_SM3CTRL2_INDEP_MASK                 (0x2000U)                                           /*!< PWMA_SM3CTRL2.INDEP Mask                */
#define PWMA_SM3CTRL2_INDEP_SHIFT                (13U)                                               /*!< PWMA_SM3CTRL2.INDEP Position            */
#define PWMA_SM3CTRL2_INDEP(x)                   (((uint16_t)(((uint16_t)(x))<<13U))&0x2000UL)       /*!< PWMA_SM3CTRL2.INDEP Field               */
#define PWMA_SM3CTRL2_WAITEN_MASK                (0x4000U)                                           /*!< PWMA_SM3CTRL2.WAITEN Mask               */
#define PWMA_SM3CTRL2_WAITEN_SHIFT               (14U)                                               /*!< PWMA_SM3CTRL2.WAITEN Position           */
#define PWMA_SM3CTRL2_WAITEN(x)                  (((uint16_t)(((uint16_t)(x))<<14U))&0x4000UL)       /*!< PWMA_SM3CTRL2.WAITEN Field              */
#define PWMA_SM3CTRL2_DBGEN_MASK                 (0x8000U)                                           /*!< PWMA_SM3CTRL2.DBGEN Mask                */
#define PWMA_SM3CTRL2_DBGEN_SHIFT                (15U)                                               /*!< PWMA_SM3CTRL2.DBGEN Position            */
#define PWMA_SM3CTRL2_DBGEN(x)                   (((uint16_t)(((uint16_t)(x))<<15U))&0x8000UL)       /*!< PWMA_SM3CTRL2.DBGEN Field               */
/* ------- SM3CTRL Bit Fields                       ------ */
#define PWMA_SM3CTRL_DBLEN_MASK                  (0x1U)                                              /*!< PWMA_SM3CTRL.DBLEN Mask                 */
#define PWMA_SM3CTRL_DBLEN_SHIFT                 (0U)                                                /*!< PWMA_SM3CTRL.DBLEN Position             */
#define PWMA_SM3CTRL_DBLEN(x)                    (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< PWMA_SM3CTRL.DBLEN Field                */
#define PWMA_SM3CTRL_DBLX_MASK                   (0x2U)                                              /*!< PWMA_SM3CTRL.DBLX Mask                  */
#define PWMA_SM3CTRL_DBLX_SHIFT                  (1U)                                                /*!< PWMA_SM3CTRL.DBLX Position              */
#define PWMA_SM3CTRL_DBLX(x)                     (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< PWMA_SM3CTRL.DBLX Field                 */
#define PWMA_SM3CTRL_LDMOD_MASK                  (0x4U)                                              /*!< PWMA_SM3CTRL.LDMOD Mask                 */
#define PWMA_SM3CTRL_LDMOD_SHIFT                 (2U)                                                /*!< PWMA_SM3CTRL.LDMOD Position             */
#define PWMA_SM3CTRL_LDMOD(x)                    (((uint16_t)(((uint16_t)(x))<<2U))&0x4UL)           /*!< PWMA_SM3CTRL.LDMOD Field                */
#define PWMA_SM3CTRL_PRSC_MASK                   (0x70U)                                             /*!< PWMA_SM3CTRL.PRSC Mask                  */
#define PWMA_SM3CTRL_PRSC_SHIFT                  (4U)                                                /*!< PWMA_SM3CTRL.PRSC Position              */
#define PWMA_SM3CTRL_PRSC(x)                     (((uint16_t)(((uint16_t)(x))<<4U))&0x70UL)          /*!< PWMA_SM3CTRL.PRSC Field                 */
#define PWMA_SM3CTRL_DT_MASK                     (0x300U)                                            /*!< PWMA_SM3CTRL.DT Mask                    */
#define PWMA_SM3CTRL_DT_SHIFT                    (8U)                                                /*!< PWMA_SM3CTRL.DT Position                */
#define PWMA_SM3CTRL_DT(x)                       (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< PWMA_SM3CTRL.DT Field                   */
#define PWMA_SM3CTRL_FULL_MASK                   (0x400U)                                            /*!< PWMA_SM3CTRL.FULL Mask                  */
#define PWMA_SM3CTRL_FULL_SHIFT                  (10U)                                               /*!< PWMA_SM3CTRL.FULL Position              */
#define PWMA_SM3CTRL_FULL(x)                     (((uint16_t)(((uint16_t)(x))<<10U))&0x400UL)        /*!< PWMA_SM3CTRL.FULL Field                 */
#define PWMA_SM3CTRL_HALF_MASK                   (0x800U)                                            /*!< PWMA_SM3CTRL.HALF Mask                  */
#define PWMA_SM3CTRL_HALF_SHIFT                  (11U)                                               /*!< PWMA_SM3CTRL.HALF Position              */
#define PWMA_SM3CTRL_HALF(x)                     (((uint16_t)(((uint16_t)(x))<<11U))&0x800UL)        /*!< PWMA_SM3CTRL.HALF Field                 */
#define PWMA_SM3CTRL_LDFQ_MASK                   (0xF000U)                                           /*!< PWMA_SM3CTRL.LDFQ Mask                  */
#define PWMA_SM3CTRL_LDFQ_SHIFT                  (12U)                                               /*!< PWMA_SM3CTRL.LDFQ Position              */
#define PWMA_SM3CTRL_LDFQ(x)                     (((uint16_t)(((uint16_t)(x))<<12U))&0xF000UL)       /*!< PWMA_SM3CTRL.LDFQ Field                 */
/* ------- SM3VAL0 Bit Fields                       ------ */
#define PWMA_SM3VAL0_VAL0_MASK                   (0xFFFFU)                                           /*!< PWMA_SM3VAL0.VAL0 Mask                  */
#define PWMA_SM3VAL0_VAL0_SHIFT                  (0U)                                                /*!< PWMA_SM3VAL0.VAL0 Position              */
#define PWMA_SM3VAL0_VAL0(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM3VAL0.VAL0 Field                 */
/* ------- SM3FRACVAL1 Bit Fields                   ------ */
#define PWMA_SM3FRACVAL1_FRACVAL1_MASK           (0xF800U)                                           /*!< PWMA_SM3FRACVAL1.FRACVAL1 Mask          */
#define PWMA_SM3FRACVAL1_FRACVAL1_SHIFT          (11U)                                               /*!< PWMA_SM3FRACVAL1.FRACVAL1 Position      */
#define PWMA_SM3FRACVAL1_FRACVAL1(x)             (((uint16_t)(((uint16_t)(x))<<11U))&0xF800UL)       /*!< PWMA_SM3FRACVAL1.FRACVAL1 Field         */
/* ------- SM3VAL1 Bit Fields                       ------ */
#define PWMA_SM3VAL1_VAL1_MASK                   (0xFFFFU)                                           /*!< PWMA_SM3VAL1.VAL1 Mask                  */
#define PWMA_SM3VAL1_VAL1_SHIFT                  (0U)                                                /*!< PWMA_SM3VAL1.VAL1 Position              */
#define PWMA_SM3VAL1_VAL1(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM3VAL1.VAL1 Field                 */
/* ------- SM3FRACVAL2 Bit Fields                   ------ */
#define PWMA_SM3FRACVAL2_FRACVAL2_MASK           (0xF800U)                                           /*!< PWMA_SM3FRACVAL2.FRACVAL2 Mask          */
#define PWMA_SM3FRACVAL2_FRACVAL2_SHIFT          (11U)                                               /*!< PWMA_SM3FRACVAL2.FRACVAL2 Position      */
#define PWMA_SM3FRACVAL2_FRACVAL2(x)             (((uint16_t)(((uint16_t)(x))<<11U))&0xF800UL)       /*!< PWMA_SM3FRACVAL2.FRACVAL2 Field         */
/* ------- SM3VAL2 Bit Fields                       ------ */
#define PWMA_SM3VAL2_VAL2_MASK                   (0xFFFFU)                                           /*!< PWMA_SM3VAL2.VAL2 Mask                  */
#define PWMA_SM3VAL2_VAL2_SHIFT                  (0U)                                                /*!< PWMA_SM3VAL2.VAL2 Position              */
#define PWMA_SM3VAL2_VAL2(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM3VAL2.VAL2 Field                 */
/* ------- SM3FRACVAL3 Bit Fields                   ------ */
#define PWMA_SM3FRACVAL3_FRACVAL3_MASK           (0xF800U)                                           /*!< PWMA_SM3FRACVAL3.FRACVAL3 Mask          */
#define PWMA_SM3FRACVAL3_FRACVAL3_SHIFT          (11U)                                               /*!< PWMA_SM3FRACVAL3.FRACVAL3 Position      */
#define PWMA_SM3FRACVAL3_FRACVAL3(x)             (((uint16_t)(((uint16_t)(x))<<11U))&0xF800UL)       /*!< PWMA_SM3FRACVAL3.FRACVAL3 Field         */
/* ------- SM3VAL3 Bit Fields                       ------ */
#define PWMA_SM3VAL3_VAL3_MASK                   (0xFFFFU)                                           /*!< PWMA_SM3VAL3.VAL3 Mask                  */
