podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV45F16.h
#define PWMA_SM3VAL3_VAL3_SHIFT                  (0U)                                                /*!< PWMA_SM3VAL3.VAL3 Position              */
#define PWMA_SM3VAL3_VAL3(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM3VAL3.VAL3 Field                 */
/* ------- SM3FRACVAL4 Bit Fields                   ------ */
#define PWMA_SM3FRACVAL4_FRACVAL4_MASK           (0xF800U)                                           /*!< PWMA_SM3FRACVAL4.FRACVAL4 Mask          */
#define PWMA_SM3FRACVAL4_FRACVAL4_SHIFT          (11U)                                               /*!< PWMA_SM3FRACVAL4.FRACVAL4 Position      */
#define PWMA_SM3FRACVAL4_FRACVAL4(x)             (((uint16_t)(((uint16_t)(x))<<11U))&0xF800UL)       /*!< PWMA_SM3FRACVAL4.FRACVAL4 Field         */
/* ------- SM3VAL4 Bit Fields                       ------ */
#define PWMA_SM3VAL4_VAL4_MASK                   (0xFFFFU)                                           /*!< PWMA_SM3VAL4.VAL4 Mask                  */
#define PWMA_SM3VAL4_VAL4_SHIFT                  (0U)                                                /*!< PWMA_SM3VAL4.VAL4 Position              */
#define PWMA_SM3VAL4_VAL4(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM3VAL4.VAL4 Field                 */
/* ------- SM3FRACVAL5 Bit Fields                   ------ */
#define PWMA_SM3FRACVAL5_FRACVAL5_MASK           (0xF800U)                                           /*!< PWMA_SM3FRACVAL5.FRACVAL5 Mask          */
#define PWMA_SM3FRACVAL5_FRACVAL5_SHIFT          (11U)                                               /*!< PWMA_SM3FRACVAL5.FRACVAL5 Position      */
#define PWMA_SM3FRACVAL5_FRACVAL5(x)             (((uint16_t)(((uint16_t)(x))<<11U))&0xF800UL)       /*!< PWMA_SM3FRACVAL5.FRACVAL5 Field         */
/* ------- SM3VAL5 Bit Fields                       ------ */
#define PWMA_SM3VAL5_VAL5_MASK                   (0xFFFFU)                                           /*!< PWMA_SM3VAL5.VAL5 Mask                  */
#define PWMA_SM3VAL5_VAL5_SHIFT                  (0U)                                                /*!< PWMA_SM3VAL5.VAL5 Position              */
#define PWMA_SM3VAL5_VAL5(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM3VAL5.VAL5 Field                 */
/* ------- SM3FRCTRL Bit Fields                     ------ */
#define PWMA_SM3FRCTRL_FRAC1_EN_MASK             (0x2U)                                              /*!< PWMA_SM3FRCTRL.FRAC1_EN Mask            */
#define PWMA_SM3FRCTRL_FRAC1_EN_SHIFT            (1U)                                                /*!< PWMA_SM3FRCTRL.FRAC1_EN Position        */
#define PWMA_SM3FRCTRL_FRAC1_EN(x)               (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< PWMA_SM3FRCTRL.FRAC1_EN Field           */
#define PWMA_SM3FRCTRL_FRAC23_EN_MASK            (0x4U)                                              /*!< PWMA_SM3FRCTRL.FRAC23_EN Mask           */
#define PWMA_SM3FRCTRL_FRAC23_EN_SHIFT           (2U)                                                /*!< PWMA_SM3FRCTRL.FRAC23_EN Position       */
#define PWMA_SM3FRCTRL_FRAC23_EN(x)              (((uint16_t)(((uint16_t)(x))<<2U))&0x4UL)           /*!< PWMA_SM3FRCTRL.FRAC23_EN Field          */
#define PWMA_SM3FRCTRL_FRAC45_EN_MASK            (0x10U)                                             /*!< PWMA_SM3FRCTRL.FRAC45_EN Mask           */
#define PWMA_SM3FRCTRL_FRAC45_EN_SHIFT           (4U)                                                /*!< PWMA_SM3FRCTRL.FRAC45_EN Position       */
#define PWMA_SM3FRCTRL_FRAC45_EN(x)              (((uint16_t)(((uint16_t)(x))<<4U))&0x10UL)          /*!< PWMA_SM3FRCTRL.FRAC45_EN Field          */
#define PWMA_SM3FRCTRL_FRAC_PU_MASK              (0x100U)                                            /*!< PWMA_SM3FRCTRL.FRAC_PU Mask             */
#define PWMA_SM3FRCTRL_FRAC_PU_SHIFT             (8U)                                                /*!< PWMA_SM3FRCTRL.FRAC_PU Position         */
#define PWMA_SM3FRCTRL_FRAC_PU(x)                (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< PWMA_SM3FRCTRL.FRAC_PU Field            */
#define PWMA_SM3FRCTRL_TEST_MASK                 (0x8000U)                                           /*!< PWMA_SM3FRCTRL.TEST Mask                */
#define PWMA_SM3FRCTRL_TEST_SHIFT                (15U)                                               /*!< PWMA_SM3FRCTRL.TEST Position            */
#define PWMA_SM3FRCTRL_TEST(x)                   (((uint16_t)(((uint16_t)(x))<<15U))&0x8000UL)       /*!< PWMA_SM3FRCTRL.TEST Field               */
/* ------- SM3OCTRL Bit Fields                      ------ */
#define PWMA_SM3OCTRL_PWMXFS_MASK                (0x3U)                                              /*!< PWMA_SM3OCTRL.PWMXFS Mask               */
#define PWMA_SM3OCTRL_PWMXFS_SHIFT               (0U)                                                /*!< PWMA_SM3OCTRL.PWMXFS Position           */
#define PWMA_SM3OCTRL_PWMXFS(x)                  (((uint16_t)(((uint16_t)(x))<<0U))&0x3UL)           /*!< PWMA_SM3OCTRL.PWMXFS Field              */
#define PWMA_SM3OCTRL_PWMBFS_MASK                (0xCU)                                              /*!< PWMA_SM3OCTRL.PWMBFS Mask               */
#define PWMA_SM3OCTRL_PWMBFS_SHIFT               (2U)                                                /*!< PWMA_SM3OCTRL.PWMBFS Position           */
#define PWMA_SM3OCTRL_PWMBFS(x)                  (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< PWMA_SM3OCTRL.PWMBFS Field              */
#define PWMA_SM3OCTRL_PWMAFS_MASK                (0x30U)                                             /*!< PWMA_SM3OCTRL.PWMAFS Mask               */
#define PWMA_SM3OCTRL_PWMAFS_SHIFT               (4U)                                                /*!< PWMA_SM3OCTRL.PWMAFS Position           */
#define PWMA_SM3OCTRL_PWMAFS(x)                  (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< PWMA_SM3OCTRL.PWMAFS Field              */
#define PWMA_SM3OCTRL_POLX_MASK                  (0x100U)                                            /*!< PWMA_SM3OCTRL.POLX Mask                 */
#define PWMA_SM3OCTRL_POLX_SHIFT                 (8U)                                                /*!< PWMA_SM3OCTRL.POLX Position             */
#define PWMA_SM3OCTRL_POLX(x)                    (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< PWMA_SM3OCTRL.POLX Field                */
#define PWMA_SM3OCTRL_POLB_MASK                  (0x200U)                                            /*!< PWMA_SM3OCTRL.POLB Mask                 */
#define PWMA_SM3OCTRL_POLB_SHIFT                 (9U)                                                /*!< PWMA_SM3OCTRL.POLB Position             */
#define PWMA_SM3OCTRL_POLB(x)                    (((uint16_t)(((uint16_t)(x))<<9U))&0x200UL)         /*!< PWMA_SM3OCTRL.POLB Field                */
#define PWMA_SM3OCTRL_POLA_MASK                  (0x400U)                                            /*!< PWMA_SM3OCTRL.POLA Mask                 */
#define PWMA_SM3OCTRL_POLA_SHIFT                 (10U)                                               /*!< PWMA_SM3OCTRL.POLA Position             */
#define PWMA_SM3OCTRL_POLA(x)                    (((uint16_t)(((uint16_t)(x))<<10U))&0x400UL)        /*!< PWMA_SM3OCTRL.POLA Field                */
#define PWMA_SM3OCTRL_PWMX_IN_MASK               (0x2000U)                                           /*!< PWMA_SM3OCTRL.PWMX_IN Mask              */
#define PWMA_SM3OCTRL_PWMX_IN_SHIFT              (13U)                                               /*!< PWMA_SM3OCTRL.PWMX_IN Position          */
#define PWMA_SM3OCTRL_PWMX_IN(x)                 (((uint16_t)(((uint16_t)(x))<<13U))&0x2000UL)       /*!< PWMA_SM3OCTRL.PWMX_IN Field             */
#define PWMA_SM3OCTRL_PWMB_IN_MASK               (0x4000U)                                           /*!< PWMA_SM3OCTRL.PWMB_IN Mask              */
#define PWMA_SM3OCTRL_PWMB_IN_SHIFT              (14U)                                               /*!< PWMA_SM3OCTRL.PWMB_IN Position          */
#define PWMA_SM3OCTRL_PWMB_IN(x)                 (((uint16_t)(((uint16_t)(x))<<14U))&0x4000UL)       /*!< PWMA_SM3OCTRL.PWMB_IN Field             */
#define PWMA_SM3OCTRL_PWMA_IN_MASK               (0x8000U)                                           /*!< PWMA_SM3OCTRL.PWMA_IN Mask              */
#define PWMA_SM3OCTRL_PWMA_IN_SHIFT              (15U)                                               /*!< PWMA_SM3OCTRL.PWMA_IN Position          */
#define PWMA_SM3OCTRL_PWMA_IN(x)                 (((uint16_t)(((uint16_t)(x))<<15U))&0x8000UL)       /*!< PWMA_SM3OCTRL.PWMA_IN Field             */
/* ------- SM3STS Bit Fields                        ------ */
#define PWMA_SM3STS_CMPF_MASK                    (0x3FU)                                             /*!< PWMA_SM3STS.CMPF Mask                   */
#define PWMA_SM3STS_CMPF_SHIFT                   (0U)                                                /*!< PWMA_SM3STS.CMPF Position               */
#define PWMA_SM3STS_CMPF(x)                      (((uint16_t)(((uint16_t)(x))<<0U))&0x3FUL)          /*!< PWMA_SM3STS.CMPF Field                  */
#define PWMA_SM3STS_CFX0_MASK                    (0x40U)                                             /*!< PWMA_SM3STS.CFX0 Mask                   */
#define PWMA_SM3STS_CFX0_SHIFT                   (6U)                                                /*!< PWMA_SM3STS.CFX0 Position               */
#define PWMA_SM3STS_CFX0(x)                      (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< PWMA_SM3STS.CFX0 Field                  */
#define PWMA_SM3STS_CFX1_MASK                    (0x80U)                                             /*!< PWMA_SM3STS.CFX1 Mask                   */
#define PWMA_SM3STS_CFX1_SHIFT                   (7U)                                                /*!< PWMA_SM3STS.CFX1 Position               */
#define PWMA_SM3STS_CFX1(x)                      (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< PWMA_SM3STS.CFX1 Field                  */
#define PWMA_SM3STS_CFB0_MASK                    (0x100U)                                            /*!< PWMA_SM3STS.CFB0 Mask                   */
#define PWMA_SM3STS_CFB0_SHIFT                   (8U)                                                /*!< PWMA_SM3STS.CFB0 Position               */
#define PWMA_SM3STS_CFB0(x)                      (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< PWMA_SM3STS.CFB0 Field                  */
#define PWMA_SM3STS_CFB1_MASK                    (0x200U)                                            /*!< PWMA_SM3STS.CFB1 Mask                   */
#define PWMA_SM3STS_CFB1_SHIFT                   (9U)                                                /*!< PWMA_SM3STS.CFB1 Position               */
#define PWMA_SM3STS_CFB1(x)                      (((uint16_t)(((uint16_t)(x))<<9U))&0x200UL)         /*!< PWMA_SM3STS.CFB1 Field                  */
#define PWMA_SM3STS_CFA0_MASK                    (0x400U)                                            /*!< PWMA_SM3STS.CFA0 Mask                   */
#define PWMA_SM3STS_CFA0_SHIFT                   (10U)                                               /*!< PWMA_SM3STS.CFA0 Position               */
#define PWMA_SM3STS_CFA0(x)                      (((uint16_t)(((uint16_t)(x))<<10U))&0x400UL)        /*!< PWMA_SM3STS.CFA0 Field                  */
#define PWMA_SM3STS_CFA1_MASK                    (0x800U)                                            /*!< PWMA_SM3STS.CFA1 Mask                   */
#define PWMA_SM3STS_CFA1_SHIFT                   (11U)                                               /*!< PWMA_SM3STS.CFA1 Position               */
#define PWMA_SM3STS_CFA1(x)                      (((uint16_t)(((uint16_t)(x))<<11U))&0x800UL)        /*!< PWMA_SM3STS.CFA1 Field                  */
#define PWMA_SM3STS_RF_MASK                      (0x1000U)                                           /*!< PWMA_SM3STS.RF Mask                     */
#define PWMA_SM3STS_RF_SHIFT                     (12U)                                               /*!< PWMA_SM3STS.RF Position                 */
#define PWMA_SM3STS_RF(x)                        (((uint16_t)(((uint16_t)(x))<<12U))&0x1000UL)       /*!< PWMA_SM3STS.RF Field                    */
#define PWMA_SM3STS_REF_MASK                     (0x2000U)                                           /*!< PWMA_SM3STS.REF Mask                    */
#define PWMA_SM3STS_REF_SHIFT                    (13U)                                               /*!< PWMA_SM3STS.REF Position                */
#define PWMA_SM3STS_REF(x)                       (((uint16_t)(((uint16_t)(x))<<13U))&0x2000UL)       /*!< PWMA_SM3STS.REF Field                   */
#define PWMA_SM3STS_RUF_MASK                     (0x4000U)                                           /*!< PWMA_SM3STS.RUF Mask                    */
#define PWMA_SM3STS_RUF_SHIFT                    (14U)                                               /*!< PWMA_SM3STS.RUF Position                */
#define PWMA_SM3STS_RUF(x)                       (((uint16_t)(((uint16_t)(x))<<14U))&0x4000UL)       /*!< PWMA_SM3STS.RUF Field                   */
/* ------- SM3INTEN Bit Fields                      ------ */
#define PWMA_SM3INTEN_CMPIE_MASK                 (0x3FU)                                             /*!< PWMA_SM3INTEN.CMPIE Mask                */
#define PWMA_SM3INTEN_CMPIE_SHIFT                (0U)                                                /*!< PWMA_SM3INTEN.CMPIE Position            */
#define PWMA_SM3INTEN_CMPIE(x)                   (((uint16_t)(((uint16_t)(x))<<0U))&0x3FUL)          /*!< PWMA_SM3INTEN.CMPIE Field               */
#define PWMA_SM3INTEN_CX0IE_MASK                 (0x40U)                                             /*!< PWMA_SM3INTEN.CX0IE Mask                */
#define PWMA_SM3INTEN_CX0IE_SHIFT                (6U)                                                /*!< PWMA_SM3INTEN.CX0IE Position            */
#define PWMA_SM3INTEN_CX0IE(x)                   (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< PWMA_SM3INTEN.CX0IE Field               */
#define PWMA_SM3INTEN_CX1IE_MASK                 (0x80U)                                             /*!< PWMA_SM3INTEN.CX1IE Mask                */
#define PWMA_SM3INTEN_CX1IE_SHIFT                (7U)                                                /*!< PWMA_SM3INTEN.CX1IE Position            */
#define PWMA_SM3INTEN_CX1IE(x)                   (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< PWMA_SM3INTEN.CX1IE Field               */
#define PWMA_SM3INTEN_CB0IE_MASK                 (0x100U)                                            /*!< PWMA_SM3INTEN.CB0IE Mask                */
#define PWMA_SM3INTEN_CB0IE_SHIFT                (8U)                                                /*!< PWMA_SM3INTEN.CB0IE Position            */
#define PWMA_SM3INTEN_CB0IE(x)                   (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< PWMA_SM3INTEN.CB0IE Field               */
#define PWMA_SM3INTEN_CB1IE_MASK                 (0x200U)                                            /*!< PWMA_SM3INTEN.CB1IE Mask                */
#define PWMA_SM3INTEN_CB1IE_SHIFT                (9U)                                                /*!< PWMA_SM3INTEN.CB1IE Position            */
#define PWMA_SM3INTEN_CB1IE(x)                   (((uint16_t)(((uint16_t)(x))<<9U))&0x200UL)         /*!< PWMA_SM3INTEN.CB1IE Field               */
#define PWMA_SM3INTEN_CA0IE_MASK                 (0x400U)                                            /*!< PWMA_SM3INTEN.CA0IE Mask                */
#define PWMA_SM3INTEN_CA0IE_SHIFT                (10U)                                               /*!< PWMA_SM3INTEN.CA0IE Position            */
#define PWMA_SM3INTEN_CA0IE(x)                   (((uint16_t)(((uint16_t)(x))<<10U))&0x400UL)        /*!< PWMA_SM3INTEN.CA0IE Field               */
#define PWMA_SM3INTEN_CA1IE_MASK                 (0x800U)                                            /*!< PWMA_SM3INTEN.CA1IE Mask                */
#define PWMA_SM3INTEN_CA1IE_SHIFT                (11U)                                               /*!< PWMA_SM3INTEN.CA1IE Position            */
#define PWMA_SM3INTEN_CA1IE(x)                   (((uint16_t)(((uint16_t)(x))<<11U))&0x800UL)        /*!< PWMA_SM3INTEN.CA1IE Field               */
#define PWMA_SM3INTEN_RIE_MASK                   (0x1000U)                                           /*!< PWMA_SM3INTEN.RIE Mask                  */
#define PWMA_SM3INTEN_RIE_SHIFT                  (12U)                                               /*!< PWMA_SM3INTEN.RIE Position              */
#define PWMA_SM3INTEN_RIE(x)                     (((uint16_t)(((uint16_t)(x))<<12U))&0x1000UL)       /*!< PWMA_SM3INTEN.RIE Field                 */
#define PWMA_SM3INTEN_REIE_MASK                  (0x2000U)                                           /*!< PWMA_SM3INTEN.REIE Mask                 */
#define PWMA_SM3INTEN_REIE_SHIFT                 (13U)                                               /*!< PWMA_SM3INTEN.REIE Position             */
#define PWMA_SM3INTEN_REIE(x)                    (((uint16_t)(((uint16_t)(x))<<13U))&0x2000UL)       /*!< PWMA_SM3INTEN.REIE Field                */
/* ------- SM3DMAEN Bit Fields                      ------ */
#define PWMA_SM3DMAEN_CX0DE_MASK                 (0x1U)                                              /*!< PWMA_SM3DMAEN.CX0DE Mask                */
#define PWMA_SM3DMAEN_CX0DE_SHIFT                (0U)                                                /*!< PWMA_SM3DMAEN.CX0DE Position            */
#define PWMA_SM3DMAEN_CX0DE(x)                   (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< PWMA_SM3DMAEN.CX0DE Field               */
#define PWMA_SM3DMAEN_CX1DE_MASK                 (0x2U)                                              /*!< PWMA_SM3DMAEN.CX1DE Mask                */
#define PWMA_SM3DMAEN_CX1DE_SHIFT                (1U)                                                /*!< PWMA_SM3DMAEN.CX1DE Position            */
#define PWMA_SM3DMAEN_CX1DE(x)                   (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< PWMA_SM3DMAEN.CX1DE Field               */
#define PWMA_SM3DMAEN_CB0DE_MASK                 (0x4U)                                              /*!< PWMA_SM3DMAEN.CB0DE Mask                */
#define PWMA_SM3DMAEN_CB0DE_SHIFT                (2U)                                                /*!< PWMA_SM3DMAEN.CB0DE Position            */
#define PWMA_SM3DMAEN_CB0DE(x)                   (((uint16_t)(((uint16_t)(x))<<2U))&0x4UL)           /*!< PWMA_SM3DMAEN.CB0DE Field               */
#define PWMA_SM3DMAEN_CB1DE_MASK                 (0x8U)                                              /*!< PWMA_SM3DMAEN.CB1DE Mask                */
#define PWMA_SM3DMAEN_CB1DE_SHIFT                (3U)                                                /*!< PWMA_SM3DMAEN.CB1DE Position            */
#define PWMA_SM3DMAEN_CB1DE(x)                   (((uint16_t)(((uint16_t)(x))<<3U))&0x8UL)           /*!< PWMA_SM3DMAEN.CB1DE Field               */
#define PWMA_SM3DMAEN_CA0DE_MASK                 (0x10U)                                             /*!< PWMA_SM3DMAEN.CA0DE Mask                */
#define PWMA_SM3DMAEN_CA0DE_SHIFT                (4U)                                                /*!< PWMA_SM3DMAEN.CA0DE Position            */
#define PWMA_SM3DMAEN_CA0DE(x)                   (((uint16_t)(((uint16_t)(x))<<4U))&0x10UL)          /*!< PWMA_SM3DMAEN.CA0DE Field               */
#define PWMA_SM3DMAEN_CA1DE_MASK                 (0x20U)                                             /*!< PWMA_SM3DMAEN.CA1DE Mask                */
#define PWMA_SM3DMAEN_CA1DE_SHIFT                (5U)                                                /*!< PWMA_SM3DMAEN.CA1DE Position            */
#define PWMA_SM3DMAEN_CA1DE(x)                   (((uint16_t)(((uint16_t)(x))<<5U))&0x20UL)          /*!< PWMA_SM3DMAEN.CA1DE Field               */
#define PWMA_SM3DMAEN_CAPTDE_MASK                (0xC0U)                                             /*!< PWMA_SM3DMAEN.CAPTDE Mask               */
#define PWMA_SM3DMAEN_CAPTDE_SHIFT               (6U)                                                /*!< PWMA_SM3DMAEN.CAPTDE Position           */
#define PWMA_SM3DMAEN_CAPTDE(x)                  (((uint16_t)(((uint16_t)(x))<<6U))&0xC0UL)          /*!< PWMA_SM3DMAEN.CAPTDE Field              */
#define PWMA_SM3DMAEN_FAND_MASK                  (0x100U)                                            /*!< PWMA_SM3DMAEN.FAND Mask                 */
#define PWMA_SM3DMAEN_FAND_SHIFT                 (8U)                                                /*!< PWMA_SM3DMAEN.FAND Position             */
#define PWMA_SM3DMAEN_FAND(x)                    (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< PWMA_SM3DMAEN.FAND Field                */
#define PWMA_SM3DMAEN_VALDE_MASK                 (0x200U)                                            /*!< PWMA_SM3DMAEN.VALDE Mask                */
#define PWMA_SM3DMAEN_VALDE_SHIFT                (9U)                                                /*!< PWMA_SM3DMAEN.VALDE Position            */
#define PWMA_SM3DMAEN_VALDE(x)                   (((uint16_t)(((uint16_t)(x))<<9U))&0x200UL)         /*!< PWMA_SM3DMAEN.VALDE Field               */
/* ------- SM3TCTRL Bit Fields                      ------ */
#define PWMA_SM3TCTRL_OUT_TRIG_EN_MASK           (0x3FU)                                             /*!< PWMA_SM3TCTRL.OUT_TRIG_EN Mask          */
#define PWMA_SM3TCTRL_OUT_TRIG_EN_SHIFT          (0U)                                                /*!< PWMA_SM3TCTRL.OUT_TRIG_EN Position      */
#define PWMA_SM3TCTRL_OUT_TRIG_EN(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0x3FUL)          /*!< PWMA_SM3TCTRL.OUT_TRIG_EN Field         */
#define PWMA_SM3TCTRL_PWBOT1_MASK                (0x4000U)                                           /*!< PWMA_SM3TCTRL.PWBOT1 Mask               */
#define PWMA_SM3TCTRL_PWBOT1_SHIFT               (14U)                                               /*!< PWMA_SM3TCTRL.PWBOT1 Position           */
#define PWMA_SM3TCTRL_PWBOT1(x)                  (((uint16_t)(((uint16_t)(x))<<14U))&0x4000UL)       /*!< PWMA_SM3TCTRL.PWBOT1 Field              */
#define PWMA_SM3TCTRL_PWAOT0_MASK                (0x8000U)                                           /*!< PWMA_SM3TCTRL.PWAOT0 Mask               */
#define PWMA_SM3TCTRL_PWAOT0_SHIFT               (15U)                                               /*!< PWMA_SM3TCTRL.PWAOT0 Position           */
#define PWMA_SM3TCTRL_PWAOT0(x)                  (((uint16_t)(((uint16_t)(x))<<15U))&0x8000UL)       /*!< PWMA_SM3TCTRL.PWAOT0 Field              */
/* ------- SM3DISMAP0 Bit Fields                    ------ */
#define PWMA_SM3DISMAP0_DIS0A_MASK               (0xFU)                                              /*!< PWMA_SM3DISMAP0.DIS0A Mask              */
#define PWMA_SM3DISMAP0_DIS0A_SHIFT              (0U)                                                /*!< PWMA_SM3DISMAP0.DIS0A Position          */
#define PWMA_SM3DISMAP0_DIS0A(x)                 (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM3DISMAP0.DIS0A Field             */
#define PWMA_SM3DISMAP0_DIS0B_MASK               (0xF0U)                                             /*!< PWMA_SM3DISMAP0.DIS0B Mask              */
#define PWMA_SM3DISMAP0_DIS0B_SHIFT              (4U)                                                /*!< PWMA_SM3DISMAP0.DIS0B Position          */
#define PWMA_SM3DISMAP0_DIS0B(x)                 (((uint16_t)(((uint16_t)(x))<<4U))&0xF0UL)          /*!< PWMA_SM3DISMAP0.DIS0B Field             */
#define PWMA_SM3DISMAP0_DIS0X_MASK               (0xF00U)                                            /*!< PWMA_SM3DISMAP0.DIS0X Mask              */
