podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV45F16.h
#define PWMA_SM3DISMAP0_DIS0X_SHIFT              (8U)                                                /*!< PWMA_SM3DISMAP0.DIS0X Position          */
#define PWMA_SM3DISMAP0_DIS0X(x)                 (((uint16_t)(((uint16_t)(x))<<8U))&0xF00UL)         /*!< PWMA_SM3DISMAP0.DIS0X Field             */
/* ------- SM3DTCNT Bit Fields                      ------ */
#define PWMA_SM3DTCNT_DTCNT0_MASK                (0x7FFU)                                            /*!< PWMA_SM3DTCNT.DTCNT0 Mask               */
#define PWMA_SM3DTCNT_DTCNT0_SHIFT               (0U)                                                /*!< PWMA_SM3DTCNT.DTCNT0 Position           */
#define PWMA_SM3DTCNT_DTCNT0(x)                  (((uint16_t)(((uint16_t)(x))<<0U))&0x7FFUL)         /*!< PWMA_SM3DTCNT.DTCNT0 Field              */
/* ------- SM3CAPTCTRLA Bit Fields                  ------ */
#define PWMA_SM3CAPTCTRLA_ARMA_MASK              (0x1U)                                              /*!< PWMA_SM3CAPTCTRLA.ARMA Mask             */
#define PWMA_SM3CAPTCTRLA_ARMA_SHIFT             (0U)                                                /*!< PWMA_SM3CAPTCTRLA.ARMA Position         */
#define PWMA_SM3CAPTCTRLA_ARMA(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< PWMA_SM3CAPTCTRLA.ARMA Field            */
#define PWMA_SM3CAPTCTRLA_ONESHOTA_MASK          (0x2U)                                              /*!< PWMA_SM3CAPTCTRLA.ONESHOTA Mask         */
#define PWMA_SM3CAPTCTRLA_ONESHOTA_SHIFT         (1U)                                                /*!< PWMA_SM3CAPTCTRLA.ONESHOTA Position     */
#define PWMA_SM3CAPTCTRLA_ONESHOTA(x)            (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< PWMA_SM3CAPTCTRLA.ONESHOTA Field        */
#define PWMA_SM3CAPTCTRLA_EDGA0_MASK             (0xCU)                                              /*!< PWMA_SM3CAPTCTRLA.EDGA0 Mask            */
#define PWMA_SM3CAPTCTRLA_EDGA0_SHIFT            (2U)                                                /*!< PWMA_SM3CAPTCTRLA.EDGA0 Position        */
#define PWMA_SM3CAPTCTRLA_EDGA0(x)               (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< PWMA_SM3CAPTCTRLA.EDGA0 Field           */
#define PWMA_SM3CAPTCTRLA_EDGA1_MASK             (0x30U)                                             /*!< PWMA_SM3CAPTCTRLA.EDGA1 Mask            */
#define PWMA_SM3CAPTCTRLA_EDGA1_SHIFT            (4U)                                                /*!< PWMA_SM3CAPTCTRLA.EDGA1 Position        */
#define PWMA_SM3CAPTCTRLA_EDGA1(x)               (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< PWMA_SM3CAPTCTRLA.EDGA1 Field           */
#define PWMA_SM3CAPTCTRLA_INP_SELA_MASK          (0x40U)                                             /*!< PWMA_SM3CAPTCTRLA.INP_SELA Mask         */
#define PWMA_SM3CAPTCTRLA_INP_SELA_SHIFT         (6U)                                                /*!< PWMA_SM3CAPTCTRLA.INP_SELA Position     */
#define PWMA_SM3CAPTCTRLA_INP_SELA(x)            (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< PWMA_SM3CAPTCTRLA.INP_SELA Field        */
#define PWMA_SM3CAPTCTRLA_EDGCNTA_EN_MASK        (0x80U)                                             /*!< PWMA_SM3CAPTCTRLA.EDGCNTA_EN Mask       */
#define PWMA_SM3CAPTCTRLA_EDGCNTA_EN_SHIFT       (7U)                                                /*!< PWMA_SM3CAPTCTRLA.EDGCNTA_EN Position   */
#define PWMA_SM3CAPTCTRLA_EDGCNTA_EN(x)          (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< PWMA_SM3CAPTCTRLA.EDGCNTA_EN Field      */
#define PWMA_SM3CAPTCTRLA_CFAWM_MASK             (0x300U)                                            /*!< PWMA_SM3CAPTCTRLA.CFAWM Mask            */
#define PWMA_SM3CAPTCTRLA_CFAWM_SHIFT            (8U)                                                /*!< PWMA_SM3CAPTCTRLA.CFAWM Position        */
#define PWMA_SM3CAPTCTRLA_CFAWM(x)               (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< PWMA_SM3CAPTCTRLA.CFAWM Field           */
#define PWMA_SM3CAPTCTRLA_CA0CNT_MASK            (0x1C00U)                                           /*!< PWMA_SM3CAPTCTRLA.CA0CNT Mask           */
#define PWMA_SM3CAPTCTRLA_CA0CNT_SHIFT           (10U)                                               /*!< PWMA_SM3CAPTCTRLA.CA0CNT Position       */
#define PWMA_SM3CAPTCTRLA_CA0CNT(x)              (((uint16_t)(((uint16_t)(x))<<10U))&0x1C00UL)       /*!< PWMA_SM3CAPTCTRLA.CA0CNT Field          */
#define PWMA_SM3CAPTCTRLA_CA1CNT_MASK            (0xE000U)                                           /*!< PWMA_SM3CAPTCTRLA.CA1CNT Mask           */
#define PWMA_SM3CAPTCTRLA_CA1CNT_SHIFT           (13U)                                               /*!< PWMA_SM3CAPTCTRLA.CA1CNT Position       */
#define PWMA_SM3CAPTCTRLA_CA1CNT(x)              (((uint16_t)(((uint16_t)(x))<<13U))&0xE000UL)       /*!< PWMA_SM3CAPTCTRLA.CA1CNT Field          */
/* ------- SM3CAPTCOMPA Bit Fields                  ------ */
#define PWMA_SM3CAPTCOMPA_EDGCMPA_MASK           (0xFFU)                                             /*!< PWMA_SM3CAPTCOMPA.EDGCMPA Mask          */
#define PWMA_SM3CAPTCOMPA_EDGCMPA_SHIFT          (0U)                                                /*!< PWMA_SM3CAPTCOMPA.EDGCMPA Position      */
#define PWMA_SM3CAPTCOMPA_EDGCMPA(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFFUL)          /*!< PWMA_SM3CAPTCOMPA.EDGCMPA Field         */
#define PWMA_SM3CAPTCOMPA_EDGCNTA_MASK           (0xFF00U)                                           /*!< PWMA_SM3CAPTCOMPA.EDGCNTA Mask          */
#define PWMA_SM3CAPTCOMPA_EDGCNTA_SHIFT          (8U)                                                /*!< PWMA_SM3CAPTCOMPA.EDGCNTA Position      */
#define PWMA_SM3CAPTCOMPA_EDGCNTA(x)             (((uint16_t)(((uint16_t)(x))<<8U))&0xFF00UL)        /*!< PWMA_SM3CAPTCOMPA.EDGCNTA Field         */
/* ------- SM3CAPTCTRLB Bit Fields                  ------ */
#define PWMA_SM3CAPTCTRLB_ARMB_MASK              (0x1U)                                              /*!< PWMA_SM3CAPTCTRLB.ARMB Mask             */
#define PWMA_SM3CAPTCTRLB_ARMB_SHIFT             (0U)                                                /*!< PWMA_SM3CAPTCTRLB.ARMB Position         */
#define PWMA_SM3CAPTCTRLB_ARMB(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< PWMA_SM3CAPTCTRLB.ARMB Field            */
#define PWMA_SM3CAPTCTRLB_ONESHOTB_MASK          (0x2U)                                              /*!< PWMA_SM3CAPTCTRLB.ONESHOTB Mask         */
#define PWMA_SM3CAPTCTRLB_ONESHOTB_SHIFT         (1U)                                                /*!< PWMA_SM3CAPTCTRLB.ONESHOTB Position     */
#define PWMA_SM3CAPTCTRLB_ONESHOTB(x)            (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< PWMA_SM3CAPTCTRLB.ONESHOTB Field        */
#define PWMA_SM3CAPTCTRLB_EDGB0_MASK             (0xCU)                                              /*!< PWMA_SM3CAPTCTRLB.EDGB0 Mask            */
#define PWMA_SM3CAPTCTRLB_EDGB0_SHIFT            (2U)                                                /*!< PWMA_SM3CAPTCTRLB.EDGB0 Position        */
#define PWMA_SM3CAPTCTRLB_EDGB0(x)               (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< PWMA_SM3CAPTCTRLB.EDGB0 Field           */
#define PWMA_SM3CAPTCTRLB_EDGB1_MASK             (0x30U)                                             /*!< PWMA_SM3CAPTCTRLB.EDGB1 Mask            */
#define PWMA_SM3CAPTCTRLB_EDGB1_SHIFT            (4U)                                                /*!< PWMA_SM3CAPTCTRLB.EDGB1 Position        */
#define PWMA_SM3CAPTCTRLB_EDGB1(x)               (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< PWMA_SM3CAPTCTRLB.EDGB1 Field           */
#define PWMA_SM3CAPTCTRLB_INP_SELB_MASK          (0x40U)                                             /*!< PWMA_SM3CAPTCTRLB.INP_SELB Mask         */
#define PWMA_SM3CAPTCTRLB_INP_SELB_SHIFT         (6U)                                                /*!< PWMA_SM3CAPTCTRLB.INP_SELB Position     */
#define PWMA_SM3CAPTCTRLB_INP_SELB(x)            (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< PWMA_SM3CAPTCTRLB.INP_SELB Field        */
#define PWMA_SM3CAPTCTRLB_EDGCNTB_EN_MASK        (0x80U)                                             /*!< PWMA_SM3CAPTCTRLB.EDGCNTB_EN Mask       */
#define PWMA_SM3CAPTCTRLB_EDGCNTB_EN_SHIFT       (7U)                                                /*!< PWMA_SM3CAPTCTRLB.EDGCNTB_EN Position   */
#define PWMA_SM3CAPTCTRLB_EDGCNTB_EN(x)          (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< PWMA_SM3CAPTCTRLB.EDGCNTB_EN Field      */
#define PWMA_SM3CAPTCTRLB_CFBWM_MASK             (0x300U)                                            /*!< PWMA_SM3CAPTCTRLB.CFBWM Mask            */
#define PWMA_SM3CAPTCTRLB_CFBWM_SHIFT            (8U)                                                /*!< PWMA_SM3CAPTCTRLB.CFBWM Position        */
#define PWMA_SM3CAPTCTRLB_CFBWM(x)               (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< PWMA_SM3CAPTCTRLB.CFBWM Field           */
#define PWMA_SM3CAPTCTRLB_CB0CNT_MASK            (0x1C00U)                                           /*!< PWMA_SM3CAPTCTRLB.CB0CNT Mask           */
#define PWMA_SM3CAPTCTRLB_CB0CNT_SHIFT           (10U)                                               /*!< PWMA_SM3CAPTCTRLB.CB0CNT Position       */
#define PWMA_SM3CAPTCTRLB_CB0CNT(x)              (((uint16_t)(((uint16_t)(x))<<10U))&0x1C00UL)       /*!< PWMA_SM3CAPTCTRLB.CB0CNT Field          */
#define PWMA_SM3CAPTCTRLB_CB1CNT_MASK            (0xE000U)                                           /*!< PWMA_SM3CAPTCTRLB.CB1CNT Mask           */
#define PWMA_SM3CAPTCTRLB_CB1CNT_SHIFT           (13U)                                               /*!< PWMA_SM3CAPTCTRLB.CB1CNT Position       */
#define PWMA_SM3CAPTCTRLB_CB1CNT(x)              (((uint16_t)(((uint16_t)(x))<<13U))&0xE000UL)       /*!< PWMA_SM3CAPTCTRLB.CB1CNT Field          */
/* ------- SM3CAPTCOMPB Bit Fields                  ------ */
#define PWMA_SM3CAPTCOMPB_EDGCMPB_MASK           (0xFFU)                                             /*!< PWMA_SM3CAPTCOMPB.EDGCMPB Mask          */
#define PWMA_SM3CAPTCOMPB_EDGCMPB_SHIFT          (0U)                                                /*!< PWMA_SM3CAPTCOMPB.EDGCMPB Position      */
#define PWMA_SM3CAPTCOMPB_EDGCMPB(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFFUL)          /*!< PWMA_SM3CAPTCOMPB.EDGCMPB Field         */
#define PWMA_SM3CAPTCOMPB_EDGCNTB_MASK           (0xFF00U)                                           /*!< PWMA_SM3CAPTCOMPB.EDGCNTB Mask          */
#define PWMA_SM3CAPTCOMPB_EDGCNTB_SHIFT          (8U)                                                /*!< PWMA_SM3CAPTCOMPB.EDGCNTB Position      */
#define PWMA_SM3CAPTCOMPB_EDGCNTB(x)             (((uint16_t)(((uint16_t)(x))<<8U))&0xFF00UL)        /*!< PWMA_SM3CAPTCOMPB.EDGCNTB Field         */
/* ------- SM3CAPTCTRLX Bit Fields                  ------ */
#define PWMA_SM3CAPTCTRLX_ARMX_MASK              (0x1U)                                              /*!< PWMA_SM3CAPTCTRLX.ARMX Mask             */
#define PWMA_SM3CAPTCTRLX_ARMX_SHIFT             (0U)                                                /*!< PWMA_SM3CAPTCTRLX.ARMX Position         */
#define PWMA_SM3CAPTCTRLX_ARMX(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< PWMA_SM3CAPTCTRLX.ARMX Field            */
#define PWMA_SM3CAPTCTRLX_ONESHOTX_MASK          (0x2U)                                              /*!< PWMA_SM3CAPTCTRLX.ONESHOTX Mask         */
#define PWMA_SM3CAPTCTRLX_ONESHOTX_SHIFT         (1U)                                                /*!< PWMA_SM3CAPTCTRLX.ONESHOTX Position     */
#define PWMA_SM3CAPTCTRLX_ONESHOTX(x)            (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< PWMA_SM3CAPTCTRLX.ONESHOTX Field        */
#define PWMA_SM3CAPTCTRLX_EDGX0_MASK             (0xCU)                                              /*!< PWMA_SM3CAPTCTRLX.EDGX0 Mask            */
#define PWMA_SM3CAPTCTRLX_EDGX0_SHIFT            (2U)                                                /*!< PWMA_SM3CAPTCTRLX.EDGX0 Position        */
#define PWMA_SM3CAPTCTRLX_EDGX0(x)               (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< PWMA_SM3CAPTCTRLX.EDGX0 Field           */
#define PWMA_SM3CAPTCTRLX_EDGX1_MASK             (0x30U)                                             /*!< PWMA_SM3CAPTCTRLX.EDGX1 Mask            */
#define PWMA_SM3CAPTCTRLX_EDGX1_SHIFT            (4U)                                                /*!< PWMA_SM3CAPTCTRLX.EDGX1 Position        */
#define PWMA_SM3CAPTCTRLX_EDGX1(x)               (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< PWMA_SM3CAPTCTRLX.EDGX1 Field           */
#define PWMA_SM3CAPTCTRLX_INP_SELX_MASK          (0x40U)                                             /*!< PWMA_SM3CAPTCTRLX.INP_SELX Mask         */
#define PWMA_SM3CAPTCTRLX_INP_SELX_SHIFT         (6U)                                                /*!< PWMA_SM3CAPTCTRLX.INP_SELX Position     */
#define PWMA_SM3CAPTCTRLX_INP_SELX(x)            (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< PWMA_SM3CAPTCTRLX.INP_SELX Field        */
#define PWMA_SM3CAPTCTRLX_EDGCNTX_EN_MASK        (0x80U)                                             /*!< PWMA_SM3CAPTCTRLX.EDGCNTX_EN Mask       */
#define PWMA_SM3CAPTCTRLX_EDGCNTX_EN_SHIFT       (7U)                                                /*!< PWMA_SM3CAPTCTRLX.EDGCNTX_EN Position   */
#define PWMA_SM3CAPTCTRLX_EDGCNTX_EN(x)          (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< PWMA_SM3CAPTCTRLX.EDGCNTX_EN Field      */
#define PWMA_SM3CAPTCTRLX_CFXWM_MASK             (0x300U)                                            /*!< PWMA_SM3CAPTCTRLX.CFXWM Mask            */
#define PWMA_SM3CAPTCTRLX_CFXWM_SHIFT            (8U)                                                /*!< PWMA_SM3CAPTCTRLX.CFXWM Position        */
#define PWMA_SM3CAPTCTRLX_CFXWM(x)               (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< PWMA_SM3CAPTCTRLX.CFXWM Field           */
#define PWMA_SM3CAPTCTRLX_CX0CNT_MASK            (0x1C00U)                                           /*!< PWMA_SM3CAPTCTRLX.CX0CNT Mask           */
#define PWMA_SM3CAPTCTRLX_CX0CNT_SHIFT           (10U)                                               /*!< PWMA_SM3CAPTCTRLX.CX0CNT Position       */
#define PWMA_SM3CAPTCTRLX_CX0CNT(x)              (((uint16_t)(((uint16_t)(x))<<10U))&0x1C00UL)       /*!< PWMA_SM3CAPTCTRLX.CX0CNT Field          */
#define PWMA_SM3CAPTCTRLX_CX1CNT_MASK            (0xE000U)                                           /*!< PWMA_SM3CAPTCTRLX.CX1CNT Mask           */
#define PWMA_SM3CAPTCTRLX_CX1CNT_SHIFT           (13U)                                               /*!< PWMA_SM3CAPTCTRLX.CX1CNT Position       */
#define PWMA_SM3CAPTCTRLX_CX1CNT(x)              (((uint16_t)(((uint16_t)(x))<<13U))&0xE000UL)       /*!< PWMA_SM3CAPTCTRLX.CX1CNT Field          */
/* ------- SM3CAPTCOMPX Bit Fields                  ------ */
#define PWMA_SM3CAPTCOMPX_EDGCMPX_MASK           (0xFFU)                                             /*!< PWMA_SM3CAPTCOMPX.EDGCMPX Mask          */
#define PWMA_SM3CAPTCOMPX_EDGCMPX_SHIFT          (0U)                                                /*!< PWMA_SM3CAPTCOMPX.EDGCMPX Position      */
#define PWMA_SM3CAPTCOMPX_EDGCMPX(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFFUL)          /*!< PWMA_SM3CAPTCOMPX.EDGCMPX Field         */
#define PWMA_SM3CAPTCOMPX_EDGCNTX_MASK           (0xFF00U)                                           /*!< PWMA_SM3CAPTCOMPX.EDGCNTX Mask          */
#define PWMA_SM3CAPTCOMPX_EDGCNTX_SHIFT          (8U)                                                /*!< PWMA_SM3CAPTCOMPX.EDGCNTX Position      */
#define PWMA_SM3CAPTCOMPX_EDGCNTX(x)             (((uint16_t)(((uint16_t)(x))<<8U))&0xFF00UL)        /*!< PWMA_SM3CAPTCOMPX.EDGCNTX Field         */
/* ------- SM3CVAL0 Bit Fields                      ------ */
#define PWMA_SM3CVAL0_CAPTVAL0_MASK              (0xFFFFU)                                           /*!< PWMA_SM3CVAL0.CAPTVAL0 Mask             */
#define PWMA_SM3CVAL0_CAPTVAL0_SHIFT             (0U)                                                /*!< PWMA_SM3CVAL0.CAPTVAL0 Position         */
#define PWMA_SM3CVAL0_CAPTVAL0(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM3CVAL0.CAPTVAL0 Field            */
/* ------- SM3CVAL0CYC Bit Fields                   ------ */
#define PWMA_SM3CVAL0CYC_CVAL0CYC_MASK           (0xFU)                                              /*!< PWMA_SM3CVAL0CYC.CVAL0CYC Mask          */
#define PWMA_SM3CVAL0CYC_CVAL0CYC_SHIFT          (0U)                                                /*!< PWMA_SM3CVAL0CYC.CVAL0CYC Position      */
#define PWMA_SM3CVAL0CYC_CVAL0CYC(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM3CVAL0CYC.CVAL0CYC Field         */
/* ------- SM3CVAL1 Bit Fields                      ------ */
#define PWMA_SM3CVAL1_CAPTVAL1_MASK              (0xFFFFU)                                           /*!< PWMA_SM3CVAL1.CAPTVAL1 Mask             */
#define PWMA_SM3CVAL1_CAPTVAL1_SHIFT             (0U)                                                /*!< PWMA_SM3CVAL1.CAPTVAL1 Position         */
#define PWMA_SM3CVAL1_CAPTVAL1(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM3CVAL1.CAPTVAL1 Field            */
/* ------- SM3CVAL1CYC Bit Fields                   ------ */
#define PWMA_SM3CVAL1CYC_CVAL1CYC_MASK           (0xFU)                                              /*!< PWMA_SM3CVAL1CYC.CVAL1CYC Mask          */
#define PWMA_SM3CVAL1CYC_CVAL1CYC_SHIFT          (0U)                                                /*!< PWMA_SM3CVAL1CYC.CVAL1CYC Position      */
#define PWMA_SM3CVAL1CYC_CVAL1CYC(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM3CVAL1CYC.CVAL1CYC Field         */
/* ------- SM3CVAL2 Bit Fields                      ------ */
#define PWMA_SM3CVAL2_CAPTVAL2_MASK              (0xFFFFU)                                           /*!< PWMA_SM3CVAL2.CAPTVAL2 Mask             */
#define PWMA_SM3CVAL2_CAPTVAL2_SHIFT             (0U)                                                /*!< PWMA_SM3CVAL2.CAPTVAL2 Position         */
#define PWMA_SM3CVAL2_CAPTVAL2(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM3CVAL2.CAPTVAL2 Field            */
/* ------- SM3CVAL2CYC Bit Fields                   ------ */
#define PWMA_SM3CVAL2CYC_CVAL2CYC_MASK           (0xFU)                                              /*!< PWMA_SM3CVAL2CYC.CVAL2CYC Mask          */
#define PWMA_SM3CVAL2CYC_CVAL2CYC_SHIFT          (0U)                                                /*!< PWMA_SM3CVAL2CYC.CVAL2CYC Position      */
#define PWMA_SM3CVAL2CYC_CVAL2CYC(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM3CVAL2CYC.CVAL2CYC Field         */
/* ------- SM3CVAL3 Bit Fields                      ------ */
#define PWMA_SM3CVAL3_CAPTVAL3_MASK              (0xFFFFU)                                           /*!< PWMA_SM3CVAL3.CAPTVAL3 Mask             */
#define PWMA_SM3CVAL3_CAPTVAL3_SHIFT             (0U)                                                /*!< PWMA_SM3CVAL3.CAPTVAL3 Position         */
#define PWMA_SM3CVAL3_CAPTVAL3(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM3CVAL3.CAPTVAL3 Field            */
/* ------- SM3CVAL3CYC Bit Fields                   ------ */
#define PWMA_SM3CVAL3CYC_CVAL3CYC_MASK           (0xFU)                                              /*!< PWMA_SM3CVAL3CYC.CVAL3CYC Mask          */
#define PWMA_SM3CVAL3CYC_CVAL3CYC_SHIFT          (0U)                                                /*!< PWMA_SM3CVAL3CYC.CVAL3CYC Position      */
#define PWMA_SM3CVAL3CYC_CVAL3CYC(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM3CVAL3CYC.CVAL3CYC Field         */
/* ------- SM3CVAL4 Bit Fields                      ------ */
#define PWMA_SM3CVAL4_CAPTVAL4_MASK              (0xFFFFU)                                           /*!< PWMA_SM3CVAL4.CAPTVAL4 Mask             */
#define PWMA_SM3CVAL4_CAPTVAL4_SHIFT             (0U)                                                /*!< PWMA_SM3CVAL4.CAPTVAL4 Position         */
#define PWMA_SM3CVAL4_CAPTVAL4(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM3CVAL4.CAPTVAL4 Field            */
/* ------- SM3CVAL4CYC Bit Fields                   ------ */
#define PWMA_SM3CVAL4CYC_CVAL4CYC_MASK           (0xFU)                                              /*!< PWMA_SM3CVAL4CYC.CVAL4CYC Mask          */
#define PWMA_SM3CVAL4CYC_CVAL4CYC_SHIFT          (0U)                                                /*!< PWMA_SM3CVAL4CYC.CVAL4CYC Position      */
#define PWMA_SM3CVAL4CYC_CVAL4CYC(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM3CVAL4CYC.CVAL4CYC Field         */
/* ------- SM3CVAL5 Bit Fields                      ------ */
#define PWMA_SM3CVAL5_CAPTVAL5_MASK              (0xFFFFU)                                           /*!< PWMA_SM3CVAL5.CAPTVAL5 Mask             */
#define PWMA_SM3CVAL5_CAPTVAL5_SHIFT             (0U)                                                /*!< PWMA_SM3CVAL5.CAPTVAL5 Position         */
#define PWMA_SM3CVAL5_CAPTVAL5(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM3CVAL5.CAPTVAL5 Field            */
/* ------- SM3CVAL5CYC Bit Fields                   ------ */
#define PWMA_SM3CVAL5CYC_CVAL5CYC_MASK           (0xFU)                                              /*!< PWMA_SM3CVAL5CYC.CVAL5CYC Mask          */
#define PWMA_SM3CVAL5CYC_CVAL5CYC_SHIFT          (0U)                                                /*!< PWMA_SM3CVAL5CYC.CVAL5CYC Position      */
#define PWMA_SM3CVAL5CYC_CVAL5CYC(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM3CVAL5CYC.CVAL5CYC Field         */
/* ------- OUTEN Bit Fields                         ------ */
#define PWMA_OUTEN_PWMX_EN_MASK                  (0xFU)                                              /*!< PWMA_OUTEN.PWMX_EN Mask                 */
#define PWMA_OUTEN_PWMX_EN_SHIFT                 (0U)                                                /*!< PWMA_OUTEN.PWMX_EN Position             */
#define PWMA_OUTEN_PWMX_EN(x)                    (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_OUTEN.PWMX_EN Field                */
#define PWMA_OUTEN_PWMB_EN_MASK                  (0xF0U)                                             /*!< PWMA_OUTEN.PWMB_EN Mask                 */
#define PWMA_OUTEN_PWMB_EN_SHIFT                 (4U)                                                /*!< PWMA_OUTEN.PWMB_EN Position             */
#define PWMA_OUTEN_PWMB_EN(x)                    (((uint16_t)(((uint16_t)(x))<<4U))&0xF0UL)          /*!< PWMA_OUTEN.PWMB_EN Field                */
#define PWMA_OUTEN_PWMA_EN_MASK                  (0xF00U)                                            /*!< PWMA_OUTEN.PWMA_EN Mask                 */
#define PWMA_OUTEN_PWMA_EN_SHIFT                 (8U)                                                /*!< PWMA_OUTEN.PWMA_EN Position             */
#define PWMA_OUTEN_PWMA_EN(x)                    (((uint16_t)(((uint16_t)(x))<<8U))&0xF00UL)         /*!< PWMA_OUTEN.PWMA_EN Field                */
/* ------- MASK Bit Fields                          ------ */
#define PWMA_MASK_MASKX_MASK                     (0xFU)                                              /*!< PWMA_MASK.MASKX Mask                    */
#define PWMA_MASK_MASKX_SHIFT                    (0U)                                                /*!< PWMA_MASK.MASKX Position                */
#define PWMA_MASK_MASKX(x)                       (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_MASK.MASKX Field                   */
